{
  "title": "Cafe D'Arc",
  "author": "Vendetta543",
  "chapters": [
    {
      "title": "Chapter 1",
      "text": "Like I said, here it is. A multi-chapter story of Jaune working as a maid and the women at Beacon actually being SUPER into it. This is just the beginning, so no smut yet. Just Jaune working at the maid cafe and then leading up to the first smut (Pyrrha, as per the vote).\r\n\r\n[line break]\r\n\r\nThe faint jingle of a bell above the door barely registered over the sound of Jaune's internal screaming. Standing stiffly in the middle of a quaint yet lavishly decorated cafe, he adjusted the frilly headband that threatened to slip off his head with every movement. The uniform- if it could even be called that- was black and white, complete with an apron, lacy trim, and an absolutely humiliating miniskirt that fluttered too much for his liking whenever he so much as breathed. His legs, now freshly shaven (a requirement, apparently), were on full display thanks to the knee-high socks he'd been required to wear. Topping it off was a pair of heels that made him look taller than he already was.\r\n\r\n\"How did I get here?\" Jaune muttered under his breath, eyes darting to the reflective surface of a nearby window. The answer stared back at him, blushing furiously in a maid uniform with a name tag that read Juliette. The name tag mocked him, dangling just below the lacy neckline of his outfit like some cruel cosmic joke.\r\n\r\nHe glanced toward the counter where the manager - a cheerful woman who exuded terrifying levels of energy - was humming to herself as she arranged pastries on a tray. She'd been the one to hire him after a brief interview that mostly involved her squinting at him suspiciously before declaring, \"You'll do!\" with way too much enthusiasm. He hadn't even realized what he was signing up for until she'd handed him the uniform and directed him to the changing room.\r\n\r\nJaune had almost walked out then and there. Almost. But then he'd caught a glimpse of the salary on the contract. His eyes had practically popped out of his skull. The amount they were offering for what was essentially waitstaff work was...well, it was astronomical, easily enough to cover his scroll payments, help his parents out back home (he still needed to apologize for running off with the family heirloom), and even save up for some upgrades to his gear. The cafe might have had a questionable theme, but the paycheck was no joke.\r\n\r\n\"Just think of it like when your sisters used to dress you up,\" Jaune murmured to himself. He could practically hear their laughter now, especially after they'd convinced him to participate in one of their impromptu tea parties while wearing an authentic princess dress. This is just a job, he told himself. A really, really embarrassing job, but a job nonetheless. Just think of the money he would make. No more having to wait for the weekly stipend or ask Pyrrha for a twenty.\r\n\r\n\"Juliette!\" The manager's chirpy voice jolted him out of his spiraling thoughts. She waved him over with an expectant smile, pointing at the tray she'd just finished assembling, \"Your first order! Table three. Smile big, okay? It's all about the customer experience!\" Jaune pursed his lips. Juliette, cause apparently Jeanne was just a little too on the nose.\r\n\r\nSwallowing his pride (and what little remained of his dignity), Jaune plastered on what he hoped was an enthusiastic smile. It probably looked more like a grimace, \"Right! Table three. Got it.\" He carefully picked up the tray, making sure not to jostle the drinks, and shuffled toward the indicated table.\r\n\r\nEach step made him hyper-aware of how different this uniform felt. The skirt swayed, the socks pinched slightly at his thighs, and the heels weren't exactly designed for someone who spent their days training with a sword. He was used to armor and sneakers, not...this.\r\n\r\nThe customers at table three were two young women, giggling behind their hands as they spotted him approaching. He forced his smile wider, though his cheeks burned, \"Here are your orders!\" he said brightly in a higher pitch than usual, setting the drinks down carefully, \"P-Please call me again if you need anything, mistress!\"\r\n\r\n\"Thank you, Juliette~,\" one of them cooed, her tone dripping with amusement. The other one giggled again, glancing down at his legs before murmuring something to her friend that made them both laugh even harder.\r\n\r\nJaune clenched his jaw, his smile stiffening. Ignore it. Ignore it. You're here for the money, he chanted internally like a mantra, \"Enjoy your drinks!\" he said, adding a small curtsy for good measure. The movement made the skirt flare just enough for the girls to let out audible oohs, and he retreated as quickly as he could without sprinting. He didn't like how he could feel their eyes staring at his butt when he walked off.\r\n\r\nBack behind the counter, the manager gave him an approving thumbs-up, \"You're a natural! Keep up the good work, Juliette!\" Jaune managed a weak nod, already questioning every decision he'd ever made that led him to this point.\r\n\r\nHe cringed again, the soft hum of the cafe doing little to drown out his inner turmoil. Why does this have to be so easy? It was an unwelcome truth, one he'd spent years trying to dodge or laugh off. Sure, he was tall, but that didn't stop his figure from being frustratingly slender, his shoulders not quite broad enough, and his jaw never quite sharpening into the rugged shape and beard he'd imagined in his younger days. And his face. Ugh. His stupid, smooth, frustratingly symmetrical face that practically begged his sisters to slap makeup on it every chance they got.\r\n\r\n\"You're too cute to be a boy, Jauney~\" his oldest sister - Jade - would tease, pinching his cheeks until they were red. Then, of course, the others would chime in, vying for their turn to transform him into their personal dress-up doll. The worst part? He knew he was just as much to blame. He'd complained, sure, but he'd never fought hard enough to put a stop to it. His older sisters would use their sibling authority and his younger ones would pout and beg. At some point, it became easier to sigh and let them have their fun than to argue.\r\n\r\nAnd now here he was, a \"maid\" in a bustling cafe, leaning into years of unwanted training to survive. His voice, when he pitched it high enough, sounded disturbingly natural. He didn't need much practice to get it right, \"Thank you so much for coming today!\" he chirped to the giggling customers, his tone sugary sweet and without any of his usual awkwardness. The easy way it slipped out out made him want to crawl into a hole. Damn you, sisters! Damn youuu!\r\n\r\n'You're just doing a job', he reminded himself, gripping the counter as another group of customers walked through the door. 'A really, really well-paid job.' His fingers brushed the frilly hem of his apron, and his eye twitched.\r\n\r\nIt didn't help that the manager had said he \"looked perfect for the job\" during the interview. She hadn't even hesitated. She'd handed him the uniform without batting an eye, as if he'd been made for it. And worst of all, she'd been right. The maid outfit hugged his form a little too well, the skirt swaying with an elegance that his armor could never hope to replicate. The thigh-high socks somehow made his legs look longer, and the heels, while uncomfortable, suited the look better than any sneakers ever could.\r\n\r\nJaune felt a shiver run down his spine. It was wrong how good he looked. Back home, the running joke had always been that there were eight Arc sisters instead of seven, and now, standing in front of the cafe's reflective window, he couldn't help but see why. His hair, which he'd never bothered cutting shorter than neck length, framed his face in a way that made him look...disturbingly pretty.\r\n\r\n\"Juliette!\" the manager called again, her chipper tone snapping him out of his thoughts. She gestured to another tray waiting on the counter, \"You've got table six next! Remember, big smile!\"\r\n\r\n\"Right, big smile,\" Jaune muttered, forcing his lips into the same bright expression that had carried him through the last ten minutes. He grabbed the tray and made his way to the table, carefully balancing the drinks.\r\n\r\nThis time, it was a group of older women, their eyes lighting up the moment they spotted him, \"Oh my, aren't you adorable!\" one of them said, leaning forward with a smile that made Jaune's stomach churn. Why were the customers mostly women, he wondered. He'd have thought a Maid Cafe would cater mostly to men, but they were the minority.\r\n\r\n\"Um, thank you,\" he managed, his voice slipping effortlessly into the higher pitch. He set their drinks down, praying they wouldn't notice the slight tremble in his hands.\r\n\r\n\"Such lovely manners too,\" another woman added, her gaze lingering on his face, \"You remind me of my granddaughter. So sweet and delicate!\"\r\n\r\nJaune barely resisted the urge to groan. Sweet and delicate? Great. Just what every aspiring huntsman wanted to hear. He gave them a polite curtsy, the movement automatic at this point, \"Please enjoy your drinks, mistresses,\" he said, retreating as quickly as possible before they could comment on anything else.\r\n\r\nBack behind the counter, Jaune took a deep breath, his fingers gripping the edge of the counter until his knuckles turned white. 'I'm doing this for the money,' he reminded himself for the hundredth time. 'Just a few more hours, and I'll be one step closer to paying off that stupid scroll. No one I know is going to find out about this. I'll be fine. Totally fine.'\r\n\r\n[line break]\r\n\r\nAn hour later, Jaune's forced smile froze, his entire body stiffening as the cheerful jingle of the cafe door sent a chill down his spine. He suddenly had a bad feeling. His head turned slightly, just enough to confirm his worst fear. Entering the cafe, looking entirely out of place among the frilly decor, were none other than Ruby, Weiss, Blake, and Yang. Yang looked like she was about to laugh her ass off, Weiss strutted in like she owned the place, Ruby oohed and ahhed as she looked around, and Blake looked distinctly unimpressed, particularly when she spotted some of the maids wearing fake cat ears and tails.\r\n\r\nThe tray in Jaune's hands wobbled as panic surged through him, 'No. No, no, no. This isn't happening.' He ducked behind the counter as casually as he could manage, his heart pounding in his chest. 'They can't see me. There's no way they'd recognize me in this outfit...right?'\r\n\r\nHe dared a glance over the edge of the counter, just in time to catch Yang slinging an arm around Weiss's shoulders, \"Alright, Weiss, spill it. Why are we here?\" Yang's grin was as wide as ever, her eyes darting around the cafe, \"This doesn't exactly scream your vibe.\"\r\n\r\nWeiss sniffed, adjusting her bolero jacket with a practiced air of disdain, \"Because, Yang, I am used to a very particular lifestyle. One that Beacon, unfortunately, cannot accommodate.\" Her sharp eyes swept the room, landing on the plush chairs and delicate teacups, \"Since the academy lacks servants to attend to my various needs, I've decided this cafe will have to suffice. It's gotten good reviews online, so I can at least hope that they perform semi-adequately.\"\r\n\r\nBlake raised an eyebrow, her expression half-amused, half-exasperated, \"So...this is your solution to Beacon's lack of butlers and maids? A place where the employees put on Faunusface?\"\r\n\r\n\"Exactly,\" Weiss said with a curt nod, completely unbothered by the stares of her teammates, \"A touch of refinement never hurt anyone. Some of us have standards.\"\r\n\r\nYang burst out laughing, \"Standards, huh? You mean the kind of standards where someone else pours your tea for you? What's next, you gonna make us bow before entering your room?\"\r\n\r\n\"Don't be ridiculous, Yang,\" Weiss said, rolling her eyes, \"You three would make horrible maids. You don't have the proper deference\" She led the way to a table near the center of the cafe, her head held high like a queen surveying her domain. Ruby trailed after her, looking a little unsure. Yang rolled her eyes too and sat across them. Blake went last, muttering to herself that she could be reading right now instead of having to deal with Weiss' weird fetishes.\r\n\r\nJaune, meanwhile, was trying desperately to become one with the counter. This was bad. This was so, so bad. He was debating whether to bolt out the back door when the manager's chipper voice rang out behind him.\r\n\r\n\"Juliette!\" she said, practically singing his alias as she bustled over, \"Table twelve needs service. That's a Schnee over there!\" She gave him a little nudge, her eyes sparkling, \"Big money, Juliette! Go make an impression!\"\r\n\r\nJaune felt his stomach drop, \"Do I have to?\" he asked in a strained whisper. He was tempted to just leave right now, but he hadn't even put in a full eight hours of work yet. He probably wouldn't have even gotten paid for the work he already put in.\r\n\r\nThe manager's cheery expression turned razor-sharp in an instant, her eyes narrowing in a way that made him shudder, \"Yes, you have to,\" she said sweetly, but her tone brooked no argument. She shoved a tray of into his hands before pushing him toward the table, \"Go on! Big smiles! I heard the Schnees give generous tips!\"\r\n\r\nWith shaking hands, Jaune slowly made his way to his execution, 'This is it. This is how I die,' Jaune thought as he trudged toward the table, his head down and his heart racing. 'I'm going to trip, or they're going to hear my voice, or something is going to happen and they're going to know it's me. And then I'll have to transfer to another school. Or another kingdom.' He'd have to go to Vacuo or Mistral and get a fake name. Felipe. He was gonna be Felipe and live life on the run.\r\n\r\nAs he approached, Ruby was the first to notice him, her eyes lighting up, \"Oh, here comes the maid!\" she said brightly, leaning forward in her seat. The purity in those silver eyes made him want to scream.\r\n\r\nJaune gritted his teeth and forced his voice back into its higher pitch, \"Good afternoon, mistresses~ Welcome home! My name's Juliette! What can I get for you today?\" He kept his head slightly bowed, letting his hair obscure his face as much as possible. He both cursed and blessed the hair extensions the manager forced him to wear.\r\n\r\nWeiss gave a curt nod, clearly pleased, \"We'll start with tea, and make it quick. I don't appreciate waiting.\"\r\n\r\nYang smirked, glancing at him. Juliette, \"Wow, bossy much? Don't worry, uh...Juliette, was it? Take your time. No need to rush for her.\" Yang ignored Weiss' scowl, \"I'll have the omelette rice and, uh, vanilla iced coffee! You guys don't serve alcohol, do you?\"\r\n\r\n\"U-Unfortunately not, mistress.\" The last thing anyone needed was anyone getting drunk and handsy.\r\n\r\n\"Ah, damn.\"\r\n\r\n\"Ooh, I want the crepe!\" Ruby chirped, pointing it out on the menu, \"Strawberries and chocolate please!\"\r\n\r\n\"A-And you?\" He turned slightly to Blake.\r\n\r\n\"...Water.\"\r\n\r\n\"Aw come on, Blake!\" Yang huffed, \"Weisscream's treating us!\"\r\n\r\n\"I refuse to give money to something that fetishizes my race, Yang.\"\r\n\r\n\"Ugh, you're being such a buzzkill! Juliette, help me out here!\"\r\n\r\n\"It's not my place to queston my mistresses' wishes.\" At least that was the truth. Customer service, customer was always right, bla bla bla...\r\n\r\n\"Hm, good. At least the maids here are properly trained.\" Weiss nodded in approval, \"Bring my tea out first, would you? I'm parched.\"\r\n\r\nJaune's hands tightened on the tray, his knuckles white, \"I'll bring your tea right away,\" he said quickly, turning on his heel before Yang could study him too closely. The walk back was stiff, like he had a brace strapped across his back. Fuck, fuck, fuck! Ugh! He shook his head. It would be okay, he told himself. All he had to do was serve them their orders and then they'd leave. If he got lucky, Weiss would give him a tip he could use to treat his team. Right. It wasn't all bad.\r\n\r\nBehind the counter, Jaune tried to collect himself as he prepared the order. His hands were shaking, and he felt a drop of sweat run down his back. Get through this, he told himself. They didn't know it was him and they wouldn't know.\r\n\r\nHe took a deep breath and carried the tray back to the table, setting the teapot and cups down with as much grace as he could muster. Weiss inspected the tea like a jeweler examining a diamond, while Ruby gave him a small, friendly smile. Blake, thankfully, seemed more interested in her book than the service, \"Is there anything else you need?\" Jaune asked, keeping his voice steady, \"If not, I'll get the rest of your orders ready.\"\r\n\r\n\"Not right now,\" Weiss said dismissively, waving him off.\r\n\r\nYang, however, leaned back in her chair, giving him a look that made his skin crawl, \"You know, Juliette, you're kinda tall for a maid, and those legs...do you work out or something?\" Jaune's breath caught, and for a terrifying moment, he thought she'd caught on. But she just grinned, her teasing tone aimed more at Weiss than him, \"You've got some competition in the elegance department, Weiss. Watch out.\"\r\n\r\nWeiss scowled, \"Don't be ridiculous. Elegance is more than appearance. It's about refinement and-\"\r\n\r\nJaune didn't wait to hear the rest, quickly retreating to the counter before anyone could ask more questions. He survived. For now.\r\n\r\nMinutes later, Jaune's hands felt like they were trembling as he approached their table again, balancing the tray with Yang's omelette and coffee, Ruby's crepe, and Blake's water (the manager gave him a funny look when she saw it on the list). His earlier retreat had given him a chance to compose himself - just barely - and he was determined to get this over with as quickly as possible. Serve them, smile, leave. Serve them, smile, leave. He repeated it like a mantra in his head.\r\n\r\nHe reached the table, setting down the items one by one. Ruby beamed as he placed the crepe in front of her, the bright red strawberries and swirls of chocolate making her bounce in her seat. Blake barely spared him a glance as she muttered a quiet \"thank you\" and took her water. Yang, meanwhile, watched him like a cat eyeing a fat, slow mouse, her smirk widening as her order landed in front of her.\r\n\r\n\"Enjoy your meal, mistresses,\" Jaune said in his best service voice, turning on his heel to escape before anything could go wrong.\r\n\r\n\"Wait, wait, wait!\" Yang's voice rang out, stopping him in his tracks. He froze, his back still to the table, silently pleading to whatever gods might be listening that this wasn't what he thought it was. Slowly, he turned back around, his forced smile firmly in place.\r\n\r\n\"Yes, mistress?\" he asked, his voice sweet as sugar despite the rising feeling of dread in his gut.\r\n\r\nYang leaned back in her chair, balancing it precariously on its rear legs as she grinned up at him, \"Aren't maids supposed to, you know, serve the food? Like, make it special? I mean, I've seen those videos online.\"\r\n\r\nJaune blinked, his stomach sinking further, \"What...kind of special service do you mean, mistress?\"\r\n\r\nYang snickered, pointing at her omelette with the ketchup bottle sitting innocently on the table, \"You're supposed to draw a heart on the omelette with ketchup, right? And then do a cute little pose? Something like, 'Here's your meal, ojou-sama~!' in those Mistralian cartoons.\" She ignored Blake's offended sniff about how it was called Anime, \"You know the deal.\" Her grin was all teeth now, clearly enjoying herself. Damn you, Yang! \"I want that!\"\r\n\r\nJaune's forced smile twitched, 'This can't be happening. This is some kind of punishment for me sneaking my way into Beacon. That's gotta be it.'\r\n\r\nWeiss groaned, rubbing her temple, \"Really, Yang? Must you turn everything into a joke? Just eat the food. Have some grace.\"\r\n\r\n\"No way!\" Yang huffed, \"We're at a maid cafe. I'm getting the full experience!\" She turned back to Jaune, eyes twinkling with mischief, \"Come on, Juliette. You've gotta do it. Right? Your mistress says so.\"\r\n\r\nRuby was too busy with her crepe to weigh in, happily munching away while Blake gave Yang a sidelong glance, \"You're enjoying this way too much,\" Blake muttered, though the faint twitch of her lips made it obvious she was having fun too. Jerk.\r\n\r\nJaune looked toward Weiss, hoping for some form of reprieve. She just crossed her arms and sniffed, \"She's paid to serve us, Yang. If you insist on this ridiculous request, fine, but just know you're looking like a boor.\"\r\n\r\n'Great. Thanks for nothing, Weiss.'\r\n\r\nWith no other options, Jaune reluctantly stepped closer to the table, his hands gripping the ketchup bottle so tightly that it squeaked in protest. He stared at the omelette as if it were the executioner's block, internally debating whether he could fake a sudden illness and escape. But the manager's sharp gaze from across the room told him otherwise. Don't screw this up, her eyes seemed to say. He could practically see the lien notes in her eyeballs.\r\n\r\n\"Fine,\" he muttered, though he quickly corrected himself with a chirpy, \"Of course, mistress! One moment, please!\"\r\n\r\nHe unscrewed the cap of the ketchup bottle and bent down slightly, trying to block out Yang's barely-contained laughter as he carefully squeezed the condiment onto the omelette. The lines weren't perfect, and the heart was slightly lopsided, but it was passable. He finished it off with a flourish, snapping the cap back on and placing the bottle neatly on the table.\r\n\r\nYang looked down at the heart, then back up at him expectantly, \"And the pose?\"\r\n\r\nJaune wanted to scream...and maybe smash that omelette in Yang's face. Instead, he forced his trembling hands to clasp together in front of him in a heart shape, bent slightly at the waist, and tilted his head to the side, \"Here's your meal, ojou-sama~!\" he chirped, his voice a pitch higher than he thought physically possible.\r\n\r\nYang burst out laughing, her chair slamming back onto all four legs as she clutched her sides, \"Oh, my God, that was amazing! You're so good at this!\"\r\n\r\nRuby finally looked up from her crepe, crumbs on her cheeks, \"Aw, I missed it! Do it again!\"\r\n\r\n\"No!\" Jaune yelped, then coughed to correct himself, \"I-I mean, please tell me if you need anything else, mistress~.\" Before anyone could say another word, he spun on his heel and marched back to the counter, his face red enough to match the ketchup. He set the tray down with a shaky exhale, his dignity hanging by a thread.\r\n\r\n\"Big smiles, Juliette!\" the manager called out, giving him a thumbs-up, \"You're doing great! Oh, if a Schnee gives a good review, we'll be rolling in it!\"\r\n\r\nJaune resisted the urge to groan. Why me, he thought. There were close to a dozen other maids here, so why was the manager picking on him? He was too anxious to even ogle the rest of the staff. The only guy in a cafe full of women dressed in frilly maid outfits and he hated every second of it, 'Do it for the money.' He grit his teeth. That salary had more zeroes than any other job in this part of Vale. The only thing that would've paid more was smuggling drugs, and that was illegal. And wrong.\r\n\r\nIt took half an hour for team RWBY to finish. Half an hour of Jaune sweating bullets and praying to whatever god out there that he wouldn't get caught. When Weiss finally called him over to get the check, Jaune returned to the table with with the bill and an overly chipper expression that looked way too fake to be genuine. He carefully placed the receipt near Weiss, who had made an offhand comment about the table not being pristine enough for her refined standards. As he stepped back, Blake's golden eyes flicked up from her book, watching him with unnerving intensity.\r\n\r\n\"Juliette,\" Blake said softly, her tone neutral but sharp enough to cut through the ambient noise of the cafe.\r\n\r\nJaune stiffened slightly but maintained his smile, \"Yes, mistress? Is there something I can assist you with?\"\r\n\r\nBlake set her book down, folding her hands neatly in her lap. Her gaze never wavered as she tilted her head slightly, \"You smell familiar.\"\r\n\r\nHis heart skipped a beat, \"I...beg your pardon?\"\r\n\r\n\"I said,\" Blake continued, her voice steady, \"You smell familiar. Like soap, steel, and...\" She sniffed lightly, her nose wrinkling ever so slightly, \"Sweat. The exact same as Jaune after he finishes training.\"\r\n\r\nJaune felt the tray in his hands wobble. He gripped it tightly to steady himself, his lips stretching into a forced grin. What the fuck? Sweat? How in the hell could she tell someone's sweat?! That wasn't Faunus senses, that was just plain bullshit! \"I-I'm sure you must be mistaken, mistress. Perhaps someone else here uses a similar soap?\"\r\n\r\nBlake arched a delicate brow, \"Maybe. But then there's the way you walk.\"\r\n\r\nJaune blinked, \"My...walk?\"\r\n\r\n\"Yeah,\" she said calmly, \"You're way too stiff for someone playing the role of a maid. Most people wouldn't notice, but I've seen you in combat drills. You move the exact same way when you're trying to avoid falling flat on your face.\"\r\n\r\n\"That's not-\"\r\n\r\n\"And you've got the same scar Jaune has from that training accident a month back.\" Jaune's eyes snapped to the faint line above his right knuckles and he quickly covered it with his left hand. He cursed himself for not wearing the frilly gloves the manager offered him earlier.\r\n\r\n\"Yo, Blake, what's going on?\" Yang asked. Blake ignored her, too focused on the nervously sweating maid.\r\n\r\nJaune's smile faltered for a fraction of a second before he caught himself, \"Mistress, I assure you-\"\r\n\r\n\"And your voice.\" Blake leaned back in her chair, her gaze sharpening further, \"It's pitched higher, but you slipped earlier when Yang teased you. I caught it.\"\r\n\r\nJaune felt a bead of sweat roll down his back, \"I-I don't know what you're talking about. I'm Juliette, just a maid serving at this cafe~.\"\r\n\r\nBlake tilted her head again, her expression unreadable, \"Are you?\"\r\n\r\n\"Yes!\" Jaune snapped, the strain in his tone painfully obvious, \"I don't even know this Jaune person you're talking about!\"\r\n\r\nBlake stared at him for a moment longer, then her lips curved into the faintest of smirks, \"If you're not Jaune,\" she said, her voice dropping into a casual drawl, \"Then why are you sweating so much?\"\r\n\r\n\"B-Because I'm being accused by a stranger of being someone I'm not!\" Jaune snapped.\r\n\r\nBig mistake. Whether it was nerves or something else, he couldn't keep up the pitch in his voice. Instead of the voice of Juliette the maid, what came out was the very indignant voice of Jaune Arc. Jaune froze, his heart sinking into the pit of his stomach as the slip of his voice echoed in the air like a death knell. For a moment, there was silence - a terrible, foreboding silence that almost choked him with how heavy it was.\r\n\r\nThen the chaos began.\r\n\r\nYang's reaction came first, her eyes snapping wide open in recognition. Unfortunately for her, she'd been leaning her chair precariously back on two legs, her usual confidence betraying her in the worst possible moment, \"Wait a se-!\" she began, but gravity cut her off. The chair tilted too far, and with a loud crash, Yang toppled backward, landing flat on her ass. Her wild laughter immediately followed, ringing through the cafe as she pointed an accusatory finger at him from her new spot on the floor.\r\n\r\n\"Oh my God, it is you!\" she howled, clutching her sides, \"Jaune, what the hell are you doing in a maid outfit?!\" Tears of laughter streamed down her face, and her chair wobbled pitifully on its side next to her.\r\n\r\nRuby's gasp was so sharp it sounded like she'd just uncovered a shocking plot twist in one of her favorite comic books. She leaned forward, her wide eyes practically sparkling as she scanned him up and down, \"Jaune?!\" she squeaked, barely able to process the sight before her, \"Is that really you? Like...you-you're actually wearing...that?\" Her finger wavered as she pointed at his frilly uniform, her face somewhere between horrified and fascinated.\r\n\r\nJaune's blush deepened to an alarming shade of crimson, \"I-I can explain!\" he stammered, his voice cracking as he tried to gesture toward them, \"It's not what it looks like-\"\r\n\r\n\"It's exactly what it looks like!\" Yang cut in, still laughing hysterically, \"Oh, this is priceless! I knew you'd look good in a dress, but I didn't think you'd commit this hard!\" She doubled over again, her laughter devolving into wheezing giggles.\r\n\r\nThe absolute worst reaction, however, came from Weiss. At first, her expression was one of pure shock, her icy blue eyes blinking rapidly as if trying to process the impossible. Her lips parted, but no sound came out. Then, slowly, the shock gave way to something much more dangerous: indignation. Her jaw tightened, and her arms crossed over her chest as she stared at him like she'd just uncovered some sort of cosmic injustice.\r\n\r\n\"How?\" Weiss hissed, her voice trembling with disbelief. The next words to come out of her mouth were the last ones he expected, \"How do you look so pretty?!\" She jabbed a finger toward him, her sharp tone growing more incredulous with each word, \"You're supposed to be...well, you! And yet here you are, in my presence, looking more refined in that ridiculous outfit than some of the actual maids I've hired! It's infuriating!\"\r\n\r\nJaune blinked, completely taken off guard, \"Wait, what?\"\r\n\r\n\"And another thing!\" Weiss continued, her frustration mounting, \"How do you-\" She gestured vaguely toward his chest, her cheeks reddening with outrage, \"How do you even have those?! You're flat as a board!\"\r\n\r\nJaune's face burned hotter as he stammered, \"T-they're fake! Padding! It's part of the uniform!\" His voice cracked again, and he swore he could hear Yang trying to catch her breath from laughing too hard.\r\n\r\nWeiss let out a noise somewhere between a groan and a gasp, throwing her hands in the air, \"Fake or not, the fact that you even bothered- ugh! This is beyond humiliating!\"\r\n\r\n\"For who?\" Jaune asked weakly, the question earning him a withering glare that immediately made him regret opening his mouth.\r\n\r\n\"I don't know how you managed this,\" Weiss seethed, \"But you've officially ruined this cafe for me. I hope you're proud of yourself!\"\r\n\r\nMeanwhile, Ruby looked as though she were still trying to wrap her head around the situation, \"Wait, wait, wait,\" she said, holding her hands out in a gesture for calm that was entirely out of place considering the storm of emotions brewing at the table, \"So...Jaune's been our maid this entire time?\"\r\n\r\n\"Looks like it!\" Yang chimed in, still on the floor, \"Man, this makes the whole ketchup-heart thing even better. You seriously drew a heart on my omelette while wearing this?\" She gave him a look that was a mix of amazement and pure, unadulterated smug.\r\n\r\nJaune groaned, burying his face in his hands, \"Please...Please don't bring that up.\"\r\n\r\n\"Oh, I'm definitely bringing it up,\" Yang said, smirking at him, \"I'm gonna bring it up every time I see you in the cafeteria. 'Hey Jaune, can you draw me another ketchup heart? You're so good at it!'\"\r\n\r\nRuby tilted her head, finally noticing how red Jaune's face had become, \"Wait, are you okay? You're, like, really red. Do you have a fever?\" She paused, then gasped, \"Oh no! What if you're sick? That's why you took this job, right? To pay for medicine!\"\r\n\r\nJaune shot her an incredulous look, \"No, I'm not sick, Ruby!\"\r\n\r\nRuby pouted, \"Oh. Well...you could've been.\"\r\n\r\nBlake, who had been silent through most of the exchange, finally spoke up, her calm voice cutting through the chaos, \"So...you're doing this for the money,\" she said, her tone flat but tinged with the faintest hint of amusement, \"That's why you're working here. Because you needed the money.\"\r\n\r\nJaune's shoulders slumped, his arms hanging limply at his sides, \"Yes,\" he muttered, his voice barely audible, \"I needed the money. And this place pays really well, okay?\"\r\n\r\nYang snorted, unable to contain herself, \"Dude, you should've just asked me for some lien! I'd have given you the money and saved you from all this!\"\r\n\r\nJaune shot her a glare, his voice finally rising above the chaos, \"You think I'd want to owe you money after this? No thanks!\"\r\n\r\nYang cackled again, \"Fair point!\"\r\n\r\nMeanwhile, Weiss shook her head, still visibly fuming as she muttered, \"Unbelievable. Just...unbelievable.\" She turned her attention to the manager, who was watching the scene unfold with an amused smile, \"You! How much do you pay your staff? Out of curiosity.\"\r\n\r\n\"Oh, quite a lot,\" the manager replied cheerfully, \"More than enough to justify the...unique requirements of the job.\"\r\n\r\nWeiss huffed, crossing her arms again, \"Typical. This kingdom truly has no standards.\"\r\n\r\nJaune groaned and clasped his hands together in a desperate plea, his voice trembling as he looked at his sister team, \"Please. Please don't tell anyone about this! I'll do anything. Just keep it between us, okay?\"\r\n\r\nRuby's expression softened immediately, her face crumpling in concern, \"Aw, Jaune, I wouldn't tell anyone! You don't have to worry about me.\" She gave him a reassuring smile, though it faltered slightly as she added, \"But...uh, I might have some questions later. This is kinda weird.\" She suddenly blushed, \"N-Not like a bad weird or anything!\"\r\n\r\n\"Questions can wait,\" Weiss snapped, her tone still sharp as she crossed her arms and glared at Jaune, \"I'm still trying to process how this is even possible!\" Her eyes narrowed as she scrutinized him like she was trying to solve a really annoying captcha, \"For instance, why is your makeup so good?! It's entirely too clean and precise for someone like you!\" He was almost offended by her indignant tone. What the heck did she mean 'someone like him'?\r\n\r\nJaune winced, his blush deepening, \"I...had practice,\" he admitted reluctantly, \"My sisters used to, uh...dress me up. A lot.\"\r\n\r\nWeiss's eyes widened in disbelief, \"That's where you learned this? Your sisters?!\" She threw her hands in the air, \"Unbelievable. Just- ugh!\" She shot a glare down at his feet, \"And the heels! Why are you wearing heels?! You're already tall enough!\"\r\n\r\n\"It's part of the uniform!\" Jaune said quickly, his voice almost cracking, \"I didn't choose them!\" He loooked to his manager for help, but the older woman was pointedly looking away and whislting innocently. The rest of the maids and customers weren't any help either. They apparently all decided it was none of their business.\r\n\r\n\"And your voice!\" Weiss continued, her frustration mounting, \"How is your voice so...so authentic?! You sounded like a completely different person earliee!\"\r\n\r\n\"I don't know!\" Jaune said, exasperated, \"I just...I've always been able to do it, okay?! Stop asking!\"\r\n\r\nWeiss's gaze dropped to his skirt and thigh-high socks, her expression pinched. Her voice lowered to a mortified whisper, \"And...And how, exactly, are you keeping your...you know what hidden?\"\r\n\r\nJaune's mouth fell open, his face practically glowing red, \"Stop staring!\" he hissed, practically hopping back a step and clutching his skirt like it could shield him from her scrutiny. Blake made a crack about how he was acting like someone straight out of an anime. He ignored her.\r\n\r\nWeiss's cheeks flushed a matching shade of crimson, and she turned her face away with an indignant huff, \"Well, I had to ask! It's distracting! Is it lacking in size? Is that how you're able to hide it so well?\"\r\n\r\n\"NO!\" Jaune shrieked, \"It's above average, thank you very much!\"\r\n\r\nYang finally picked herself up off the floor, brushing off her shorts with a sly grin, \"You know, Weiss,\" she said, her tone dripping with mischief, \"I can't tell if you're mad because Jaune's pulling this off better than you ever could, or if you're jealous.\"\r\n\r\nWeiss stiffened, whirling to face her with wide, offended eyes, \"Excuse me?!\"\r\n\r\nYang's grin widened. She smelled blood in the water, \"Yeah, I mean, you're laying it on really thick. Talking about his makeup, the heels, the voice, even asking about the, uh, other stuff. If I didn't know better, I'd say you want to- \" She wiggled her eyebrows suggestively, making a circle with her right hand then shoving her index finger inside \"-have some fun while he's in that dress.\"\r\n\r\nRuby, halfway through a sip of her water, choked and started coughing violently, \"Yang!\" she gasped, slamming the glass back on the table as her face turned red.\r\n\r\nJaune looked like he wanted to melt into the floor and disappear forever, \"That is not helping!\" he yelled.\r\n\r\nWeiss' face turned an angry shade of red and she sputtered, \"H-how dare you insinuate such a thing?!\" she snapped, her voice climbing to an octave Jaune hadn't even thought possible, \"Why on Remnant would I ever - ever - think of doing that with him?!\"\r\n\r\nYang smirked, leaning forward on her elbows, \"I don't know, you tell me,\" she said smoothly, \"You're the one grilling him like he's a piece of meat.\" Jaune groaned. Seriosuly? Puns? Right now? That was definitely why he never had a crush on her. She'd turn anything into a pun if she could help it. He went to her comedy night.\r\n\r\nWeiss' hands balled into fists at her sides and she glared daggers at Yang. If looks could kill, the grinning blonde would've already been six feet under, \"I am merely pointing out the absurdity of this situation! I am not - repeat, not - jealous, and I certainly don't want to- ugh!\" She cut herself off with a frustrated growl, her composure teetering dangerously. Jaune was too mortified to be offended that she called his dick small earlier.\r\n\r\nRuby, still coughing, raised a shaky hand, \"Um...maybe we should all calm down? Like, right now?\"\r\n\r\nBlake, who had been silently observing the entire exchange with a raised brow, finally spoke up, \"This is...fascinating,\" she said, voice as dry as cardboard, \"But we are still in public, you know.\"\r\n\r\nThe reminder seemed to snap everyone back to reality. Weiss straightened her posture with a haughty sniff, her face still red. Yang chuckled and picked up her chair, sitting back down smugly. Ruby looked between them nervously, as if unsure whether to intervene. Meanwhile, Jaune groaned, burying his face in his hands, \"I'm never going to live this down, am I?\" he muttered.\r\n\r\nYang patted him on the back with a grin, \"Not a chance, maid boy. Not a chance.\"\r\n\r\n[line break]\r\n\r\nJaune had somehow managed to scrape through the rest of the team RWBY ordeal without further disaster. After what felt like a lifetime of awkwardness, pointed stares, and Yang's relentless teasing, the four finally left the cafe, Weiss dragging them out with a huff after paying the bill. Jaune didn't even bother looking at how much she tipped. His only priority was to survive the rest of his shift without collapsing into a puddle of mortified embarrassment.\r\n\r\nHe tried to shake off the feeling of impending doom as he returned to his duties. Cleaning tables, refilling sugar jars, and forcing a smile whenever another customer addressed him as Juliette. All the while, a heavy pit of dread sat in his stomach, growing larger with every passing minute. He couldn't stop replaying their reactions in his mind. Weiss's indignant accusations, Ruby's wide-eyed disbelief, Blake's raised brow, Yang's insufferable smirk- Oh, God, Yang. She was never going to let this go. Every meal at the Beacon cafeteria would be a reminder of his humiliation, served with a side of ketchup hearts.\r\n\r\nNo, he told himself, gripping the edge of the counter as he tried to focus on the present, 'I'll be fine. They promised not to tell anyone. I just have to get through this shift, go back to Beacon, and...I don't know. Lay low for a few weeks? Months? Maybe I can transfer to Atlas.'\r\n\r\nHe glanced at the clock. Just fifteen more minutes. If he could keep his head down and avoid any more surprises, he'd be home free with a pocket full of lien.\r\n\r\nJaune was halfway through wiping down a table when the cafe door slammed open with enough force to make the little bell above it jingle frantically. He jumped, his heart skipping a beat as he turned toward the source of the commotion. Standing in the doorway, framed by the golden afternoon light, was Pyrrha.\r\n\r\nAnd she looked...off.\r\n\r\nHer normally serene face was flushed an alarming shade of red, her emerald eyes darting around the cafe like she was hunting for something. Or someone. Her breathing was quick and shallow, her chest rising and falling as if she'd just sprinted all the way from Beacon. A bead of sweat trailed down her temple, and her expression was a mix of determination and something else Jaune couldn't quite place. Either way, it was terrifying.\r\n\r\n\"P-Pyrrha?\" Jaune stammered softly to himself, gripping the rag in his hand like a lifeline, \"What's she doing here?\" Pyrrha didn't say word. Her eyes scanned the room, narrowing slightly as they passed over the other customers and staff. Then, like a predator locking onto its prey, her eyes landed squarely on him. Her face turned even redder - if that were possible - and her lips parted slightly, but no words came out. Nothing but a soft gasp.\r\n\r\n\"Uh...\" Jaune took a cautious step back, his instincts screaming at him to flee, \"M-Mistress? Do you need help with something?\" This was all a coincidence, he told himself. She was just here to...get a drink or some food or something. Team RWBY promised they wouldn't say anything!\r\n\r\nAgain, Pyrrha said nothing. Her lips pressed into a thin line as she closed the distance between them with alarming speed. Jaune barely had time to process what was happening before her hands shot out, grabbing him firmly by the shoulders.\r\n\r\n\"Wait, hold on-!\" he yelped, but before he could finish, she bent down, wrapped an arm around his waist, and hoisted him clean off the ground.\r\n\r\n\"Pyrrha!\" Jaune shouted, flailing uselessly as the cafe floor disappeared beneath him. In his panic, he completely forgot to pitch his voice or play dumb, \"What are you doing?! Put me down!\" Pyrrha didn't answer. With a strength that was both awe-inspiring and terrifying, she adjusted him over her shoulder like he was nothing more than a sack of potatoes. Her movements were quick, precise, and completely indifferent to his frantic squirming. She held him firmly in place as she pivoted on her heel and marched toward the door.\r\n\r\n\"Help!\" Jaune cried, his voice cracking as he waved toward his stunned coworkers, \"Someone stop her! This is kidnapping!\"\r\n\r\n\"Have a nice day!\" the manager called out cheerfully from behind the counter, completely unconcerned with the scene unfolding in her cafe.\r\n\r\n\"Wait, you're okay with this?!\" Jaune shouted, his head whipping around as he tried to twist free of Pyrrha's grip. He might as well have been struggling against an iron vice, \"Pyrrha, what the hell is going on?! Why are you- oh God, are you mad at me? Did I do something wrong? If I did, I'm sorry!\"\r\n\r\nPyrrha still didn't respond. If anything, she seemed even more determined, her strides long and purposeful as she pushed through the cafe door and stepped into the street. Jaune's flailing legs kicked uselessly in the air, and his hands beat against her back in a desperate attempt to free himself. It was useless. Pyrrha didn't have as much raw Aura as him, but what she did have was years of experience in the tournament circuit. His fists might as well have been spitballs.\r\n\r\n\"I- Pyrrha, come on! Talk to me! You're freaking me out!\" Jaune begged, craning his neck to look at her face. All he could see was the side of her head, her face still red as she kept her eyes fixed forward. Her lips were pressed together so tightly they'd turned pale, and her breaths came in short, sharp bursts. She raised him higher on her shoulder, \"Hey, stop! My skirt! It's riding up!\" he shrieked. His partner - the person he could trust with his life - completely ignored his frantic pleas and just kept walking.\r\n\r\nJaune cursed team RWBY in his head. When he got back to Beacon, he was gonna give them a piece of his mind!\r\n\r\n...\r\n\r\nBut first, he had to deal with whatever the heck was going with Pyrrha.\r\n\r\n[line break]\r\n\r\nPoor Jaune. Just wants some lien, ends up awakening something in team RWBY and Pyrrha. Apparently, Huntresses are into femboys. The sight of Jaune in that dress really does something to them, especially Weiss. She's having serious regrets rejecting Jaune now that she's seen him in that outfit.\r\n\r\nQuestion:\r\n\r\n1. I'm kinda torn on Pyrrha. The two are definitely fucking next chapter, but I have two options how.\r\n\r\n- Option one, she frames it as her wanting to train him and Jaune either being dumb or flustered enough not to question too much.\r\n\r\n- Option two, she just throws shame away completely, gets down on her hands and knees, and begs to fuck him in that dress.\r\n\r\n2. Who do you guys want after Pyrrha? The vote's tied between Weiss, Blake and Cinder right now."
    },
    {
      "title": "Chapter 2",
      "text": "Next chapter of Maid Jaune. The smut ended up being different than I imagined, but oh well, it works out for now. And it contrasts the next chapter.\r\n\r\n[line break]\r\n\r\nJaune barely had time to process the fact that Pyrrha had carried him through the streets of Vale like a bridal sack of potatoes before she barged into a hotel lobby, ignored the startled clerk's sputtering greeting, and stomped straight to the elevator. His protests had long since devolved into incoherent sputters as he hung limply over her shoulder, his cheeks burning with humiliation. The swish of his skirt with every step only made it worse.\r\n\r\nWhen the elevator dinged and she marched into a room, Jaune expected her to finally explain herself - yell at him, lecture him, anything to justify the bizarre kidnapping. Instead, she set him down on the edge of the bed with surprising gentleness. He stared up at her, his frazzled mind scrambling for some explanation as to why his partner was acting like this.\r\n\r\n\"Okay,\" Jaune began cautiously, his hands clutching his skirt to stop them from shaking, \"Pyrrha, can you please tell me what's going on? Why did you - \"\r\n\r\nBefore he could finish, Pyrrha dropped to her knees. Not in the defeated, apologetic way he might have expected, but in a way that made his brain short-circuit completely. She clasped her hands together, her emerald eyes wide and almost shimmering as she leaned forward.\r\n\r\n\"Jaune, please, please, please, let me-\" She hesitated, her face somehow going redder as her voice dropped into a pleading whine, \"Let me sleep with you while you're wearing that outfit!\"\r\n\r\nJaune froze, every thought screeching to a halt, \"I...what?!\"\r\n\r\n\"You don't understand!\" Pyrrha shouted, her voice rising with desperation as she threw any sense of shame to the wind, \"When I heard about you in the maid outfit, it...it awakened something in me! I haven't been able to think about anything else!\" She clutched at her chest as if the sheer force of her feelings might burst out of her, \"You look so pretty, Jaune! And-\" Her gaze darted to his thigh-high socks, and she bit her lip, \"It's driving me insane!\"\r\n\r\nJaune stared at her, utterly speechless, as his brain tried and failed to reconcile the image of the composed, graceful Pyrrha Nikos with the red-faced, desperate woman currently begging at his feet, \"I-I don't- what are you talking about?!\"\r\n\r\n\"Please!\" Pyrrha pressed on, ignoring his protests entirely. She shuffled closer, her knees brushing against his shoes, \"I'll do anything! I'll pay for whatever you want! Dinner, new weapons, extra training sessions- anything! Just let me-\" Her voice cracked slightly, and she covered her face with her hands, peeking through her fingers like she couldn't bear to look directly at him, \"-let me have you in the outfit!\"\r\n\r\nJaune's mouth opened and closed like a fish, but no words came out. His hands gripped the hem of his skirt tighter as he stared down at her, completely overwhelmed, \"Pyrrha, you're...you're not making any sense!\" he finally managed, his voice cracking with equal parts panic and disbelief. He didn't know what to expect when Pyrrha just hauled him off like a potato sack, but it definitely wasn't her begging to sleep with him while he was dressed up as a maid!\r\n\r\n\"I know it sounds crazy!\" Pyrrha cried, looking up at him with an expression of raw, unfiltered need, \"But you have no idea how much this is killing me, Jaune! Every time I close my eyes, I see you in that dress, holding a tray, looking so...so...\" She trailed off, her voice trembling as she took a deep breath, \"I need this, Jaune. I'm begging you. Please. Just this once. For me! Just the tip! I promise, it'll be just the tip!\" Wasn't that what the guy said?!\r\n\r\nJaune could only gape at her, his face burning so hot he swore he could hear his brain sizzling. His mouth moved soundlessly, his mind spinning like a broken record. This had to be some kind of fever dream. There was no way Pyrrha, his partner, the Invincible Girl, was on her knees, begging him to-\r\n\r\n\"I'll even wear something if you want!\" Pyrrha cut in desperately, clearly oblivious to the internal meltdown unfolding in front of her, \"A maid outfit, a battle dress, whatever makes it fair! You name it! I'll do it!\" She clasped her hands together again, leaning forward until her forehead almost rested on his lap, \"Jaune,\" she whispered, her voice soft and trembling, \"Please say yes.\"\r\n\r\nJaune stared down at Pyrrha, who was still on her knees in front of him, her face redder than he'd ever seen it, her hands clutching his knees like a lifeline. She looked like she was about to combust on the spot, her breathing erratic, her wide green eyes darting everywhere except his face. He frowned, utterly baffled. What was going on? Why was she acting so weird? And why, for the love of all things holy, had she dragged him out of work like some kind of maniac for this?\r\n\r\nThen it hit him.\r\n\r\n\"Oh,\" he said, nodding as realization dawned on him, \"Ohhhh, now I get it.\"\r\n\r\nPyrrha's head snapped up, her eyes wide as saucers, \"Y-You do?\" she croaked, her voice high-pitched and shaky. She sounded almost relieved. Well, as relieved as someone could sound while still looking like they were about to pass out.\r\n\r\nJaune nodded again, his confusion vanishing as everything fell neatly into place in his mind, \"Yeah. It makes total sense now.\" Pyrrha let out a strange noise, halfway between a gasp and a hiccup, and she gripped his knees even tighter. Jaune, seeing her shaking hands and strained expression, smiled warmly. It was so obvious, he thought. She should've just asked him instead of being a weirdo and kidnapping him like some crazy stalker.\r\n\r\nOh well, they were here now.\r\n\r\n\"You're just sexually frustrated, right?\"\r\n\r\nPyrrha froze, her whole body going rigid. Jaune, however, was on a roll now, his mind whirring as he pieced together the obvious solution, \"You've been under so much stress lately,\" he said, the very picture of calm understanding \"You've got Beacon training, tournaments, homework, and everything else. It's no wonder you're at your wit's end. And, you know, it's perfectly normal to feel this way. It's not like you're in love with me or anything crazy like that.\" He laughed and rubbed the back of his head, \"You're just, uh, looking for a way to blow off some steam. And since we're partners, it's natural you'd think to ask me for help!\"\r\n\r\nPyrrha let out a strange choking noise, her mouth opening and closing like she was trying to speak but couldn't quite form the words. Jaune frowned slightly, tilting his head.\r\n\r\n\"Wow, you're really flustered about this, huh?\" he said, giving her a reassuring smile, \"It's okay, Pyrrha. I totally get it. You don't need to be embarrassed.\" He patted her shoulder lightly.\r\n\r\nPyrrha's hands twitched against his knees, her face somehow managing to grow even redder. Her lips moved soundlessly for a moment before she managed to stammer out, \"R-right. That's...That's it.\"\r\n\r\nJaune's smile brightened, his confidence surging. He knew he was right! \"See? That's all it is. No big deal! You just needed someone to talk to. Or, uh, I guess, more than talk to.\" He laughed nervously, scratching the back of his neck, \"I mean, it's not like this is some kind of romantic thing or anything. This is just a...partner thing.\" Pyrrha made another strangled noise, and Jaune noticed her hands trembling. He frowned again, concern flickering across his face, \"Are you okay? You look like you're about to pass out.\"\r\n\r\n\"I'm fine!\" Pyrrha squeaked, her voice cracking. She quickly cleared her throat, her eyes darting anywhere but at him, \"I-I mean, yes, I'm fine. Just...you're right. It's a partner thing. Partners do this all the time. That's why it's not weird for you to say yes!\"\r\n\r\n\"Exactly!\" Jaune said, nodding firmly, \"That's what partners are for: helping each other out in times of need.\"\r\n\r\nPyrrha's breathing hitched again, and Jaune took it as a sign that she was finally calming down, \"Well, I'm glad I could help, even if it's just understanding where you're coming from,\" he said with a smile, \"Do you feel better now?\"\r\n\r\nPyrrha made a muffled noise, her face buried in her hands as her whole body trembled. Jaune figured she was probably just overwhelmed by relief. That made sense. It must've been hard for her to bring this up in the first place. He patted her shoulder again, feeling oddly proud of himself for being such an understanding partner.\r\n\r\n\"Good!\" he said cheerfully, \"Glad we got that cleared up. See? Communication is key.\"\r\n\r\nPyrrha peeked up at him from behind her hands, her expression a confusing mix of emotions that Jaune chalked up to residual embarrassment. He gave her another encouraging smile, completely oblivious to the way her hands dug into his knees like she was hanging on for dear life.\r\n\r\n\"All right, partner,\" he said, crossing his arms and nodding decisively, \"What do you want to do next? You're the one who needs some, uh, relief,\" Pyrrha let out another choking noise, and Jaune blinked at her in confusion, \"Uh...are you sure you're okay?\" he asked.\r\n\r\nShe nodded weakly, her voice barely a whisper, \"Y-Yeah. I'm fine.\"\r\n\r\nJaune shrugged, satisfied with her response. 'Man', he thought, 'Being a good partner is exhausting. But hey, at least I handled this pretty well.'\r\n\r\nHis chest puffed out with a newfound sense of duty as he looked down at Pyrrha. If she needed him, he wasn't going to shy away, no matter how awkward or weird this was. Being a good partner means going above and beyond, he thought with determination. Pyrrha was clearly at her limit, and it was up to him to help her out of this bind. That was what partners were for, right?\r\n\r\n\"So,\" Jaune said, clasping his hands together and smiling brightly, \"What do you want me to do to help you, Pyrrha? Just say the word!\"\r\n\r\nPyrrha froze, her wide green eyes staring up at him like a deer caught in the headlights. Her face, already impossibly red, somehow managed to darken even further till he worried she would faint from heatstroke,. She gulped audibly, her gaze darting between his face and his maid outfit as she fidgeted nervously, \"I, uh...\" Pyrrha's voice was barely above a whisper, her fingers twisting together in her lap. She shifted slightly, her eyes flicking to the bed before she hesitantly scooted back and sat down, her legs crossed primly. Her entire posture screamed tension as she clasped her hands in front of her, her thumbs nervously rubbing against each other.\r\n\r\nJaune tilted his head, his expression encouraging, \"It's okay, Pyrrha. You can ask me anything. I'm here to help.\"\r\n\r\nPyrrha swallowed again, her throat bobbing visibly. Her lips parted, and for a moment, it looked like she was going to back out entirely. But then her eyes darted to his thigh-highs again, and a fresh wave of determination washed over her face. She took a deep breath, her voice trembling as she finally spoke, \"C-Call me...Mistress,\" she stammered, her voice cracking slightly. She quickly cleared her throat and added, \"With a high-pitched voice. L-Like you did earlier.\"\r\n\r\nJaune blinked, \"Call you Mistress?\" he repeated, his tone curious but not judgmental. Whatever helped her deal with her problems.\r\n\r\n\"Yes!\" Pyrrha blurted, sitting up straighter as her hands gripped her skirt tightly, \"I mean, yes, please. If you don't mind. It's...part of the relief. For me.\"\r\n\r\nJaune nodded slowly, his expression thoughtful, \"Huh. I guess that makes sense. It's not too different from the role-playing stuff I do at work.\" He stood a little straighter, adjusting his skirt as he prepared himself, \"All right. You got it, Pyr!\" He clasped his hands in front of him, tilted his head slightly, and smiled brightly, \"What can I do for you today, Mistress~?\" he chirped, his voice rising into the same high-pitched tone he'd practiced so much at the cafe. It actually felt a lot less awkward now that he was doing it to help his partner instead of random strangers.\r\n\r\nPyrrha visibly shuddered, her shoulders trembling as she covered her mouth with one hand. Her green eyes widened as she stared at him, her pupils dilating slightly. Her breath hitched, and a soft, almost inaudible whimper escaped her lips. Jaune took the reaction as a good sign, \"Hey, I think I'm doing it right!\" he said, his pitched voice full of pride. He stood a little taller, still keeping his hands clasped and his head tilted in what he thought was an elegant pose, \"Does that help, Mistress?\"\r\n\r\nPyrrha's hand dropped to her lap, and she nodded stiffly, her face an unreadable mix of emotions that Jaune interpreted as relief, \"Y-yes,\" she croaked, her voice shaky, \"That...That's very good.\"\r\n\r\nJaune beamed, pleased with his performance, \"Great! Let me know if there's anything else you want me to do! I'm all in!\" Pyrrha let out another soft whimper, her hands trembling as they gripped her skirt tightly. She looked like she was about to say something, but the words didn't seem to come. Jaune tilted his head again, his bright smile unwavering, \"Anything at all, Mistress!\" he added cheerfully, \"I'm here to make sure you feel better!\"\r\n\r\nHe tilted his head as he watched Pyrrha nervously fidget on the bed. Her face was impossibly red, and she looked like she was barely holding herself together. He didn't quite get it. What had her so flustered? He was just helping her out as a good partner should. She didn't need to make it such a big deal. Heck, she was the one who kidnapped him and begged for it! It was pretty weird that she was being so shy about it now.\r\n\r\nPyrrha gulped audibly, her trembling hands clutching the hem of her skirt as her emerald eyes darted up to meet his. She shuddered, her breath coming in shallow gasps, before finally speaking, \"I...I want you to...\" Her voice trailed off, and she visibly steeled herself before forcing the words out, \"D-dominate me. Gently. A-As foreplay.\"\r\n\r\nJaune blinked, \"Dominate you?\" he repeated, his tone curious rather than judgmental, \"Like, uh, in those romance movies?\"\r\n\r\nPyrrha nodded, her face practically glowing red, \"Y-yes,\" she stammered, her voice barely above a whisper, \"I mean, i-if you don't mind. I know it's a lot to ask...\"\r\n\r\nJaune scratched the back of his head, his expression thoughtful, \"Well, I've never done anything like this before,\" he admitted, \"I'm, uh...I'm a virgin, actually.\"\r\n\r\nPyrrha gasped sharply, her eyes widening in surprise as she clapped a hand over her mouth. Her reaction made Jaune tilt his head in confusion, \"What?\" he asked, genuinely baffled, \"Is that surprising or something?\"\r\n\r\n\"N-no!\" Pyrrha squeaked, shaking her head rapidly, \"I just...I didn't expect...I mean, you don't seem like...\" She trailed off, her voice breaking into an incoherent mumble as she looked away, her face burning.\r\n\r\nJaune shrugged, brushing off her strange reaction, \"Anyway, I'll give it a shot,\" he said with a confident nod, \"I mean, I've seen plenty of cheesy romance movies thanks to my sisters. I think I can figure it out.\"\r\n\r\nPyrrha gulped again, her breathing growing heavier as she watched him step forward. Her entire body tensed as Jaune reached out and placed his hands firmly on her shoulders, \"Okay, so I think it goes like this,\" he said, his voice calm and collected as if he were explaining battle tactics.\r\n\r\nHe gave her a gentle push, guiding her down onto the bed. Pyrrha let out a soft gasp, her wide eyes locked on his as he carefully straddled her, his weight pressing lightly on her thighs. She froze beneath him, her breath hitching as his hands remained on her shoulders.\r\n\r\nJaune leaned over her slightly, his blue eyes filled with determination, \"Is this right?\" he asked, tilting his head, \"It's kind of like what they do in those movies. You know, the ones where the guy sweeps the girl off her feet and stuff. My sisters always made me watch those.\"\r\n\r\nPyrrha's lips parted, but no sound came out. Her emerald eyes were glassy, her entire body trembling beneath him. She managed a shaky nod, her voice a hoarse whisper, \"Y-yes,\" she croaked, her face burning, \"This is...very right.\"\r\n\r\n\"Great!\" Jaune said, smiling brightly. He adjusted his hands slightly, gripping her shoulders just enough to keep her steady, \"Okay, so what happens next? Do I, uh, say something? Like a line from one of those movies?\"\r\n\r\nPyrrha's breath hitched again, her voice trembling as she replied, \"A-anything you want...\"\r\n\r\nJaune nodded firmly, leaning in closer as he tried to recall some of the more dramatic lines his sisters used to swoon over, \"All right,\" he said, his voice low and serious, \"Then, uh...'You're mine tonight.'\" He winced slightly at how cheesy it sounded coming out of his mouth, but he figured it was worth a try.\r\n\r\nPyrrha let out a sound that was somewhere between a squeak and a moan, her hands twitching at her sides. Jaune noticed her reaction and gave her a concerned look, \"Was that okay? Or should I try something else?\"\r\n\r\n\"No! I mean, yes! It's fine!\" Pyrrha stammered, her voice cracking as she clutched at the sheets beneath her, \"I-it's perfect. You're perfect. Just...keep going...\"\r\n\r\nJaune nodded again, his confidence growing, \"Okay, got it. I think I'm getting the hang of this.\" He shifted slightly, his hands trailing down her arms as he tried to think of what else those romance movies always emphasized. He figured as long as he followed the script, he couldn't go too far wrong. After all, Pyrrha trusted him, and he was determined to do his best. What could possibly go wrong?\r\n\r\nHis mind raced as he tried to recall more of those cheesy romance movie moments. If his sisters' reactions were anything to go by, there was always a dramatic kiss - or a trail of kisses, to be exact. He hesitated for only a moment before leaning in closer, his breath brushing against Pyrrha's jaw, 'This is fine. Totally fine', he thought, his determination overriding his awkwardness, 'She needs this. I'm just helping her out. It's not like this is weird or anything.' He was just a guy helping his partner out. Like Ren and Nora. They said they weren't 'together-together' all the time even though they shared a bed and did other stuff most not-couples didn't do.\r\n\r\nHis lips pressed softly against her jawline, a feather-light touch that made her whole body shudder beneath him. He moved slowly, cautiously, planting a series of kisses down the line of her jaw, his hands steadying her as she trembled. Her skin was warm, almost unnaturally so, and the faintest taste of salt lingered where his lips brushed her.\r\n\r\nPyrrha let out a shaky gasp, her chest heaving as she struggled to catch her breath. Her head tilted instinctively, giving him better access as incoherent noises spilled from her lips. Words, or fragments of them, tumbled out between the gasps - pleas, praises, and something else he couldn't quite decipher.\r\n\r\nJaune, seeing her reactions as a sign he was doing things right, continued with renewed confidence. He trailed lower, his lips brushing against the curve of her neck. The faint, sweet scent of her shampoo and soap mingled with the warmth of her skin and the slight tang of sweat from her earlier run. For a brief moment, Jaune found himself oddly mesmerized by the contrast, 'Focus, Jaune,' he told himself firmly. 'This isn't about you. This is about helping your partner. Just keep going.'\r\n\r\nHe pressed another kiss to her neck, slightly firmer this time. Pyrrha's hands shot up to clutch at his arms, her fingers digging into his sleeves as a choked whimper escaped her. He stilled for a moment, glancing up to make sure she was okay, only to see her eyes squeezed shut, her lips parted as she struggled to form words, \"J-Jaune,\" she gasped, her voice cracking as her hands tightened around his arms. Her body arched slightly beneath him, her breathing erratic as incoherent babbling spilled from her lips. Whatever she was trying to say was lost as her words turned to incoherent slurring.\r\n\r\nJaune took it as another good sign and leaned in closer, his lips finding a particularly sensitive spot near her collarbone. He kissed it lightly before experimentally grazing his teeth against the skin, a gentle bite that made Pyrrha let out a broken cry. Her nails dug into his arms, and her legs shifted restlessly beneath him, her whole body trembling as she tried to form a coherent response.\r\n\r\n'Wow, this is working way better than I expected, Jaune thought, his mind racing. I guess those movies weren't exaggerating after all.' He bit down lightly again, earning another strangled noise from Pyrrha as her head tilted further back, exposing more of her neck. Her babbling became more frantic, her words blending together into a stream of desperate, breathless sounds that made absolutely no sense to Jaune but seemed important nonetheless.\r\n\r\nHer reactions, as overwhelming as they were, filled Jaune with a strange mix of pride and nervousness, 'Okay, just stay calm. You've got this,' he told himself, 'She's depending on you.' He trailed his lips lower, pressing kisses along the line of her collarbone as her breathing hitched and her hands clutched at him like a lifeline. Pyrrha's gasps grew more ragged, her body trembling beneath him as she babbled incoherently, her voice a mess of pleas and praise.\r\n\r\nJaune did his best to ignore her incoherent moaning and focused solely on the task at hand. His mind was a whirl of determination, awkward confidence, and a growing sense of responsibility. Whatever Pyrrha needed, he would do his best to provide. Because that was what good partners did.\r\n\r\nPyrrha's hands finally released their grip on Jaune's arms as she sank back onto the bed, her breathing shallow and uneven. She lay there, her chest rising and falling with each ragged gasp, her face flushed a deep crimson that crept down her neck. Her wide green eyes, clouded and unfocused, flicked up to meet his, half-lidded and filled with a raw intensity that made his stomach flip. He'd never seen her look like that before. Confident? Always. Awkward? Sometimes. This? Never.\r\n\r\nJaune hovered over her, unsure of what to do next. He wasn't exactly experienced in...this, but her reaction so far seemed like a good sign, right? She hadn't told him to stop, and he figured he must've been doing something right if she was looking at him like that. He was about to ask her what she wanted him to do next when her eyes flickered downward.\r\n\r\nPyrrha's gaze trailed over him slowly, almost lazily, as if savoring every detail. The dark fabric of his maid outfit, stretched tight over his torso from his movements. The crisp white apron tied neatly at his waist. Her eyes dropped lower, lingering on the short skirt that barely concealed his upper thighs, where the edge of his dark thigh-high socks clung to his skin.\r\n\r\nAnd then her gaze stopped. Jaune froze, his cheeks burning as he realized what she was staring at. He didn't have to look down to know what had caught her attention: the unbearable tightness from his erection, straining against the fabric of his underwear, completely visible beneath the frilly hem of his skirt. He wasn't wearing panties (not that the manager hadn't insisted...), but he had to wear briefs instead of boxers. Briefs that did nothing to hide how hard he was.\r\n\r\nPyrrha's breath hitched audibly, her green eyes darkening as her pupils dilated further. Her gaze lingered, unblinking, as her lips parted slightly. A fresh wave of crimson spread across her cheeks, but she didn't look away. If anything, she seemed to sink deeper into the bed, her fingers curling around the sheets as she stared.\r\n\r\nJaune let out a strangled noise, his brain scrambling to process the situation. 'Oh...this is happening.' He clenched his hands into fists, willing himself to keep his cool, but it was a losing battle. Pyrrha's gaze, intense and unwavering, made his body react in ways he couldn't control, and the realization only made him flush harder, \"Uh...P-Pyrrha,\" Jaune stammered, his voice cracking as he tried to form a coherent sentence, \"I, uh, I didn't mean for you to...I mean, this isn't...I wasn't trying to...\"\r\n\r\nPyrrha didn't respond. Her eyes finally flicked back up to his, meeting his gaze with a mix of vulnerability and unspoken longing that made his knees wobble. She shifted slightly, her legs brushing against his as she arched her back just enough to press herself more into the bed. The movement made her skirt ride up ever so slightly, exposing more of her toned thighs, and Jaune felt his brain short-circuit completely.\r\n\r\nHe opened his mouth to say something, anything, but the words died in his throat as she lifted a trembling hand to brush against his apron. The gesture was small, hesitant, but the way her fingers curled into the fabric sent an electric jolt through him. Her fingers trailed down lower till they rubbed up against the surface of the dark underwear, fondling his cock gently.\r\n\r\nPyrrha's lips moved, but her voice was barely a whisper, her words lost in the frantic thrum of Jaune's heartbeat. Her flushed face, her trembling hands, the way her body seemed to mold into the bed. It all felt like too much. What the hell am I doing? he thought, his mind spiraling as he struggled to keep himself steady. Still, he couldn't bring himself to move away. Pyrrha was looking at him like he was the only thing in the world that mattered, and the sheer intensity of her gaze made it impossible to think clearly.\r\n\r\nJaune's hands trembled as Pyrrha reached up and tugged at the waistband of his briefs. The sheer boldness of her action left him momentarily frozen, his mind struggling to catch up as the fabric slid down his thighs, freeing his aching length. Nine inches of hard hard cock twitched in the open air, and suddenly, all thoughts of how terrible the day was earlier were gone.\r\n\r\nHe hesitated for only a moment before, following her lead, his fingers found the waistband of her panties and eased them down her legs. His movements were cautious, almost reverent, as if he were handling something impossibly delicate. Pyrrha pressed her thighs together to make it easier, and he gulped when the crimson fabric was down to her knees. Peeking through the dark miniskirt, her already-wet quim seemed to greet him.\r\n\r\nThe air between them grew thick, heavy with tension and anticipation as their bare bodies pressed closer. Pyrrha's legs parted slightly, her flushed cheeks and half-lidded eyes inviting him without a word. Jaune swallowed hard, his heart hammering against his ribcage as he lined himself up against her entrance. The heat radiating from her made his breath hitch, and for a brief moment, he hesitated.\r\n\r\n\"Are you okay?\" he asked softly, his blue eyes searching hers for any sign of doubt. Pyrrha didn't speak, her lips trembling as she gave him a small, shaky nod. Her hands gripped his shoulders, pulling him closer as her emerald eyes locked onto his.\r\n\r\nTaking a steadying breath, Jaune pushed forward, his tip pressing against her slick folds before slowly easing inside. The sensation was overwhelming - warm, tight, and almost impossibly soft. Pyrrha gasped sharply, her entire body tensing beneath him as her back arched off the bed. Her arms shot up, wrapping around his neck in a vice grip as if she were holding on for dear life.\r\n\r\nThe sound she made was unlike anything he'd ever heard. Half gasp, half moan, filled with raw, unfiltered emotion. Jaune froze instinctively, afraid he'd hurt her, but the way she clung to him told a different story. Her fingers dug into his back, her nails leaving faint crescents on his skin as she tilted her head back, her lips parted in a silent cry.\r\n\r\n\"Pyrrha,\" he murmured, his voice soft. He leaned forward, his forehead resting against hers as he resumed his slow, careful movements. He eased in deeper, inch by inch, her walls squeezing around him in a way that made his entire body shudder. Her breathing grew more erratic, punctuated by soft whimpers and gasps that sent a rush of heat through him.\r\n\r\nWhen he finally buried himself to the hilt, they both stilled, their bodies pressed flush against each other. Jaune felt like he was on fire, every nerve ending in his body alive with sensation as he looked down at her. Pyrrha's face was a mess of emotions. Pleasure, relief, and something else he couldn't quite place. Her emerald eyes met his, shimmering with unshed tears, and he found himself mesmerized by the desperate intensity of her gaze.\r\n\r\nThey stayed like that for a moment, their breaths mingling as they tried to steady themselves. Jaune's hands cupped her face gently, his thumbs brushing away the faint sheen of sweat on her flushed cheeks. Pyrrha's arms tightened around his neck, pulling him closer until their noses almost touched.\r\n\r\n\"Are you okay?\" he asked again, his voice barely above a whisper. This time, Pyrrha nodded more firmly, her lips curling into a faint, shaky smile.\r\n\r\n\"I'm perfect,\" she murmured, her voice trembling with raw emotion. Her eyes bore into his, filled with a kind of unspoken trust that made his chest ache. Jaune smiled back at her, his nerves easing as he realized how much this moment meant to her.\r\n\r\nJaune moved cautiously at first, his hips rocking gently as he adjusted to the overwhelming sensations coursing through him. Pyrrha's gasps and soft cries spurred him on, her trembling body pressing against his with each careful thrust. He kept his gaze fixed on hers, his blue eyes locked onto her emerald ones as if they were the only two people in the world. The way she looked at him - half-lidded, vulnerable, and utterly trusting - made his chest tighten in ways he didn't quite understand.\r\n\r\nAs the seconds stretched into minutes, his movements grew bolder, the rhythm of his hips picking up speed. Pyrrha's grip on his shoulders tightened, her nails raking lightly across his skin as her gasps turned into sharp, breathless cries. Her legs wrapped around his waist instinctively, her body arching to meet his movements as they lost themselves in the building intensity.\r\n\r\nJaune could feel the tension mounting, a fire building low in his stomach that he'd never experienced before. Not like this, at least. This was different from all the times he took care of himself with a croll on one hand and his dick in the other. It wasn't just the physical sensation - it was everything. The heat of her body, the way her soft, breathless cries filled the room, the way she clung to him like he was her lifeline. It was overwhelming in the best possible way, and he couldn't tear his eyes away from hers.\r\n\r\n\"Jaune...\" she murmured, her voice barely audible over the sound of their bodies moving together. His name fell from her lips like a prayer, raw and unfiltered. The cries trailed off into a soft whimper, her head tilting back as her emerald eyes glazed over, lost in the moment.\r\n\r\nThe tension between them coiled tighter with each thrust, their breaths growing ragged as the fire inside them threatened to consume them both. Jaune's pace quickened, his hips moving with a desperation he couldn't control. Pyrrha cried out, her back arching sharply as her legs squeezed around him, her hands pulling him closer.\r\n\r\nJaune felt the peak approaching fast, his body trembling as the fire in his stomach burned hotter and hotter. He could see it in her too - the way her breath hitched, the way her eyes fluttered shut for just a moment before snapping back to his, the way her entire body tensed beneath him. He wanted to make it perfect for her, to make sure she felt as amazing as she looked in this moment.\r\n\r\n\"Pyrrha,\" he murmured again, his voice shaky. His hands cupped her face as he buried himself as deeply as he dared, his eyes never leaving hers. He couldn't look away.\r\n\r\nWhen the peak hit her, Pyrrha gasped sharply, her head snapping back as her body arched off the bed, her cry echoing in the room. Jaune followed close behind, the fire inside him igniting into an uncontrollable inferno. He barely managed to pull out at the last second, his body trembling as he spilled himself onto the sheets just above her thigh. It wasn't neat. The next shot hit her right thigh and stomach, coating the lightly tanned skin white.\r\n\r\nHe stayed like that for a moment, hovering over her, his chest heaving as he tried to catch his breath. His face burned with embarrassment as he realized what he'd just done - how fast it had all happened, how he'd barely managed to hold back in time. His gaze finally dropped, breaking the unspoken connection between them as he looked anywhere but her, \"Sorry,\" he mumbled, his voice shaky as he tried to steady himself, \"I didn't...I mean, I didn't want to risk anything. I just...\"\r\n\r\nPyrrha didn't respond immediately, her chest rising and falling as she lay beneath him, her face still flushed and her hair splayed out like a fiery halo. When she finally spoke, her voice was soft and filled with a quiet, trembling joy.\r\n\r\n\"It's okay,\" she whispered, her arms reaching up to pull him close, \"You were...perfect.\"\r\n\r\nJaune blinked, his blush deepening as he hesitantly met her gaze again. The way she looked at him - soft, glowing, and utterly at peace - left him speechless. He didn't understand how she could say that, not after how awkward and unprepared he'd been, but the warmth in her expression told him she meant every word.\r\n\r\nFor the first time, Jaune allowed himself to relax, a small, relieved smile tugging at his lips.\r\n\r\nJaune stayed hovering over her for a moment, still catching his breath, his face burning from the exertion, and, okay, maybe a little from the embarrassment. He looked down at Pyrrha, who was sprawled out beneath him, her fiery hair a mess on the pillow and her chest rising and falling with each shaky breath. She looked...well, she looked a little strange, honestly. Her expression was tight, like she was trying to hold something back, and her mouth opened and closed like she wanted to say something but couldn't quite get the words out.\r\n\r\nJaune frowned, tilting his head, \"Uh, Pyrrha?\" he asked, his voice hesitant, \"Did that help? You know, with your, uh, sexual frustration?\"\r\n\r\nPyrrha's eyes snapped open, the haze of pleasure in them vanishing as her face twisted into something unreadable, \"Y-yes,\" she said, her voice tight, almost strangled. Her lips quivered, and she looked like she was waging some kind of internal war, \"It...definitely helped.\"\r\n\r\nJaune smiled brightly, completely oblivious to the strain in her tone, \"Awesome!\" he said, beaming with pride. He pushed himself up a bit, brushing his hair back and looking far more confident than he felt all day, \"I'm really glad I could help you out. I mean, that's what good partners are for, right?\"\r\n\r\nPyrrha let out a soft, strangled noise, her hands twitching against the sheets as her face twisted further, \"R-right,\" she muttered, her tone clipped, \"Good...partners.\"\r\n\r\nJaune nodded firmly, feeling a rush of satisfaction. Pyrrha was always helping him out. It was good for him to finally return the favor, \"Yeah! And, hey, I wasn't sure I'd be any good at this, you know? Since, well...\" He rubbed the back of his neck sheepishly, \"You know, first time and all that. But I guess I did okay if it helped you out!\" He smiled at her again, his blue eyes bright and filled with sincerity, \"You're one of my best friends, Pyrrha, so I'm just happy I could do this for you.\"\r\n\r\nPyrrha's eye twitched, and her lips pressed into a thin line as her hands clenched into fists. She turned her head slightly, her voice barely audible as she muttered something under her breath that Jaune couldn't quite catch.\r\n\r\n\"Huh?\" he asked, leaning closer, \"What was that?\"\r\n\r\n\"Nothing!\" Pyrrha said quickly, her voice suddenly high-pitched and forced. She plastered on a shaky smile, \"I...I'm glad too, Jaune. You're...such a good partner.\"\r\n\r\n\"Thanks!\" Jaune said, his grin widening. Her right eye twitched again for some reason, \"Man, I feel so much better about all this now. I mean, it was a little awkward at first, but knowing I helped you out makes it totally worth it!\"\r\n\r\nPyrrha let out a noise that sounded suspiciously like a growl, but Jaune, ever the optimist, took it as a sign of relief. He patted her on the shoulder with a satisfied nod, \"Anyway, we should probably clean up before the hotel staff starts wondering what's going on in here, huh?\" She didn't respond. She just lay there, staring at the ceiling with a blank expression, her hands still clutching the sheets as if they were the only thing keeping her grounded. Jaune hopped off the bed, humming softly to himself. Today ended on a pretty good note, he thought.\r\n\r\n[line break]\r\n\r\nWeiss was not flustered. Not even a little. She was certainly not pacing back and forth in the privacy of her dorm room, her cheeks uncharacteristically pink, muttering under her breath as the memory of that ludicrous cafe incident replayed in her mind for the umpteenth time. No, Weiss Schnee, heiress to the illustrious Schnee Dust Company, did not allow herself to be rattled by such things. She was the very picture of stoic confidence.\r\n\r\nAnd yet, there she was, walking in increasingly agitated circles, trying to make sense of the sheer absurdity of it all.\r\n\r\n\"Of all the idiotic, reckless, downright infuriating stunts to pull,\" she muttered, her heels clicking against the pristine floor with each sharp turn. Her arms were crossed tightly over her chest, as though she were trying to physically hold in her frustration, \"Jaune Arc. In a maid outfit. What could he have possibly been thinking?!\" No one answered her, of course. She was alone. Ruby had gone off to tinker with Crescent Rose, Yang was still down in Vale wasting her time with trivialities, and Blake was reading smut at some dark corner of the library.\r\n\r\nThe image replayed itself in her mind unbidden - him, standing there, dressed like a fool but somehow pulling it off far better than he had any right to. His tall, lean frame filled out the dark fabric and crisp white apron with an irritatingly competent elegance. His hair, styled in that unnatural yet oddly fitting way, framed his face just so, while the flawless makeup emphasized features that had no business being so symmetrical.\r\n\r\nAnd those thigh-highs!\r\n\r\nWeiss stopped mid-step, her cheeks flaring with heat as her thoughts derailed completely. No. She refused to let her mind wander further. It was not worth dwelling on how those thigh-highs clung to his legs or how-\r\n\r\n\"No! Absolutely not!\" she hissed aloud, shaking her head violently to banish the thought. Her pacing resumed, this time faster, more frantic, \"It's ridiculous! That's all. Ridiculous. Foolish. Stupid!\"\r\n\r\nYes, it was his stupidity that frustrated her. That had to be it. How could someone as hopelessly clumsy and socially inept as Jaune Arc possibly pull off something like that? And why - why - was it burned into her memory with such infuriating clarity? It was an affront. To dignity, to propriety, and to everything Beacon stood for.\r\n\r\nHer pacing grew even more erratic as she muttered to herself, \"Someone needs to teach him a lesson. Yes. A lesson. He can't just go around doing things like this. It's unbecoming. Embarrassing. Humiliating!\" Her fists clenched at her sides, \"He must be made to understand there are consequences for his actions.\" What actions were those? Why, making a mockery of not just himself but all who knew him! What would people think if they found out they were acquainted with someone who so easily tossed his dignity away for the sake of lien?\r\n\r\nConsequences. Yes. That was the key. She wasn't dwelling on this for any other reason. It wasn't because of the way his nervous smile had looked so...so genuine, or the way his earnestness had made the absurd outfit almost work. No, this was about teaching him responsibility.\r\n\r\nShe stopped pacing and stared out the window, her gaze unfocused as her thoughts spiraled further. Someone like Jaune Arc needed guidance, discipline, and a firm reminder that actions had consequences. And who better to provide that than her? Weiss was nothing if not capable of setting fools straight; just ask Ruby. It was her duty as an upstanding citizen of Atlas to show him the error of his ways.\r\n\r\nHer hand moved instinctively to her hip, brushing against the small pouch where her Schnee brand credit card was safely tucked away. The idea struck her like lightning; a simple, brilliant solution. If he was working at that cafe, then he was undoubtedly underpaid. She could easily buy his time from his manager. With a simple swipe of her card, he would have no right to complain. He would be hers for the remainder of the evening.\r\n\r\nAnd she could do whatever she wanted to him...\r\n\r\n\"Yes,\" Weiss murmured, her tone firm and decisive, though her cheeks flushed even brighter, \"That way, I can ensure he learns his lesson properly. No interruptions. No excuses.\" Her fingers tightened around the card, her nails digging into its surface as she tried to ignore the way her heart pounded.\r\n\r\nShe needed to teach him. To show him that reckless behavior had consequences. To put him in his place for embarrassing himself, and, by extension, anyone associated with him. And if he cried, well...that would just mean he had learned his lesson thoroughly. And if he begged and called her mistress while promising to be a good boy for her? Well, that just meant she was doing a good job imparting the lessons he so clearly needed.\r\n\r\nHer eyes narrowed, her grip on the card unyielding as she muttered, \"This isn't about anything else. It's not about...about that outfit. Or those...\" Her voice faltered as the image crept back into her mind, unbidden. Those thin legs, those glossy lips, the skirt that hid his above-average (or so he claimed) penis, \"No. It's a lesson. That's all. A necessary, important lesson.\"\r\n\r\nWeiss squared her shoulders and turned toward the door, her expression resolute. With her family's resources, this would be easy. She'd buy his time, bring him here, and make sure he understood the full weight of his foolishness. That was all this was. Nothing more.\r\n\r\n\"Jaune Arc,\" she muttered under her breath, her voice low and dangerous, \"You have no idea what you've gotten yourself into.\"\r\n\r\n[line break]\r\n\r\nYeah...Weiss is projecting just a bit. Anyway, something for the next chapter.\r\n\r\nQuestion:\r\n\r\n1. Do you guys want insertion from Weiss to Jaune next chapter? Either a strap-on or she summons a dick with her Semblance. Might fit the femdom and Jaune in a maid outfit theme, but a lot of people seem to get testy when it comes to guys taking it up the bum.\r\n\r\nIf not, I guess we could just go for general femdom i.e whips, insults, and lots of demands from Weiss."
    },
    {
      "title": "Chapter 3",
      "text": "Chapter 3 of Maid Jaune. Weiss' turn now. Per the vote, there will be no butt stuff.\r\n\r\n[line break]\r\n\r\nJaune trudged through the hallways of Beacon, still reeling from everything that had just happened. He'd slept with Pyrrha. That was a fact. A very real, inescapable fact. His first time, his partner, the whole thing. Holy crap. He shook his head violently, as if the sheer force of his denial could wipe the memory from existence. No, no, no. It wasn't like that. He hadn't just...slept with Pyrrha. That would be weird. No, this had been about helping her out. He just did what any good partner would do when their friend was in need. He was supporting her, providing relief in a time of...of crisis!\r\n\r\nYeah. That was it. Nothing more, nothing less.\r\n\r\nJaune exhaled, rolling his shoulders as he tried to shake off the strange mix of emotions swirling in his gut. He was back in his normal clothes, his maid outfit folded neatly in his bag, and now all he wanted was to get to his room, collapse onto his bed, and not think about anything for a while. Maybe ever. Still, his boss deposited his first paycheck and...wow, yeah, that little maid cafe was making a killing. Almost made him think he was in the wrong profession.\r\n\r\nHe was halfway to his room when he turned a corner and nearly ran smack into Weiss. Jaune stopped, blinking as he looked down at her. Weiss, for her part, had also come to a sudden halt in front of him, standing stiffly with her arms crossed. Normally when they crossed paths, she'd offer some sarcastic quip, roll her eyes, or huff about something he'd done wrong. At the very least, she'd shoot him a vaguely condescending look before moving on with her day.\r\n\r\nBut she didn't. Instead, she just...stared at him.\r\n\r\nJaune felt his stomach drop slightly. Not because she was scowling at him, or glaring, or sneering, but because she was just standing there, lips pursed, eyes locked onto his with an unreadable expression. It was weird. Really weird, \"Uh...\" Jaune forced a smile, rubbing the back of his neck, \"Hey, Weiss.\"\r\n\r\nNothing. Not a word. Her icy blue eyes flickered ever so slightly, trailing over him in a way he couldn't quite place. Jaune shifted uncomfortably under her gaze, feeling inexplicably exposed. She was looking at everything but his face, and her lips pursed like she found something she disapproved of.\r\n\r\n\"Sooo...what's up?\" he tried again, his smile faltering slightly. He half-expected her to scoff, tell him he looked exhausted or that he was in the way. But instead, she just kept staring. A chill ran down his spine. He had no idea what was happening, but he knew one thing for certain: he needed to get out of here, \"Well, anyway, I should, uh, probably get going. Long day, you know how it is.\" He chuckled awkwardly and stepped to the side, making his way past her. Weiss didn't move, didn't say a single word. But he could feel her eyes on him, tracking his every step.\r\n\r\nJaune resisted the urge to look back as he continued down the hall, his pace just a little quicker than before. That was strange, he thought, his brow furrowing. He shook his head. She was probably still annoyed about the maid thing, but it wasn't any of her business. Crush or not, she didn't get to judge him on how he made lien when she had a (generous) allowance every month. Not everyone could have SDC money, Snow Angel.\r\n\r\nHe had no idea how much he was gonna eat his words soon.\r\n\r\n[line break]\r\n\r\nThe next day, Weiss sat primly in the back room of the quaint little maid cafe, her posture perfect, her expression cool, and her fingers lightly intertwined over the table before her. The dimly lit break room smelled faintly of coffee, cleaning supplies, and sugar, a stark contrast to the crisp professionalism Weiss exuded. It was an utterly mundane setting, unbefitting of a Schnee, but Weiss carried herself as if she were presiding over a high-stakes business negotiation.\r\n\r\nWhich, in her mind, she was.\r\n\r\nAcross from her sat the cafe's manager, a woman who looked to be in her early thirties, her uniform slightly more elaborate than the standard maid attire, marking her authority. She was a shrewd-looking woman, eyes sharp and calculating, the kind of person who had long since learned to read people like open books. And right now, she was reading Weiss like a bestselling novel. Weiss wasn't foolish enough to underestimate her despite her looks.\r\n\r\n\"So,\" the manager hummed, leaning back in her chair, one eyebrow arching in amusement. She swirled the cup of tea in front of her lazily, though Weiss suspected the casual demeanor was entirely an act. This woman had smelled blood in the water the moment Weiss had walked in and asked to \"discuss the employment status of one of your staff.\"\r\n\r\n\"You're interested in Juliette's time, is that right?\" the manager continued, her voice dripping with faux innocence.\r\n\r\nWeiss pursed her lips, \"Yes,\" she said simply, her tone professional. She would not be rattled.\r\n\r\nThe older woman's lips curled into an amused smirk, \"Ah,\" she purred, tilting her head, \"So you've taken a liking to our precious Juliette, have you?\"\r\n\r\nWeiss stiffened, her spine ramrod straight, \"It is not a matter of liking,\" she corrected, voice clipped, \"I simply believe there are certain...disciplinary measures that must be taken.\" Jaune needed to understand that actions had consequences. The rational part of her mind told her that he wasn't doing anything wrong, but she stamped it out. He'd...He'd offended her by acting like such a fool. She couldn't rest until she paid him back for that.\r\n\r\nThe manager took a sip of her tea, her smirk deepening, \"Disciplinary measures, is it?\" she said, her tone light and teasing, \"My, my. I didn't realize our dear Juliette had been so naughty.\"\r\n\r\nWeiss's eye twitched, \"That is not- \" She exhaled sharply, reigning in her irritation, \"Nevermind. The point is, I require their time this evening, and I am willing to pay for it.\" She wouldn't let herself be rattled. This was a transaction, nothing more.\"\r\n\r\nThe manager hummed, tapping a manicured nail against her teacup, \"That's quite the request. Juliette is one of our most...popular maids. I can't say I'm eager to part with her services so easily.\"\r\n\r\nWeiss barely kept her expression from twitching. Popular? She highly doubted that. Jaune had only been here for a day or two. This woman was playing up his value. It was a classic business move: inflate the worth of the asset before discussing cost. Tch. Amateurish.\r\n\r\nStill, Weiss wasn't about to back down. She had come prepared, \"I am, of course, willing to compensate you for your trouble,\" Weiss said smoothly, reaching into her coat and pulling out her wallet. From within, she withdrew her sleek platinum SDC-branded credit card and set it delicately on the table between them.\r\n\r\nThe manager's gaze flickered down to it for only a second, but Weiss caught the subtle shift in her demeanor. Hook set, and she was biting, \"Hm,\" the woman mused, sipping her tea, \"You're very serious about this.\"\r\n\r\n\"I would not be here if I weren't,\" Weiss said plainly, tilting her chin up ever so slightly, \"I require Juliette's services for the evening. I imagine it should be a simple transaction.\"\r\n\r\nThe manager smiled, the kind of smile that belonged to a seasoned predator, \"Oh, dear,\" she said, voice laced with exaggerated sympathy, \"If only it were that simple. You see, Juliette is special. I can't just let her go for cheap.\"\r\n\r\nWeiss fought back the urge to scoff. This woman wasactually trying to haggle with her. It was almost insulting. But, she wouldn't let herself be drawn into a petty dispute over price. If there was one thing Weiss understood better than most, it was negotiations. Her Father may have been a bastard of a human being, but he'd taught her things that proved useful in life. Negotiations were just one of those things.\r\n\r\nShe folded her hands neatly atop the table, \"Then let's talk numbers.\"\r\n\r\nThe manager's grin widened ever so slightly, \"Oh, I like you,\" she said, setting her cup down with a small clink. Weiss barely resisted the urge to roll her eyes. Of course she did. She saw her was as a lien card with legs. The manager leaned forward, resting her chin on one hand, \"Now, you must understand...Juliette is something of a rarity. Her charm, her grace, her ability to captivate customers - it's not easy to find someone like her.\"\r\n\r\nWeiss took a slow, measured breath through her nose. She is talking about Jaune Arc. Jaune. Arc. Jaune, who tripped over his own feet on a near-daily basis. Jaune, who was so painfully dense he had no idea Weiss had spent the better part of an entire evening thinking about him. Jaune, who somehow managed to look good in a maid outfit, and whose voice, when pitched high enough, was annoyingly convincing.\r\n\r\nJaune, who she wanted to use said voce to cry and call her Mistress.\r\n\r\nWeiss pushed those thoughts aside. That was irrelevant to the matter at hand. She forced a neutral expression, \"I highly doubt Juliette's presence is so critical to your operations that you cannot spare her for one evening. Name your price.\"\r\n\r\nThe manager hummed, eyes twinkling with mischief, \"Well...considering Juliette's...skills, I'd say-\"\r\n\r\nWeiss tapped her credit card against the table lightly, \"I don't have time for games. If you're going to name an outrageous price just to test my patience, don't.\" Her smile was cold, \"We're both professionals here, so I say again: name your price.\"\r\n\r\nThe manager chuckled, but Weiss saw her shoulders relax slightly, as if finally realizing she wasn't just dealing with a spoiled little rich girl who had more money than sense,. She tapped her nails against the table, thinking, \"Fine, then,\" the manager said at last, a smirk tugging at her lips, \"For an entire evening? Well...\" She rattled off a figure with a number of zeroes that would've made most people walk away immediately without even trying to haggle.\r\n\r\nWeiss didn't even blink, \"Done.\"\r\n\r\nThe manager let out a small laugh, clearly having expected more pushback, \"You really are serious,\" she mused, \"All right, Miss Schnee. You've got yourself a deal.\"\r\n\r\nWeiss slid the card across the table, \"Charge it.\" The manager took the card with a pleased smile and stood, already heading to process the payment. Weiss sat back in her chair, exhaling quietly as she straightened her gloves. There, all taken care of. Jaune had absolutely no right to complain now. He was, for all intents and purposes, hers for the evening. Her maid, to be precise. And she would make sure he understood exactly why his foolishness had consequences.\r\n\r\nNot because she wanted him in that maid outfit again. Certainly not because she'd spent an inordinate amount of time thinking about how he looked in it. This was simply about teaching him a lesson. Yes. That was all this was for. A lesson.\r\n\r\nWeiss never did anything without a clear purpose. And that purpose had absolutely nothing to do with how flustered she felt just thinking about what was to come.\r\n\r\n[line break]\r\n\r\nJaune arrived at the cafe the next afternoon, still feeling the residual awkwardness from everything that had happened with Pyrrha. He wasn't thinking about it. He wasn't. It was just a partner thing. Just something good friends did for each other. He helped her out, she got what she needed, and now life could continue like normal.\r\n\r\n...Right?\r\n\r\nHe shook off the lingering weirdness and stepped inside, offering a sheepish wave to the other maids on shift before heading to the back to get changed. He wasn't exactly excited to be back at work, but after the absolute madness of yesterday, he figured a simple shift as Juliette would be downright relaxing by comparison. Just some tea, some fake smiles, maybe a few ketchup hearts. Nothing too stressful. Especially if his friends made sure to stay away.\r\n\r\nHe was halfway through tying his apron when the manager poked her head into the dressing room,\"Ah, Juliette! Perfect timing.\"\r\n\r\nJaune turned, eyebrows raising, \"Uh, yeah? Something up?\" He was still wary of the manager considering she just watched Pyrrha kidnap him like some kind of maniac. Sure, it was just a partner thing, but she didn't know.\r\n\r\nThe manager smiled a little too brightly and folded her hands in front of her, \"You've got a special assignment today.\"\r\n\r\nJaune blinked, \"A what?\"\r\n\r\nThe manager waved a hand dismissively, \"A personal client.\"\r\n\r\nJaune frowned, \"Personal client?\" That was new. Normally, he just worked the floor like everyone else, taking tables and performing whatever ridiculous services were requested. The closest he'd come to 'personal service' was when some lady had wanted him to feed her cake piece by piece, which had been horribly awkward, but still technically part of his job.\r\n\r\n\"Yup! A very special one,\" the manager said, her tone light and breezy in a way that immediately set Jaune on edge.\r\n\r\n\"...Okay,\" Jaune said slowly, \"Who is it?\"\r\n\r\nThe manager chuckled, waving a finger at him, \"Ah-ah, no spoilers, Juliette. You'll find out soon enough.\"\r\n\r\nJaune's frown deepened. Something about this didn't feel right, \"But-\"\r\n\r\n\"Now, now,\" the manager cut him off, stepping forward and adjusting the bow on his apron, \"Don't worry your pretty little head about it. Just put on that sweet smile of yours and do your best.\"\r\n\r\nJaune stiffened at the phrasing. That didn't sound good, \"Look,\" he sighed, pinching the bridge of his nose, \"Can I at least get some details? Like, where am I going? What am I doing? Is this just a normal thing or...?\"\r\n\r\n\"Oh, it's very normal,\" the manager assured him with an innocent smile that was definitely not innocent, \"Just think of it as a private session. A client was very interested in having our Juliette all to themselves for the evening, and they paid quite handsomely for the privilege.\" Themselves? He didn't like how she kept even the client's gender secret. Most people who went to places like this were guys, but there was a growing female customer base in recent years.\r\n\r\nJaune shifted from one foot to another, \"Wait. Someone paid for this?\"\r\n\r\nThe manager beamed, \"Oh, absolutely. And let me tell you, they spared no expense.\"\r\n\r\nJaune paled. That didn't sound promising. That didn't sound promising at all, \"I, uh, don't know how I feel about this,\" he admitted, rubbing the back of his head.\r\n\r\nThe manager gave him a playful nudge, \"Oh, relax, Juliette. You're going to be fine. It's just one evening. Just put on your best maid persona, bat those lashes, and go with the flow. You're going to make us both a lot of money!\" Jaune groaned, dragging a hand down his face. Why did it feel like he was walking into a trap? \"Oh, and one more thing!\" the manager added, just as Jaune was about to protest again, \"Don't forget the outfit! It's crucial.\"\r\n\r\nJaune flinched, \"I already figured, but should I even ask why?\"\r\n\r\nThe manager gave him an amused look, as if he were being particularly slow, \"Because it's what the client wants.\"\r\n\r\nHe opened his mouth to argue, but the manager was already turning on her heel and waving him off, \"Hurry up and get ready! You wouldn't want to disappoint them, would you?\" And then she walked off before Jaune could get another word in. The blonde's shoulders sagged. Maybe he should've gotten another job...\r\n\r\nHours later, Jaune walked through the streets of Vale, his hands clutching the hem of his maid skirt as he tried to keep his head down and move quickly. The less attention he drew to himself, the better. Unfortunately, that plan was failing miserably.\r\n\r\nIt wasn't like he wasn't used to being stared at while wearing the outfit - he worked at a maid cafe, after all. Still, there was a huge difference between getting ogled in a controlled environment where he could awkwardly laugh it off and getting catcalled in the middle of the street by complete strangers. There was a reason he changed in and out of his uniform in the cafe itself rather than going down from Beacon like that.\r\n\r\nAnd the weird part? It wasn't just guys.\r\n\r\nA group of women passed him not ten minutes ago, giggling behind their hands before one of them had audibly whispered, \"Damn, those legs...\" while another whistled. He hadn't even known what to do in that situation. What was the proper etiquette for being checked out by women while crossdressing? Why didn't he have this much luck when he was out in his regular outfit? Wasn't armor sexy? And he had a cool hoodie too! Come on!\r\n\r\nHe shuddered, hurrying his pace. Focus, Jaune. Just get to the hotel. Do the job. Get out.\r\n\r\nThe manager hadn't given him any details about his client, but from the sheer fanciness of the place, they had to be loaded. The hotel in question was one of Vale's premier luxury establishments, the kind of place reserved for high society types and people with more Lien than they knew what to do with. The lobby alone looked like it belonged in a palace. Gleaming floors, chandeliers, and a live pianist(!) playing soft music near the grand staircase. Like, not even at a restaurant, but at the freaking lobby. This place screamed 'money to burn'.\r\n\r\nJaune tried not to feel incredibly out of place as he walked up to the front desk. The receptionist, a middle-aged woman with sharp eyes, looked him up and down the moment he approached. Her expression was flat, suspicious, \"Can I...help you?\" she asked slowly, her tone suggesting she didn't think he belonged there.\r\n\r\nJaune cleared his throat, standing up straighter and doing his best to sound professional while still masking his voice, \"Uh, yeah. I'm here to see someone in room...1308?\"\r\n\r\nThe woman's expression barely changed, but he saw the moment it clicked. Her eyes flickered with understanding, and her mouth curled into the faintest smirk, \"Ah,\" she said simply, before reaching under the desk and pulling out a keycard.\r\n\r\nJaune frowned, \"That's it? You don't need to ask who I am or-\"\r\n\r\n\"Nope,\" she said, sliding the card across the counter, \"Enjoy your night, Miss Juliette.\" Jaune hesitated. Something about her tone made him uncomfortable. She was definitely assuming something about this situation that he really didn't want to dig into.\r\n\r\nSwallowing his unease, he grabbed the card and quickly made his way to the elevators.\r\n\r\nHe spent the ride up trying to steel himself. Whoever this is, just smile and go along with it. It's just one evening. He adjusted the frills on his apron, exhaling slowly. Besides, they paid good money for this. How bad could it be? He arrived at the thirteenth floor, stepping into the long, carpeted hallway. The lights were dimmer up here, adding an odd sense of intimacy to the atmosphere. He counted the doors as he walked. 1304, 1306, 1308...\r\n\r\nJaune stopped in front of the door, staring at the number for a moment. His stomach twisted slightly.\r\n\r\nHe raised his hand, hesitating before knocking lightly. A moment passed.\r\n\r\n\"Come in,\" a voice called from inside. A very familiar voice.\r\n\r\nJaune froze. No way. Swallowing thickly, he pressed the keycard to the scanner, hearing the soft beep as the lock released. He slowly pushed the door open and stepped inside. The suite was absurdly luxurious, all plush furniture and ambient lighting, with a grand view of the city skyline stretching out beyond the floor-to-ceiling windows. But Jaune barely registered any of that.\r\n\r\nBecause sitting elegantly on the massive, velvety bed with her legs crossed was Weiss.\r\n\r\nJaune's heart stuttered. His breath caught in his throat as he stared at her, utterly dumbfounded. Weiss, for her part, simply met his gaze with an unreadable expression, her eyes cool and assessing. She looked completely composed, as if she were conducting a business meeting rather than waiting in a luxury hotel room for him, of all people.\r\n\r\nHis thoughts scrambled. His first instinct was to be confused - why was she here? Was she the client? But underneath that, buried beneath the shock, was something else.\r\n\r\nBecause, holy crap. Weiss was...beautiful. He already knew that, obviously, but seeing her like this, perched so effortlessly on that ridiculously expensive bed, bathed in the soft glow of the city lights. Jaune felt his stomach do a flip.\r\n\r\nShe'd even dressed differently from her usual prim and proper ensemble. Gone was the bolero and the stiffly formal dress she always wore. Instead, she was draped in a white silk dress that shimmered under the room's soft lighting, the delicate fabric clinging to her form in a way that felt almost deliberate. The straps of the dress crossed elegantly around the sides of her slender neck, drawing attention to the smooth, pale skin of her shoulders. It was sleeveless too, exposing the graceful lines of her arms. Toned, but not overly so. Weiss wasn't built like Pyrrha or Yang, but there was undeniable strength there, a lean definition that only enhanced her refined beauty. She'd worked for her figure. Every inch of her exuded discipline and grace.\r\n\r\nAnd her legs...\r\n\r\nJaune swallowed thickly, his eyes betraying him as they drifted lower. The slit of the dress rode high along her thigh, effortlessly showcasing the long, creamy expanse of her legs. Despite her short stature, Weiss was never lacking in that department. They were just as toned as the rest of her, shaped by relentless training but still soft enough to be undeniably feminine. They looked flawless, smooth, and so impossibly enticing that his brain nearly short-circuited on the spot.\r\n\r\nJaune's breath caught in his throat.\r\n\r\nShe looked...incredible.\r\n\r\nHis mouth went dry and his heart hammered in his chest. She was the last person he was expecting, \"...Weiss?\" he finally managed, his voice barely above a whisper.\r\n\r\nShe simply tilted her head slightly, lips curling into something between a smirk and a challenge. He barely noticed the slight, tasteful makeup she wore. He was too focused on everything else about her. She switched which leg was over the other - right to left - and said her next words in a slow whisper.\r\n\r\n\"Close the door, Juliette.\"\r\n\r\nJaune hesitated for a fraction of a second before stepping back and slowly, almost mechanically, pushing the door shut. The soft click of the lock echoed louder in his ears than it should have, sealing him inside the lavish suite with Weiss. He turned back toward her, heart hammering in his chest, \"S-so, um...\" he swallowed, his fingers tightening slightly around the frilly hem of his maid skirt, \"You're my...client?\"\r\n\r\nWeiss didn't move,d idn't shift, didn't fidget the way people normally did when caught in awkward situations. Instead, she remained him composed, watching him with the same level of scrutiny one might expect from a royal inspecting their newly acquired property, \"That's right,\" she said smoothly, the confirmation striking Jaune square in the gut.\r\n\r\nHis breath caught in his throat, his body tensing ever so slightly. Weiss had paid for him. Him. Jaune Arc, the guy who she didn't give the time of day to less than a week ago. The words hung heavy in the air between them, the weight of them pressing against his chest. This was real. This was happening. He'd been hired not by some eccentric rich lady looking for a servant for the evening, not by some stranger with money to burn, but by Weiss.\r\n\r\nThe girl he had a crush on. The girl he'd chased around Beacon's courtyard like an idiot on his first week. The girl who normally regarded him with thinly veiled exasperation or outright disdain. The last person he would have expected to pay any amount of Lien for his time. And yet, here she was. Sitting there, looking for all the world like a queen on her throne, dictating terms.\r\n\r\n\"U-uh,\" he stammered, forcing his thoughts into some semblance of coherence, \"Wait. Wait. H-hold on a second. You actually- I mean, you paid for me?\"\r\n\r\nWeiss' expression didn't change. She just tilted her head slightly, her cool blue eyes regarding him with something that sent a chill down his spine, \"That's correct.\"\r\n\r\nJaune swallowed again, his pulse thrumming in his ears, \"O-okay. And...why?\"\r\n\r\nWeiss exhaled lightly, a sigh that was more irritation than exhaustion, \"Because I can.\" Her lips curved slightly, but there was no warmth in the smirk that followed, \"And because you need to learn that your actions have consequences.\"\r\n\r\nJaune blinked rapidly, his brain latching onto those last few words, \"C-Consequences?\"\r\n\r\nWeiss nodded, her posture still impossibly poised, \"Yes. You parading yourself around in that outfit. Making a spectacle of yourself. Drawing the wrong kind of attention.\" Her eyes flickered over him, a sharp, assessing glance that made him feel weirdly exposed, despite the fact that she wasn't saying anything particularly...suggestive. Her eyes trailed down his body and lingered at the small space between the edge of his sirt and thigh-high stockings.\r\n\r\nJaune's face burned, \"I wasn't parading mysel-\"\r\n\r\n\"Oh, weren't you?\" Weiss interrupted smoothly, her voice dropping just a fraction, \"I distinctly remember you wearing that ridiculous uniform with a bit too much confidence.\" She leaned forward, her eyes narrowed, \"Traipsing around like you owned the place, shamelessly bending over and calling people mistress with that high voice of yours...\r\n\r\nJaune flinched, \"It - it's part of the job! And I wasn't bending over!\"\r\n\r\nWeiss hummed, unconvinced, \"Regardless, I think it's time you learned a lesson. So, I bought you.\"\r\n\r\nJaune's stomach flipped, \"B-Bought me?\"\r\n\r\nHer smirk widened just slightly, \"For the next few hours, you belong to me.\"\r\n\r\nJaune forgot how to breathe. His heart practically leapt into his throat at the sheer bluntness of the statement. You belong to me. She said it like it was just a fact, like saying the sky was blue or that Nora could see beyond the borders to things man wasn't meant to know. His entire body locked up, every single part of him unsure of how to respond to that. The sheer boldness, the absolute certainty in her voice, made him feel lightheaded.\r\n\r\nJaune's brain tripped over itself trying to react, \"I- uh- wait, what?\"\r\n\r\nWeiss' expression remained infuriatingly composed, \"Is that a problem, Juliette?\"\r\n\r\nJaune stiffened, the name making him twitch. The way she said it was loading with meanining. He tried to speak, but at this point, he could barely form workds.\r\n\r\nWeiss sighed again, feigning boredom as she reached for a cup of tea sitting on the nightstand beside her, \"Honestly, Juliette, you act as though I've asked you to do something completely outrageous.\" She took a sip, her every movement controlled and deliberate.\r\n\r\nJaune stared at her like she'd just spoken in another language, \"Y-You literally bought me.\"\r\n\r\nWeiss placed the teacup down with a soft clink, her eyes narrowing slightly, \"And? Do you not work at a cafe where people pay for your service?\" Her tone was razor-sharp, cutting through his panic like a knife, \"This is hardly different. You sell your time and body to anyone who pays. In this situation, that means me.\"\r\n\r\nJaune looked away, \" It feels different...\"\r\n\r\n\"Well,\" Weiss said, tilting her head slightly, \"Feelings are irrelevant.\" She leaned forward ever so slightly, just enough for the room's lighting to catch on the cool sheen of her gaze, \"The fact of the matter is, you accepted the job. You willingly agreed to be rented out for the evening.\" A pause. Then, with the slightest smirk: \"Are you going to back out now?\"\r\n\r\nJaune's throat bobbed, his entire body locking up as the weight of everything crashed down on him. Weiss had paid for him. Had specifically requested him. In any other situation, he would've been over the moon. Weeks he'd spent trying to ask her out. Movies, dinner, even just a walk in the park. And every single time, she said no. Now she'd hired him out to...what? This was a private room. Was she expecting him to serve her tea and massage her shoulders?\r\n\r\nThe crossdressing maid swallowed thickly, his body stiff as he stared at Weiss sitting there so effortlessly on the plush bed. The heiresses' expression was poised, her confidence completely unwavering as she looked him in the eyes. He still couldn't wrap his head around the situation. She paid for him and wanted to 'punish' him? And now she was staring at him like she'd already decided what was going to happen next.\r\n\r\nHis throat bobbed as he forced himself to find his voice, \"...What do you want with me?\" he asked carefully, half-afraid of the answer.\r\n\r\nWeiss smiled. A slow, sweet, utterly mischievous smile that sent a strange chill down his spine. It wasn't her usual condescending smirk or her haughty, unimpressed expression. It was something softer, more deliberate, but infinitely more dangerous, \"I simply want to show you,\" she said, her voice laced with a sickly-sweet politeness, \"The consequences of your terrible behavior.\"\r\n\r\nJaune's brows furrowed in confusion, \"My...what?\" His hands instinctively fidgeted with the frills of his apron, \"What does that even-\"\r\n\r\n\"On your knees, Juliette,\" Weiss interrupted smoothly, her tone as light and natural as if she were instructing someone on the proper way to pour tea.\r\n\r\nJaune froze. His brain took a full second to register what she'd just said, \"...W-What?\"\r\n\r\nWeiss exhaled softly, like it took everything she had to not just force him down. She gestured downward with one delicate hand, \"I said, kneel.\"\r\n\r\nJaune's stomach twisted into knots, \"Wait, hold on, why-\"\r\n\r\nWeiss lifted a brow, \"Are you refusing a direct request from your client?\" Her tone was dangerous, a sharp edge cutting through the sweetness of her voice, \"Because I could easily ask for a refund.\"\r\n\r\nJaune's body reacted before his brain could catch up. He dropped to his knees, the thick carpet cushioning his descent, but the sheer weight of what he'd just done was enough to make his knees burn. He was kneeling in front of Weiss Schnee. Kneeling. Like a servant before a queen.\r\n\r\nWeiss hummed approvingly, shifting slightly where she sat, \"Much better.\" Jaune swallowed hard, his hands resting awkwardly on his thighs as he struggled to make sense of what was happening. His thoughts were still catching up to his actions when Weiss leisurely extended her left leg, her foot hovering just under his chin. The strappy high heel dangled from her foot, the smooth white leather winding around her ankle, accentuating the long, elegant shape of her leg. She waved it slightly under his chin, the motion almost teasing.\r\n\r\n\"Take it off,\" Weiss instructed, her voice light and expectant.\r\n\r\nJaune stared at the high heel, then at her, \"Excuse me?\"\r\n\r\nWeiss gave a soft, nearly condescending smile, as if she were pleased by how slow he was, \"Take off my shoe.\" Her tone left no room for argument, \"And then kiss my feet.\"\r\n\r\nJaune felt every nerve in his body lock up at once. He almost - almost - blurted something out. Something about how weird this was, about how not normal this was, about how she couldn't just expect him to do something like that without any explanation. But the moment his mouth opened, he caught the way Weiss was looking at him. Like she was expecting defiance. Like she wanted an excuse to make this harder for him.\r\n\r\nJaune's lips snapped shut.\r\n\r\nHis fingers trembled slightly as he reached out, carefully wrapping them around her ankle. Her skin was warm beneath his fingertips, soft and smooth, yet the weight of her gaze made the action feel infinitely more significant than it should have been. He hesitated for only a moment before sliding the high heel off, exposing her bare foot.\r\n\r\nWeiss flexed her toes slightly, as if testing the air, before arching a single delicate brow, \"Well?\" she asked .\r\n\r\nJaune's heart pounded against his ribs. He had no idea what he was doing, why he was doing this, or how he'd ended up in this situation. It was all supposed to be so simple. Yeah, he was crossdressing in a maid cafe, but that was only because he needed the money for some things. Now he was kneeling in front of his crush like some...servant.\r\n\r\nBut something about the way Weiss was watching him - calm, patient, expecting - made it impossible for him to do anything but obey. Slowly, hesitantly, he leaned forward, pressing his lips against the top of her foot.\r\n\r\nThe moment he did, he felt her shift slightly, her leg tensing just a fraction beneath his touch, \"Hm,\" Weiss mused, tilting her head, her smirk widening ever so slightly, \"Good girl.\" A shudder ran through him at the way she purred the words.\r\n\r\nHis lips pressed lightly against the top of Weiss' foot again, the warmth of her skin searing against his mouth. The moment lingered, thick with something he couldn't quite put into words. His hands trembled as they rested against her ankle, his breath shallow as he forced himself to process exactly what he was doing.\r\n\r\nWeiss, for her part, remained perfectly poised, as if this was the most natural thing in the world. She watched him, her expression unreadable save for the faintest, smuggest hint of satisfaction curling at the corner of her lips. Jaune swallowed hard and pressed another kiss just below her toes, his lips brushing over the delicate arch of her foot. He felt the smallest twitch beneath his touch, a subtle shift in her posture, but she said nothing.\r\n\r\nHis heart pounded against his ribs, 'Why am I doing this?' he asked himself, even as he trailed his mouth lower, moving past the top of her foot to the elegant curve of her ankle. His lips lingered there, pressing soft kisses against the sensitive skin, feeling the faintest thrum of her pulse beneath his mouth.\r\n\r\nThis wasn't normal. This wasn't a regular maid service or just another shift at the cafe. Jaune knew that. He knew how utterly bizarre this situation was. And yet, the worst part - the part he refused to fully acknowledge - was that under literally any other circumstances, he would have been more than happy to do this.\r\n\r\nBecause it was Weiss. Weiss, who he'd once chased after like a love-struck iodot. Weiss, who carried herself with such sharp, untouchable elegance that he never thought he'd get anywhere near this close to her, let alone be on his knees in front of her, trailing his lips along the curve of her leg. If she'd just asked - if she'd just wanted him in this way - he probably would have melted into a puddle at her feet on his own volition.\r\n\r\nBut no. She literally bought him, he thought with a flicker of indignation. She paid for him. Like some kind of -\r\n\r\nHe nearly twitched at the thought, but before he could fully spiral, Weiss shifted slightly, drawing his attention back to the very real fact that he was currently worshiping her legs. He exhaled shakily and kept moving, his lips trailing past the delicate line of her ankle, moving upwards along the smooth skin of her calf. She was warm, impossibly so, and every inch of her felt softer than he'd expected. He tried not to think about how smooth her skin was beneath his lips or about how she smelled faintly of vanilla and expensive perfume.\r\n\r\nWeiss hummed in approval, tilting her head ever so slightly as she watched him, utterly composed despite the tension in her body, \"You're learning quickly,\" she murmured, the words sending another rush of heat through him.\r\n\r\nJaune gritted his teeth slightly, trying to ignore the way his heart leapt at the praise, 'Get it together, Arc.' He kept moving, his kisses reaching the sensitive spot just above her knee. His hands, without thinking, slid gently along her thigh, steadying himself as he went higher. Weiss parted her legs slightly, just enough to give him permission to continue, and Jaune's stomach did a nervous flip.\r\n\r\nHis lips brushed against the inside of her thigh, the heat of her body growing more intense the closer he got. His breathing was shallow, his pulse racing, his mind spinning in all directions at once. He felt like he was being pulled into something - something completely out of his control, something he probably should have resisted, but couldn't.\r\n\r\nThe worst part? A part of him wanted to keep going. But no matter how much he wanted to, he couldn't forget the undeniable truth behind all of this. She paid for this, and no matter how much his body wanted to lose itself in the moment, the thought lingered in the back of his mind, gnawing at him.\r\n\r\nIf things had been different, if she'd just wanted him without making it a transaction, Jaune knew he wouldn't have hesitated. But this? This was something else entirely.\r\n\r\nJaune was lost in the moment, caught between the burning heat of Weiss' skin against his lips and the nagging voice in the back of his mind reminding him that this was not normal. That she'd paid for this. That he was being disciplined for - what, exactly? For working a job? For putting on a uniform and playing along with the ridiculous cafe's theme?\r\n\r\nHe didn't have time to figure it out before Weiss' voice, calm and collected as ever, cut through the haze.\r\n\r\n\"Stop.\"\r\n\r\nJaune froze instantly, his breath catching in his throat. He looked up in confusion, eyes flickering to her face for some kind of answer. Weiss hadn't moved much, still sitting regally on the plush hotel bed, her expression unreadable save for the slightest hint of...something. Her chest rose and fell with controlled breaths, her hands resting delicately in her lap, as if she were perfectly unaffected by everything that had just transpired.\r\n\r\nJaune was about to ask what was wrong when he suddenly felt her move.\r\n\r\nHis whole body jolted as Weiss smoothly lifted her left leg, pressing it firmly against his lap.\r\n\r\nJaune gasped.\r\n\r\nHer foot - bare, warm, and dangerously soft - pressed over his skirt, rubbing over the aching hardness that had been building there ever since she'd first commanded him to kneel. The touch, even through the layers of fabric, sent a sharp jolt of pleasure up his spine, making his breath hitch. He instinctively tensed, his hands clenching at his sides as a shudder wracked through him, \"W-Weiss - \"\r\n\r\nShe silenced him with a single look. He swallowed thickly, barely holding back the whimper caught in his throat as she continued her slow, calculated movement, rubbing the arch of her foot against him, applying just enough pressure to make his cock twitch beneath her touch. Then, in that same cool, composed tone, she gave her next command.\r\n\r\n\"Take it off. We need to continue your punishment.\"\r\n\r\nJaune's brain short-circuited. His face burned red-hot, his breath came in shallow gasps, and his entire body felt trapped beneath her gaze. He knew what she was asking. What she wanted. But even in the thick, suffocating air of the moment, he couldn't help but feel the strangest, most ridiculous urge to sigh.\r\n\r\nSeriously? Again with the punishment thing? Even with Weiss teasing him like this, with her foot pressing down against his most sensitive spot and making him tremble under her touch, he couldn't help but mentally complain. What was with her? Why was she so obsessed with 'disciplining' him? What lesson was she even trying to teach?\r\n\r\nHe was literally just doing his job! He hadn't committed some grand offense, hadn't gone out of his way to annoy her (this time), hadn't even talked to her before this whole insane series of events began! And yet, here he was, being punished for...for what? For existing? For wearing a maid dress? For looking good in it?\r\n\r\nHis mind screeched to a halt. Wait. Was that it? Was she just mad that he'd pulled it off? That he had somehow - against all odds - actually looked goodin something she probably thought should have been humiliating? That couldn't be it...right?\r\n\r\nHis thoughts were still stumbling over themselves when Weiss' foot pressed down just a little harder, dragging him back into reality with a sharp, shivering inhale. He looked up at her, his face utterly wrecked with confusion, embarrassment, and heat, only to see her staring back with the same unreadable expression, her smirk barely there but all too knowing, \"I told you to take it off, Jaune,\" she murmured, her voice velvety smooth, as if she hadn't just shattered his entire sense of reality, \"I still have to continue disciplining you, after all.\"\r\n\r\nJaune felt his sanity slipping. This wasn't normal...but at this point? He wasn't sure he even cared.\r\n\r\nHe inhaled shakily as he forced himself to move, his entire body tense as he pushed himself off his knees and stood before her. His fingers trembled slightly as they reached for the hem of his frilly skirt, hesitating for only a moment before tugging it down. The fabric slid past his hips, pooling at his feet in a heap of lace and frills, leaving him standing there in nothing but the maid uniform's stockings, garters, and his underwear.\r\n\r\nOr, well...what had been his underwear. Weiss had been very clear about what she wanted.\r\n\r\nJaune swallowed hard, his face burning as he hooked his thumbs into the waistband and pushed them down as well, fully exposing his hard cock. The cool hotel air sent a shiver through his body, his skin hypersensitive, his pulse hammering in his ears as he forced himself to look up at Weiss.\r\n\r\nAnd what he saw made his breath catch.\r\n\r\nWeiss was grinning. But not her usual smirk of superiority, not the prim and proper mask she wore at Beacon. No, this was something sharper, something downright predatory.\r\n\r\nShe didn't say anything at first. She just watched him. Her eyes raked over his exposed form, her pupils dilating just slightly as her lips curled with satisfaction. Then, with slow, deliberate movements, she leaned back onto the bed, shifting her weight onto her elbows as she arched her back ever so slightly. The soft lighting of the hotel suite caught against the pale skin of her thighs as she hiked up the hem of her dress, gathering the expensive fabric and pushing it up to her waist, revealing the lacy lingerie that barely covered her.\r\n\r\nJaune sucked in a sharp breath as he watched her lift her hips, her hands slipping under the waistband of her lingerie and slowly dragging it down, peeling the delicate material away and exposing herself to him entirely. Her cleanly shaved pussy seemed to taunt him, and he grit his teeth to stop the urge to get down on his knees again and lick between her legs. He'd done enough of that already, he told himself. And yet, he couldn't deny that the sight before him only made his cock harder.\r\n\r\nHis throat tightened. His mind blanked. She wanted him. This wasn't teasing anymore. This wasn't some game of power. This was real.\r\n\r\nAnd he knew exactly what she expected from him.\r\n\r\nJaune stepped forward, his body moving on instinct, his hands reaching out to steady himself as he lowered himself over her. His mouth was already parting, his breathing shallow as he-\r\n\r\n\"Good,\" Weiss purred, her voice sultry but undeniably smug, \"It seems you're finally learning your place.\" Jaune froze mid-motion, his entire body locking up as his brain screeched to a halt. Weiss hummed approvingly, clearly enjoying the sight of him hovering there, stunned into silence, \"It took some effort,\" she continued, her voice dripping with satisfaction, \"But at last, you're beginning to understand the importance of discipline.\"\r\n\r\nJaune's eye twitched.\r\n\r\nOh my god, she was ruining the moment. He'd just started getting into it, just processed what was happening - that Weiss Schnee wanted him and was openly showing it.\r\n\r\nAnd now she was talking about punishing him? Again?!\r\n\r\nWeiss, completely unaware - or worse, completely aware - of how utterly frustrating she was, exhaled softly and shifted beneath him, hooking one leg around his waist to pull him closer, \"Consider this your final lesson, Jaune,\" she murmured, her smirk positively wicked, \"A proper consequence for your horrid behavior.\"\r\n\r\nJaune clenched his jaw, his entire sense of attraction battling against the very real urge to roll his eyes into another dimension. Why the hell did he have a crush on her again...?\r\n\r\nThe (forced) sexy maid moved inside her, thrusting in and out with steady motions, his body responding instinctively to the overwhelming heat, the impossible tightness wrapped around his dick. It felt amazing - physically, at least. His breath hitched with each movement, pleasure building with every push and pull. It was just like how he imagined she'd be. The warmth of her quim, the smell of her perfume, her voice in his ear...\r\n\r\nBut Brothers, his heart really wasn't in it. At least when he did it with Pyrrha, it was for a reason. That had been about helping a friend in need, supporting his partner, providing her with relief, even if she'd been weirdly flustered about the whole thing.\r\n\r\nBut this? This was something else entirely. This was Weiss Schnee. This was 'punishment'. This was some bizarre, incomprehensible power trip that he definitely didn't understand, and at this point, wasn't even going to try to understand. He was literally fucking Weiss Schnee while wearing a maid dress. The sheer absurdity of the situation was making it impossible to focus.\r\n\r\nHis hands gripped her hips tightly as he moved, his breathing shallow, his skin slick with sweat. Weiss gasped beneath him, her nails dragging lightly over his back, her body arching slightly as she hummed in pleasure. Weiss was (probably) a virgin. Despite how domineering she acted before, he could tell that she wasn't nearly as used to it as she pretended she was. She squirmed with every move he made, and pulling his cock back was a struggle with how tightly her inner walls clung to him.\r\n\r\n\"Fuck, fuck, fuck...\" Weiss mumbled, all propietry forgotten. Her nails scratched along his back, her pussy lips trembling around his dick. She was smaller than Pyrrha, and without her heels, he practically towered over her. His girthy cock started to slip in and out with more ease now, his body moving on autopilot. Not that she was on her back with her legs spread, it honestly wasn't that different from the night he shared with Pyrrha.\r\n\r\n...At least, that was what he wanted to say.\r\n\r\nJaune's brain was detaching from reality. How had he ended up here? This felt like a fever dream. No. Worse. This felt like the kind of dream he'd jolt awake from in a cold sweat, only to sit up in bed, stare at the ceiling, and mutter, What the fuck was that?\r\n\r\nWeiss moaned softly, shifting beneath him, urging him to move faster. He obeyed on instinct, his body responding even as his soul was practically sitting on the sidelines, arms crossed, shaking its head in exhausted disbelief. This should have been everything past-him wanted. Weiss - his Snow Angel - squirming and and begging him to fuck her harder He should have been overjoyed. Instead, all he could think was how he really should have just stuck to his shift.\r\n\r\nHis hips began to thrust faster. Harder. Maybe if he kept her moaning she wouldn't demand he call her Mistress again, \"Yes, yes!\" Weiss cried, her legs wrapping around his waist, \"Face your- ngh! Face your discipline like a woman, Juliette!\" Gods damn it! Why couldn't she just keep her mouth shut?\r\n\r\nHe wasn't going to drag it out. After a few more thrusts, he slammed himself inside her up to the hilt, practically rattling Weiss. The heiress' eyes shot open and she came, staining the silk sheets and his cock in her fluids.\r\n\r\nJaune wasn't so far gone that he was going to do something stupid. Powering through the legs wrapped around his waist, Jaune pulled back and removed his cock from Weiss' cunt seconds before he came. His sement splattered against her stomach and thighs, almost blending into the alabaster skin. She almost looked disappointed that he didn't cum inside, but there was no chance of that. If he did, he'd have to take responsibility, and he did not want to tell any future kids that he met their mother because she bought him while he was crossdressing.\r\n\r\n\"..So, are we-\"\r\n\r\n\"I hope you don't think we're done.\" Weiss said. Her chest rose and fell rapidly with her pants and she looked up at him through her sweat-matted hair, \"I paid for multiple hours, Juliette, and I intend to get my money's worth.\"\r\n\r\n\"Can't you at least call me Jaune?\" He groaned.\r\n\r\n\"No. And don't forget, it's Mistress.\"\r\n\r\nJaune sighed and readied himself for round two.\r\n\r\n[line break]\r\n\r\nHours later, Jaune lay flat on his back, staring blankly up at the ceiling, his brain utterly fried. The expensive silk sheets of the hotel bed were soft beneath him, and Weiss' warmth was still pressed against his side, but mentally? He was nowhere near here. He was floating somewhere outside of his own body, watching his past self make a series of incredibly questionable life choices. Not just putting on that damn uniform for the sake of cold, hard Lien, but just having a crush on Weiss in the first place.\r\n\r\nThis entire night had been a mess. He'd gone from a normal, if slightly humiliating, cafe shift to being bought by Weiss Schnee, forced to grovel at her feet, subjected to some kind of deranged aristocratic discipline session, and then...well. This.\r\n\r\nHis scroll beeped. Jaune twitched slightly, blinking as he glanced toward the nightstand. The soft glow of his screen showed a simple notification: [Your session has ended. Thank you for your service!]\r\n\r\nOh, thank god. Jaune let out a slow breath, already moving to sit up. He needed to go. He needed to leave before Weiss came up with some new, even more convoluted punishment. He could get dressed, go back to Beacon, take a long shower, and then...never think about this again.\r\n\r\nBut just as he swung his legs over the edge of the bed, Weiss' voice, smooth and unwavering, cut through the air, \"I want to extend the session.\"\r\n\r\nJaune froze. Oh so slowly, he turned his head to look at her. Weiss was sitting up against the headboard, completely composed despite her thoroughly ruined appearance. Her hair was a mess, her face still flushed, her chest rising and falling with even breaths. But somehow, somehow, she still managed to look pristine. Jaune stared at her, \"Come again?\" he asked dumbly.\r\n\r\nWeiss met his gaze, eyes sharp, \"I'm extending our session.\"\r\n\r\nJaune felt something deep in his soul crack, \"Why?!\" he asked, voice edging toward exasperation, \"What else is there to do? You already punished me for...\" he waved a hand vaguely, \"...Whatever it is you think I did.\"\r\n\r\nWeiss, to his growing horror, smirked, \"Oh, Juliette,\" she said sweetly, tilting her head slightly, \"Discipline is a long process. You don't expect to be completely reformed after one night, do you?\" Jaune stared at her. A long, tired stare that conveyed the exact depths of his exhaustion. He was about to argue, about to stand up and walk out, when Weiss suddenly reached to the side of the bed, pulled out something from a bag on the floor, and tossed it onto his lap.\r\n\r\nJaune blinked, looking down. It took him a second to process what he was looking at. An Atlesian Specialist uniform. No, wait, a woman's Atlesian Specialist uniform. He squinted, \"Uh. Weiss?\" He lifted the outfit slightly, inspecting it, \"Why do you have this?\"\r\n\r\nWeiss sat back against the pillows, arms crossed, expression completely neutral, \"Because I want you to wear it.\"\r\n\r\nJaune raised a brow, still holding the uniform in his hands, \"...Why?\"\r\n\r\nWeiss' expression didn't change, \"Because.\"\r\n\r\nJaune gave her a slow, unimpressed look, \"Because what?\"\r\n\r\nWeiss exhaled sharply, looking vaguely irritated that she had to explain herself, \"Because I want to discipline you in a new setting.\"\r\n\r\nJaune's eye twitched, \"A new setting?\"\r\n\r\nWeiss nodded, \"Yes.\" Then, as if she were saying something completely normal, she continued, \"For the duration of this next session, I'll be calling you Winter. You'll still be calling me Mistress, of course, but it'll be more than that. I expect praise and lavish worship. You'll be complimenting on a multitude of things. My skills, my progress, and how much better I've gotten at summoning.\" He almost pointed out that she couldn't summon.\r\n\r\nJaune paused, \"Wait,\" he said slowly, \"Isn't Winter the name of your older sister?\" Weiss immediately stiffened, her expression frozen. Jaune blinked again, feeling a weird sense that he'd just stepped on something dangerous. His brain did a quick, very concerned calculation, \"Wait, isn't she an Atlesian Specialist too?\"\r\n\r\nWeiss' entire body locked up. Her cheeks, previously a faint pink from their earlier activities, darkened rapidly, \"It's just a coincidence,\" she snapped way too fast.\r\n\r\nJaune stared at her. Weiss stared back, clearly lying through her teeth. The room was silent. Jaune, with rising dread, raised the uniform again, inspecting it with a newfound sense of deep concern, \"Uh-huh.\" He turned the outfit over, \"And, uh, where exactly did you get this?\"\r\n\r\nWeiss sniffed, turning her nose up slightly, \"That's not important.\"\r\n\r\nJaune's eye twitched, \"It's kinda really important.\"\r\n\r\n\"It isn't.\" Weiss' voice was firm, as if she could force reality to bend to her will.\r\n\r\n\"You got this from her closet, didn't you?\" She didn't answer. Jaune ran a hand down his face, exhaling, \"Weiss.\"\r\n\r\n\"Juliette.\"\r\n\r\nHe dragged a hand through his hair, trying very hard to process this, \"Okay. Okay. So just to be clear, you want me to wear this. Right now. And for the next however many hours-\" he gestured vaguely, \"-you're going to be calling me your older sister's name.\"\r\n\r\nWeiss' face burned, but her pride refused to let her back down, \"Yes,\" she said simply.\r\n\r\nJaune visibly processed that. Then, in a flat, tired voice, he asked, \"Weiss. Do you have a sister complex?\" He knew about it, of course. Growing up with seven sisters led to a lot of teasing back home. And for the record, he didn't have one. Unlike weird Atlesians, Valeans had healthy relationships with their siblings. Just look at Ruby and Yang.\r\n\r\nWeiss immediately scowled, \"Absolutely not.\"\r\n\r\nJaune nodded slowly, not believing her in the slightest, \"Right. Uh-huh.\" He gestured to the uniform, \"This is normal, then.\"\r\n\r\nWeiss huffed, \"It is normal. Uniform sex is the most common kink in Atlas.\" He didn't doubt that, though he didn't believe for a second that it usually involved the uniforms and names of your sisters.\r\n\r\nJaune's lips pressed into a thin line, \"Weiss. You paid for me to call you Mistress. You made me thank you for punishing me. You literally bought my time. And now-\" he waved the uniform, \"-you're making me crossdress again and calling me by your older sister's name. Does nothing about this scream 'weird' to you?\" He looked her in the eyes, silently pleading - hoping - that she'd understand that this had gone above even buying one of her classmates and trying to punish them for doing nothing wrong.\r\n\r\nWeiss, despite being bright red, refused to falter, \"It's part of the discipline.\" Jaune didn't say a word. She lifted her chin, as if daring him to challenge her logic.\r\n\r\nJaune turned away from Weiss, mentally done with the entire situation. This was too much. Too weird. He'd officially reached his limit of absurdity for the night, and there was no way he was sticking around any longer to entertain whatever deep-seated sister issues Weiss was trying to work through, \"Nope,\" he muttered, shaking his head as he made for the door, \"I'm out. I knew I should've just stuck to my shift. Pyrrha was one thing, but this? This is-\"\r\n\r\nA scroll was suddenly shoved into his face. Jaune went cross-eyed as he stared at the glaringly bright screen way too close to his face.\r\n\r\nAnd then his brain shut down. Because that? That was a lot of zeroes. His eyes flicked down, his focus sharpening as he processed the number in front of him. The exact amount Weiss had typed out as an offer. No words, no hagglign, just a number.\r\n\r\nIt was...obscene. It was stupid. It was...\r\n\r\n...so much money.\r\n\r\nThis wasn't a normal amount to pay someone for anything. This was criminally excessive, the kind of number only people with 'fuck you' amounts of cash could afford to throw out. This was enough to buy the latest scroll model and still have Lien left over for months. This was practically a bribe from the heavens.\r\n\r\nJaune's mouth went dry. His legs felt weak and he almost collapsed at the list of things he could buy with that cash. He might've even been able to quit this horrible job as long as he was smart about it and made a few investments. He heard Vacuan cheese was doing really well.\r\n\r\nWeiss, still holding the scroll in front of his face, tilted her head smugly, \"So?\" she said smoothly, \"What will it be, Winter?\"\r\n\r\nHe almost snapped back at her for that, but the sheer weight of the offer staring him in the face was making it very hard to form words. He looked at the number, then at Weiss, then at the number again. Weiss smirked, her arms crossing over her chest as she leaned back against the pillows, infuriatingly sure that she'd already won.\r\n\r\nJaune sighed. He hated that she was right, \"...Fine,\" he muttered, rubbing his temples.\r\n\r\nWeiss perked up. She looked way too excited, \"I didn't hear you.\"\r\n\r\nJaune groaned, dragging a hand down his face, \"I said fine. I'll do it.\"\r\n\r\nWeiss' smirk turned into something far too self-satisfied, \"That's more like it.\"\r\n\r\nJaune exhaled, long and slow, trying to remind himself that this was worth it. That he was walking out of this with more money than he'd probably ever see in months working at the cafe. And hey, he was getting paid to fuck Weiss Schnee! That was a good thing, right?\r\n\r\n...\r\n\r\nOh, who was he kidding? Nothing about this was hot unless you were a degenerate like Blake. He sighed to himself as he put on the outfit, already creeped out at how it perfectly fit him. Did she have it adjusted? She only found out about his job yesterday! He sighed again and ignored her starry-eyed look. Just a few days ago, he would've given anything to have her look at him like that. Now? He couldn't care less. Whatever crush he'd had on Weiss? Dead. Buried. Never to see the light of day again.\r\n\r\nNow all he could think about was milking this for all it was worth. If we was gonna whore himself out, at least he'd get paid well for it.\r\n\r\n[line break]\r\n\r\nPoor Jaune. He feels so objectified. Oh well, at least he's getting paid well for it. And this chapter has him realize he has a product he can market, so future women will either need to pay up or get out cause he can get free sex with Pyrrha whenever she needs help.\r\n\r\nI'll put up a vote soon on the next RWBY girl. Till then, hope you guys enjoyed this one."
    },
    {
      "title": "Chapter 4",
      "text": "Sorry this took a while. My PC bricked and I had to write the latter half of the chapter on a shittier laptop. Anyways, hope you enjoy.\r\n\r\n[line break]\r\n\r\nJaune trudged through the front doors of the maid cafe, the familiar bell jingling overhead like some cruel, mocking reminder of the life choices that had led him to this exact moment. His shoulders were slumped with the weight of exhaustion, shame, and the ever-pressing burden of financial strategy. The Atlesian Specialist uniform clung to him uncomfortably, the tight, regulation-style cut not designed for someone who had just endured a multi-hour punishment session from a Schnee heiress with more money than sense and absolutely zero chill.\r\n\r\nHe didn't make eye contact with the other maids as he passed through the cafe's main floor, ignoring their startled stares, the double takes, the soft murmurs of \"Is that...Juliette?\" because yes, it was Juliette.\r\n\r\nBut Juliette had had enough.\r\n\r\nWithout breaking stride, Jaune beelined toward the manager's office, throwing open the door without so much as a knock. The startled woman behind the desk looked up, startled for only a moment before her face lit up with a smile so wide and saccharine it nearly made Jaune's skin crawl.\r\n\r\n\"Juliette!\" she chirped, clasping her hands together like they were old friends sharing brunch instead of, you know, one of them selling him to Weiss like a piece of meat, \"I'm so happy to see you! I hope your time with Ms. Schnee was enjoyable!\"\r\n\r\nJaune stared at her with the flat, dead-eyed expression of a man who'd seen too much. His hands hung limp at his sides, and his blonde bangs, still slightly damp from the shower he tried to take before Weiss dragged him back into her Winter fantasy, clung to his forehead in defeated little wisps. He looked like someone who'd been through war and lost.\r\n\r\n\"I quit,\" he said, tone as flat as his gaze.\r\n\r\nThe manager's smile faltered just a bit, her fingers twitching in the air, \"Now, now, let's not be hasty-\"\r\n\r\n\"I expect my final paycheck to be deposited into my account by today,\" Jaune continued, voice still low, even, and devoid of any inflection, \"I put in enough hours to qualify for overtime, too.\"\r\n\r\nThe manager blinked, \"Wait- Juliette, darling, let's talk about this.\" She stood up quickly, hands extended like she could physically pull him back into this madness with good vibes and high-pitched enthusiasm, \"There's no need to end things on such a sour note! You've made incredible connections! Ms. Schnee's just the beginning!\"\r\n\r\nJaune tilted his head slowly, like a man trying to process the sound of his own slow descent into a life of upscale gigolo work, \"Connections?\" he said, raising a single unimpressed brow.\r\n\r\n\"Yes!\" the manager nodded rapidly, sensing an opening, \"This is lucrative, Juliette! With your look and talent, you could pull in thousands! Tens of thousands! We split the profit, I handle the scheduling and vetting, and you get the premium clients. A fifty-fifty cut! Sixty-forty if you're picky!\" she said the last part like she was offering him a magnanimous deal.\r\n\r\nJaune blinked, then calmly reached into the inner pocket of the Specialist jacket, pulled out his scroll, and with the weary grace of a man who had planned his escape while being actively molested by the Schnee family, tapped the screen to open his new webpage.\r\n\r\nThe manager leaned in and gasped.\r\n\r\nIt was sleek. Professional. The kind of page you wouldn't expect from a tired Beacon student who'd been emotionally pulverized by two women in the same week. There was a high-quality photo of him in the maid outfit (taken without his knowledge, thanks Weiss), a polished bio that framed him as a \"unique, bespoke experience for refined clientele,\" and - this was the real kicker - an already growing list of client requests.\r\n\r\n\"I'm already getting bookings,\" Jaune said simply, scrolling past usernames like BigSisterS, SchneeKnight87, and the particularly concerning PyrrhaIsMyQueen, \"I don't need to split anything with a wannabe pimp.\"\r\n\r\nThe manager paled, \"N-Now hold on- Juliette, don't throw away everything we've built! We can grow this together! Think of the brand!\" Jaune was already walking away, \"Juliette!\" she called after him, desperation creeping into her voice, \"This doesn't have to be the end! We can expand! We can do special events! Couples sessions! Maid cafe deluxe!\"\r\n\r\nJaune didn't stop. Didn't slow down. Didn't even look back. He walked through the cafe one last time, head held high, the skirt of the Specialist jacket swaying behind him like a victory flag. The door jingled gently as it closed behind him, the final note on a chapter that - if he had any say - he would never speak of again. The manager's screams felt like a gentle lullaby.\r\n\r\n[line break]\r\n\r\nWeeks passed, and what had started as a humiliating blip in Jaune's dignity had somehow transformed into a full-blown business empire. Well, \"empire\" might've been a stretch, but considering he had a rotating schedule, personalized bookings, and was raking in more Lien than most students (or even some Huntsmen) could only dream of, he was definitely living in the upper tax bracket of crossdressing maid capitalism.\r\n\r\nThe website had exploded in popularity faster than he ever expected. Word of mouth, viral posts, and just the sheer novelty of his services had turned him from \"that awkward blonde guy from Beacon\" into \"Juliette, the most sought-after maid in Vale.\" And the kicker? He never once hid the fact that he was a guy. In fact, leaning into it - \"yeah, I'm a guy, so what? pay up\" - only made demand worse. Or better, depending on which side of his wallet he looked at.\r\n\r\nMale clients got the standard packages: cleaning, organization, basic service. Nothing shady. He was firm about that. Polished floors, tidied rooms, vacuumed carpets. A perfectly honest gig. But the female clients? Oh, well, let's just say their packages had a few more... \"premium options.\" Private sessions. Roleplay. Foot massages. Very personal tea ceremonies. And if anyone asked what \"disciplinary roleplay\" was, Jaune just said it was up to the client's imagination and winked.\r\n\r\nThe lien spoke for itself.\r\n\r\nSure, he wasn't proud to be, essentially, a part-time maid prostitute. He wasn't exactly rushing to tell his parents about his entrepreneurial pursuits. But every time he opened his bank account and saw another pile of zeroes, any shame he might've had got washed away in a tide of financial freedom. He wasn't just getting by, he was thriving. He had a savings account. A retirement plan. He even had a commission slot with Mistral's most exclusive blacksmith, who didn't even accept new clients. His new armor gleamed with rune-etched plating and lightweight alloy. It sang when it moved.\r\n\r\nAnd whenever Cardin or his merry band of meatheads tried to take shots at him for wearing skirts and \"servicing\" lonely housewives, Jaune just smirked and pulled out his brand-new scroll - the top model, with holo-display and thumbprint encryption - and said, \"That's cute. I got it custom engraved. Can you do that with your allowance?\" That shut them up quick.\r\n\r\nSometimes, he wore his new armor into the cafeteria just to watch them squirm. He was 87% sure Cardin was considering hiring him out of pure spite.\r\n\r\nHis friends weren't exactly helpful, either. The site had gotten too popular to hide, and it didn't take a genius to figure out who \"Juliette the Gentle Maid\" was once they saw the promo photos.\r\n\r\nRen, because he was Ren, had said absolutely nothing. Not a word. Just offered a calm nod when Jaune tried to bring it up awkwardly and never brought it up again. Bro behavior. Gold star. Nora had cackled for five straight minutes. Then she asked if she could design his next outfit. He said no. She asked again every other day.\r\n\r\nPyrrha gave him a weird smile. Not her usual gentle, supportive one, but the kind that lingered a bit too long. The kind that made him wonder if she was proud of him for being financially independent... or planning something. When he asked what she thought of the site, she just said, \"I'm happy you're growing as a person,\" and walked away.\r\n\r\nChilling.\r\n\r\nThen there was Team RWBY.\r\n\r\nRuby, bless her innocent heart, had stumbled on the site while searching for \"cute maid outfit references\" for a class skit. Her face had gone beet red. She cornered him the next day and asked way too many questions, \"Wait, so do you put just the outfits or the undies too? Do you get tips? Do you like it? Does anyone ever try to-\" He cut her off somewhere around question fifteen and redirected her to the \"FAQ\" page.\r\n\r\nBlake? Oh, Blake was the worst. She didn't even blink when she found out. Just raised an eyebrow, clicked around the site, and said in that calm, infuriating voice, \"Your rates are competitive, but you'd double your clients if you added optional roleplay tiers. Maybe a 'knight and princess' package. Or librarian. People like that.\" Then she walked off, flipping her book closed like she hadn't just casually discussed ways he could whore himself out more.\r\n\r\nYang tried to roast him for weeks. She tried everything: innuendos, jokes about frills, cracking wise about polishing more than just floors. But then Jaune, deadpan, looked her in the eye and said, \"I can buy Bumblebee with the leftovers from what I made last weekend.\" And just like that, the teasing stopped.\r\n\r\nAnd then... there was Weiss.\r\n\r\nWeiss Schnee. Beacon's resident heiress. Former recipient of his puppy-dog stares and barely-suppressed crush. Also his most frequent client.\r\n\r\nOr... former client, as it turned out.\r\n\r\nThe drama went down in the cafeteria, where all truly great moments of social implosion occurred. Jaune had been minding his business, sitting with his tray of unremarkable but free school food, scrolling through his bookings, and sipping from his drink. He didn't even notice Weiss until she sat across from him, her chin high, her expression... strained. Like she was trying to look imperious but had a tick in her left eye.\r\n\r\n\"Jaune,\" she said sweetly. Way too sweetly.\r\n\r\n\"Hey, Weiss,\" he answered, still looking at his scroll, \"Need to book a session?\"\r\n\r\nShe twitched, \"That's what I wanted to talk about.\"\r\n\r\nHe raised a brow but didn't look up.\r\n\r\n\"I... may be in a temporary state of reduced funding,\" she said with clear irritation, as if the words themselves were beneath her, \"Father, in a completely disproportionate response to my perfectly reasonable expenses, has cut me off.\"\r\n\r\nJaune looked up, eyebrow arching, \"Ah. So no more lien for... services.\" Weiss had been the most varied client to date. It wasn't just that she wanted him to dress up as her older sister, oh no. She liked to be worshipped. Sometimes, she made him kiss her feet. At other times, she played the role of a domineering princess ravaging the helpless prisoner. Let it never be said that Weiss Schnee lacked for creativity.\r\n\r\nWeiss cleared her throat, \"Yes. So I was wondering, given our history, if perhaps a... discount could be arranged. Perhaps even some free sessions?\"\r\n\r\nHe blinked. Slowly, \"A what?\"\r\n\r\nWeiss straightened, \"You know. As a favor. We're friends, aren't we? Surely you wouldn't let something as petty as money stand between us?\"\r\n\r\nJaune stared at her, utterly baffled, \"Weiss. The last time we were alone, you told me to beg you for forgiveness for being a naughty little Dust thief. While calling me a 'dirty Faunus whore'.\"\r\n\r\nHer ears went bright red, \"That's irrelevant.\"\r\n\r\n\"I think it's extremely relevant.\"\r\n\r\nShe leaned forward, folding her hands in front of her, voice dropping to a whisper, \"Come on, Jaune. Don't you have a crush on me? Your Snow Angel? Surely that's worth a freebie-\"\r\n\r\n\"No discounts,\" he said flatly, \"Especially not for what you were asking for.\"\r\n\r\nThere was a loud cough from the next table. Yang had gone completely still, her eyes wide with open delight. Ruby, mouth full of mashed potatoes, looked between them like she was watching a particularly juicy drama unfold. Blake didn't even blink, just kept chewing her salad like she was reading an especially spicy passage in a romance novel.\r\n\r\nWeiss flushed from her collarbone to her hairline, \"You insufferable-\"\r\n\r\n\"Sorry,\" Jaune said, standing up and collecting his tray, \"Business is business.\"\r\n\r\nHe walked off, scroll in hand, already replying to another high-paying client, as Weiss stared after him fuming while the rest of RWBY tried-and failed-to stifle their laughter. Jaune didn't look back. If she wanted Winter so badly, she could go ask her sister.\r\n\r\n[line break]\r\n\r\nJaune was in the middle of another mundane yet surprisingly relaxing afternoon in Beacon's library, scrolling through his booking requests on his sleek new scroll. His newest armor gleamed comfortably under the library's gentle lighting, and his boots, custom-made from Atlesian leather that even Weiss would have been jealous of (and actually had been, given the way she'd pouted over them), rested easily on the polished table.\r\n\r\nHe'd gotten more foreign clients. A noblewoman from Mistral wanted him to serve at a tea ceremony while wearing a traditional kimono (thank you, childhood tea parties). Then there was the Atlas executive who wanted to roleplay being a wife who cheated on her husband. Whether that had any relation to reality, he had no idea. He wasn't being paid to ask questions.\r\n\r\nLife, strange as it had become, was pretty damn good, all things considered.\r\n\r\nAt least, it was until Yang Xiao Long decided to saunter up to him, hips swaying, that signature cocky grin plastered on her lips. Jaune glanced up, one eyebrow arched in mild suspicion as he watched her casually toss herself into the seat across from him.\r\n\r\n\"Hey there, Ladykiller,\" Yang began, grinning in a way that immediately set Jaune on high alert, \"Busy day?\"\r\n\r\nHe tapped his scroll thoughtfully, keeping his tone deliberately neutral, \"Something like that,\" he replied slowly, eyes narrowing just slightly. He knew that look. That was the look of someone about to make his day complicated, \"What's up, Yang?\"\r\n\r\nShe leaned forward, resting her chin on her palm, violet eyes glittering with mischief, \"So, I took a look at your site last night.\"\r\n\r\nJaune felt his stomach twist slightly. This was not the start to a conversation he was hoping for, \"Oh,\" he managed after a moment, his voice cautiously steady, \"Did you now?\"\r\n\r\nYang waved a hand casually, as if it were no big deal, \"Yeah, you know. Just out of curiosity. A few laughs, mostly.\"\r\n\r\nJaune's eye twitched, \"Glad you found my livelihood funny,\" he deadpanned, scrolling idly through the bookings as if he'd heard this a thousand times. Which, given Nora, Ruby, and basically everyone else, he kind of had. Apparently, the idea of him, of all people, being paid for high quality maid sex still boggled people's minds.\r\n\r\nYang laughed loudly, leaning back in her chair, \"C'mon, Vomit Boy. You have to admit, it's pretty hilarious. I mean, who'd have thought Jaune Arc would be Vale's hottest maid?\"\r\n\r\nHe resisted the urge to roll his eyes into orbit, \"Is there an actual point to this, or are you just trying to lower my self-esteem for sport?\"\r\n\r\nYang grinned even wider, leaning in again and lowering her voice conspiratorially, \"Actually, I wanna hire you.\"\r\n\r\nJaune paused. Froze, really. He blinked, once, twice, processing what she'd just said. Yang Xiao Long wanted to hire him. Yang. Beacon's loudest, toughest, most confident brawler (and most notorious flirt). Yang, who never had trouble getting anyone she wanted, was openly asking to buy his services. He coughed lightly, recomposing himself, \"Uh-huh. Right. Well, Yang, I'd love to accommodate you, but you realize I don't come cheap, right?\" He flipped open his booking rates casually, showing her the premium prices without a hint of shame.\r\n\r\nYang's eyes bulged as she glanced at the numbers. She sputtered for a moment, seemingly caught between outrage and disbelief, \"What the heck, Jaune?! That's your rate? I'm literally offering to sleep with you!\" she hissed, looking around to make sure nobody overheard, \"Most guys would kill for that kind of opportunity!\"\r\n\r\nJaune met her eyes, \"Then maybe you should go talk to those guys,\" he said calmly, tone dry, \"I'm being paid very well to sleep with people. Why would I do it for free?\"\r\n\r\nYang spluttered again, her cheeks coloring indignantly, \"Because we're friends!\" she finally managed, as if it were the most obvious reason in the world.\r\n\r\nJaune gave her a flat look, leaning back with his arms crossed, \"Friends?\" he repeated, \"Yang, we're kinda friends, at best. Really, I'm more Ruby's friend. You mostly just chime in occasionally to remind me that I puked on your boots during initiation.\"\r\n\r\nYang bristled, visibly offended, \"Hey! That's not true! I... uh...\" She hesitated, clearly unable to think of a counterargument quickly enough. She glared at him instead, \"The point is, it's supposed to be an honor for you! I'm Yang freakin' Xiao Long!\" He blinked. Well, someone had an inflated ego, didn't they? And he thought Weiss had it bad.\r\n\r\nJaune nodded sagely, \"Yeah, I figured out who you are, thanks,\" he drawled, complete unimpressed, \"You're Yang Xiao Long, and you're asking to hire Jaune Arc, the professional crossdressing maid-slash-escort. For my professional rates.\"\r\n\r\nYang's lilac eyes flashed with annoyance, and she leaned back, crossing her arms with a huff. After a moment of irritated contemplation, she reluctantly dug into her pocket and yanked out a thick bundle of lien cards, practically throwing them across the table at him.\r\n\r\n\"Fine,\" she growled, the pout on her lips almost comically wide, \"You better be good, Arc.\"\r\n\r\nJaune casually gathered the cards, counting them methodically, \"You're short.\" He hummed, meeting her glare without blinking, \"That's only half the fee.\"\r\n\r\nYang let out a strangled noise, her face turning a remarkable shade of red, \"Are you kidding me?! Half? You haven't even done anything yet!\"\r\n\r\n\"Exactly,\" Jaune retorted smoothly, \"That's why it's called upfront payment. You pay first. Besides, it's not like you're strapped for cash.\" He tilted his head, raising an eyebrow, \"Right?\"\r\n\r\nShe glared at him a moment longer before grumbling under her breath and pushing herself up from the table with dramatic flair, \"Fine. I'll pay the other half after,\" she snapped, spinning on her heel and storming away in an irritated huff, drawing more than a few startled glances from nearby students.\r\n\r\nJaune sighed, shaking his head in tired amusement as he neatly pocketed the lien cards. This was his life now. Charging Yang Xiao Long for services he once would've gladly offered for free. The absurdity of it all wasn't lost on him. Weeks ago, if someone told him Yang would literally offer herself to him, he would've been doing cartwheels down the halls. He would've been fistbumping like a lunatic\r\n\r\nNow? Now he just wondered if he should've charged her extra for being a pain in the ass.\r\n\r\nHe slumped back in his chair, staring blankly at the ceiling, \"Well,\" he muttered quietly to himself, \"A client's a client.\" He couldn't help but laugh softly at his own predicament, \"Oh god, I've become that kind of person. I'm charging Yang Xiao Long.\" Somewhere deep inside him, the starry-eyed teenager who once would've jumped at the chance to date someone like Yang was shaking his head in disbelief. The practical, financially secure entrepreneur he'd become, however, was already mentally calculating how to invest Yang's lien into a nice vacation.\r\n\r\nMaybe a nice little cabin in Patch.\r\n\r\n[line break]\r\n\r\nJaune stood outside Team RWBY's dorm room, dressed once again in his now-famous (and frankly, worryingly comfortable) maid outfit. He briefly stared at the door with something approaching tired resignation, one hand clutching a small black case containing his usual cleaning supplies and accessories, the other holding his scroll. Yang had sent him a message, promising that her teammates would all be out, assuring him that they'd have the whole dormitory to themselves for the evening. It had sounded nice enough at the time, but now that he was standing here, he couldn't help but feel a little bit... disappointed.\r\n\r\nIt just felt kind of lazy. Cheap, even. Say what you wanted about Weiss Schnee - and Jaune could say plenty - but at least she'd gone the extra mile and booked out an upscale luxury hotel. Granted, that was before her father had tightened her financial leash, but still. Compared to that, Yang's setup felt like the bargain-bin, store-brand version of his usual service. If he was charging premium rates, shouldn't the location at least be somewhere nicer than a Beacon Academy dorm room with Yang's tangled mess of blankets and Ruby's scattered cookie crumbs?\r\n\r\nWith a quiet sigh and a practiced, professional smile fixed firmly in place, Jaune lifted his hand and knocked lightly on the door. He heard a startled squeak, a curse muffled through the door, and what sounded suspiciously like someone stumbling over a piece of furniture. Moments later, the door jerked open, revealing Yang.\r\n\r\nThe other blonde looked... distinctly unsettled.\r\n\r\nShe was pacing nervously even as she opened the door wider, casting glances around the dorm as if checking that no one was about to burst through the window and discover them. Jaune furrowed his brow just slightly, a faint flicker of unease tickling the back of his mind. Nervousness usually meant complications. And complications usually meant hours of unpaid overtime and a headache that no amount of lien could soothe.\r\n\r\nBut, he ignored that gut instinct and stepped gracefully inside, setting his cleaning case carefully on the desk near Ruby's bed. He took a moment to collect himself before dropping into the now-routine curtsy that came so easily to him, voice rising slightly into that soft, demure, professional lilt he'd perfected after weeks of practice.\r\n\r\n\"Good evening, Mistress. Juliette, at your serv-\"\r\n\r\n\"Yeah, okay, that's enough,\" Yang blurted out hastily, cutting him off mid-curtsy. Jaune blinked. Huh. That was... fast. Usually, even his most eager clients at least wanted a token amount of the maid experience before moving things along. And Yang was definitely the type to milk the scenario for all it was worth, \"Take it off,\" she said abruptly, waving vaguely at his outfit. She was still pacing, anxiety radiating off her in waves.\r\n\r\nJaune raised an eyebrow, still frozen mid-curtsy, trying not to feel personally slighted by how quickly she'd brushed past his admittedly impeccable customer service skills, \"Uh... are you sure? Most clients at least-\"\r\n\r\n\"Yeah, I'm sure,\" Yang interrupted, voice terse and edged with embarrassment. She refused to look him in the eye, and instead hurried over to her closet, yanking open the doors with a bit more force than necessary. She rummaged frantically through her belongings, muttering softly to herself before finally letting out a triumphant little noise.\r\n\r\nThen, with all the confidence she could summon (and honestly, not much dignity) Yang turned and thrust something toward him.\r\n\r\nJaune's eyes widened, his heart sinking faster than his former crush on Weiss.\r\n\r\nYang held out a scandalously short, red, thigh-high kimono paired with silky black stockings, a set of vivid red contact lenses balanced precariously on top. And, he squinted, a black wig with long, sleek tresses spilling through her fingers. Jaune stared at the ensemble, mouth slightly agape as he mentally struggled to parse what exactly she was asking for here.\r\n\r\nWith an expression so serious and somber that Jaune almost felt bad for her, Yang took a deep breath and looked him directly in the eyes, \"I want you to put this on,\" she stated firmly, \"The contacts, wig, everything.\"\r\n\r\nJaune's gaze flicked from Yang's carefully blank face down to the incredibly specific costume ensemble clutched tightly in her hands. Something was clicking in his mind and his stomach twisted unpleasantly, \"Uh,\" Jaune began carefully, \"That's a bit different from the usual requests I get. Mind explaining what this is all about?\" Why did it feel like he was trapped in the room with Weiss?\r\n\r\nYang visibly struggled, cheeks tinged crimson. She shifted uncomfortably on her feet, looking away. After a tense pause, she finally exhaled, squaring her shoulders and forcing out the words through gritted teeth, \"Just put the fucking stuff on, Arc. Oh, and one more thing. During the session, I'll be... calling you Raven.\"\r\n\r\nJaune's heart sank further. Oh. Oh, no. He recognized that name. He knew exactly who Raven was. Raven, the notorious Branwen bandit leader, feared warrior... and Yang Xiao Long's notoriously absent mother. The same mother she constantly claimed to not give a shit about but was clearly emotionally entangled with in all the worst ways.\r\n\r\nA deeply uncomfortable silence hung thickly between them, broken only by the faint hum of Beacon's hallway lights outside. Jaune slowly looked from Yang's deeply earnest, mortified expression back down to the kimono in her hands, then back up to her increasingly anxious eyes.\r\n\r\nFor several long seconds, Jaune didn't speak. He just stared, his brain attempting a very hurried reboot sequence. A sister complex had been bad enough -Weiss had pushed him into territory he wasn't exactly comfortable exploring, being a middle child of seven sisters - but at least that had been somewhat understandable. Sibling rivalry, family pressure, high expectations. Weird, but logical.\r\n\r\nBut now Yang... this was different. This was a whole new level of strange. Yang Xiao Long wanted him to dress up as her deadebat mom while she...what? Fucked him? Cried on his lap? He pinched the bridge of his nose, closing his eyes tightly for a second as he fought off a sudden wave of existential dread. First Weiss and her blatant sister complex, now Yang and... this. He was beginning to worry that \"Juliette\" might be cursed, attracting only clients with deeply uncomfortable family issues and concerning emotional baggage. Maybe he needed to raise his rates. Maybe he needed therapy. Maybe both.\r\n\r\nJaune exhaled heavily, opened his eyes, and looked down at the offered kimono again, resigning himself to the inevitable. Yang was staring expectantly, almost pleadingly, clearly mortified but determined. Slowly, with the solemn dignity of a soldier heading off to war, Jaune took the outfit from her outstretched hands. Yang sagged in visible relief, shoulders relaxing slightly.\r\n\r\nJaune stared at the kimono in his hands with the weary resignation of a man who'd seen too much. The money, he reminded himself as he shuffled toward the bathroom. Just think about the money.\r\n\r\n\"You know,\" Yang called after him, voice pitched several octaves higher than usual, \"This is totally normal! Everyone has roleplay fantasies!\"\r\n\r\nJaune paused at the bathroom door, turning slowly to face her with a deadpan expression, \"Dressing someone up as your deadbeat mom is normal?\"\r\n\r\nYang's face flushed crimson, \"It's not- I don't-\" She crossed her arms defensively, \"It's not about mommy issues! I just... happen to like the aesthetic! The whole bandit queen vibe is... you know... cool.\"\r\n\r\n\"Right,\" Jaune nodded mechanically, \"And the name?\"\r\n\r\n\"Total coincidence!\" Yang blurted too quickly, \"Raven is just...\" She flapped her hands vaguely, \"Ravens are literally my least favorite birds! So negative and... bird-like!\"\r\n\r\nJaune blinked slowly, \"Your least favorite birds.\"\r\n\r\n\"Absolutely!\" Yang said, pacing nervously, \"Crows? Love 'em. Seagulls? Adorable thieves. But ravens? Can't stand 'em. Too... black and... ravenous.\"\r\n\r\nJaune didn't even try to hide his disbelief, \"And that's why you want me to dress up as one and call me Raven.\"\r\n\r\n\"Exactly!\" Yang snapped her fingers as if he'd just solved a complex mathematical equation, \"See? You get it!\"\r\n\r\n\"I really don't,\" Jaune muttered, disappearing into the bathroom.\r\n\r\nHe laid out the ensemble on the counter, studying it with the clinical detachment of someone dissociating from reality. The kimono was clearly expensive-quality silk, precise stitching, and alarmingly accurate to what little he'd seen of Yang's mother in news reports about bandit raids. The wig looked professionally styled. Even the contacts were high-end.\r\n\r\n\"How long have you been planning this?\" he called through the door.\r\n\r\nThere was a suspicious pause, \"Planning what?\" Yang's voice was strained, \"This totally spur-of-the-moment, not-at-all-thought-out thing?\"\r\n\r\nJaune sighed, beginning to swap his maid outfit for the kimono, \"You just happened to have a perfect Raven costume lying around?\"\r\n\r\n\"I'm... into cosplay?\" Yang offered weakly.\r\n\r\n\"Uh-huh,\" Jaune murmured, struggling with the wig, \"And do you often cosplay as your own mom?\"\r\n\r\n\"SHE'S NOT-\" Yang caught herself, clearing her throat, \"It's just a style preference! Some people like nurse outfits. Some people like maid outfits. I like... this!\"\r\n\r\nJaune carefully inserted the red contacts, blinking until they settled. The transformation was disturbingly effective-even he had to admit, staring at his reflection, that the resemblance was uncanny. The red eyes staring back at him seemed to ask, What life choices brought you here? \"You better be paying the other half,\" he muttered to himself, adjusting the kimono's neckline, \"Maid service therapy isn't covered by Beacon's health plan.\"\r\n\r\nWhen he emerged, Yang's reaction was immediate and unsettling. Her eyes widened, pupils dilating as she took an unconscious step backward. Her mouth opened and closed wordlessly, fingers twitching at her sides. He did NOT like the look on her face. That should not be the look someone gave to a person dressed like their mom.\r\n\r\n\"So,\" Jaune said flatly, spreading his arms, \"Is this what your least favorite bird looks like?\"\r\n\r\nYang swallowed hard, \"It's... accurate,\" she managed, voice suddenly husky.\r\n\r\nJaune sighed deeply, \"I charge extra for psychological damage, just so you know.\"\r\n\r\n\"Worth it,\" Yang whispered, almost to herself.\r\n\r\n\"What was that?\"\r\n\r\n\"Nothing!\" Yang straightened, composing herself, \"Just... you know... appreciating well-made the outfit is!\"\r\n\r\nJaune crossed his arms, the kimono's silk rustling softly, \"Yang, we both know what this is.\"\r\n\r\n\"A completely normal roleplay scenario?\" She offered a brittle smile.\r\n\r\n\"This is about your mom issues.\"\r\n\r\n\"I don't have mom issues!\" Yang protested, throwing her hands up, \"I have abandonment issues, thank you very much! Totally different category of trauma!\"\r\n\r\nJaune couldn't help but laugh at the absurdity, \"Oh, well in that case, my bad. Clearly this is completely healthy and not at all concerning!\"\r\n\r\nYang pointed an accusatory finger at him, \"Hey! You dressed up as Weiss's sister for her! How is this any different?\"\r\n\r\n\"It's not,\" Jaune admitted tiredly. He didn't even ask how she knew that considering Weiss insisted on keeping it a secret, \"You're both really sketch clients with family issues that would make a therapist retire early. At least Pyrrha just wanted me in the maid outfit without making me call her mommy.\"\r\n\r\nYang's eyebrows shot up, \"Wait, you and Pyrrha-\"\r\n\r\n\"Not relevant,\" Jaune cut her off, running a hand through the wig's silky strands. Why was it so high quality?! \"Look, I'm here, I'm dressed up, you're paying me. Let's just get this over with so I can start repressing this whole thing.\"\r\n\r\nYang nodded eagerly, already moving toward the bed, \"Right! Yeah! Let's do this!\"\r\n\r\nAs he followed her, Jaune couldn't help but mutter under his breath, \"First Schnee family roleplay, now Branwen bandit fantasy. I swear to gods, if Ruby asks me to dress up as their dad next...\"\r\n\r\nYang froze mid-step, \"What was that?\"\r\n\r\n\"Nothing,\" Jaune sighed, \"Just calculating how much therapy this is going to cost me.\" Yang had the decency to look momentarily guilty before her gaze drifted back to the red-eyed, kimono-clad figure before her. Her expression shifted, something complicated and deeply concerning flickering across her face, \"The money,\" Jaune reminded himself yet again, taking a steadying breath, \"Just think about the money.\"\r\n\r\nAnd the hours of therapy he was definitely scheduling first thing tomorrow.\r\n\r\nAs soon as Yang reached the bed, it was like a switch flipped. Her jittery pacing disappeared and her body went weirdly still. When she turned around, her eyes were blood red and the voice that came out was hard and rough, \"On your fucking knees.\" She tapped the ground in front of her with her right boot.\r\n\r\nJaune wasn't even fazed by the sudden shift. With the grace of a true professional, he did just that, holding back a cringe as he knees hit cookie crumbs. He looked up at her crimson orbs. For most students, being on their knees while a pissed off Yang looked down at them was a cause for concern, but Jaune already knew better by now. He didn't say anything yet. She'd tell him when.\r\n\r\n\"Well, well, well.\" She chuckled, the sound low and hoarse. She reached out with her right hand and grabbed the top of his wig, pulling it back to jerk his head up. He followed along. The wig was fastened tight in preparation for any rough play, but the last thing either of them needed was it slipping off, \"The great Raven, the scourge of Anima. How's it feel being fucking helpless? Huh?\" She tugged the wig again.\r\n\r\n\"...Yang, rough play costs extra.\"\r\n\r\n\"Wha?\" Her red eyes turned lilac again, \"Dude, you're ruining this!\"\r\n\r\n\"And if you pull any harder, the wig's gonna come off!\" he shot back, \"You wanna get handsy? Grab the kimono or something! At least that's supposed to come off. But remember, rough stuff costs extra.\"\r\n\r\n\"Rrgh, fine! Just...stay in character!\"\r\n\r\n\"What character? I thought this was just your least favorite bird?\" Jaune blinked innocently.\r\n\r\n\"I swear to the Brothers, Jaune.\" She shook her head, \"Look, just act like an overconfident bitch. Like, the kind of bitch who ditches her husband and baby without even changing a single diaper and thinks she's the hottest shit ever.\"\r\n\r\n\"Fine.\" He was even nice enough to not comment on how this was OBVIOUSLY about her mommy issues. Jaune coughed and schooled his face in a defiant, resting bitch face expression, \"I'm sorry? Am I supposed to know who you are? I deal with cocky little brats all the time.\"\r\n\r\nThat did it. Yang's sadistic smirk came back and her eyes turned red again. She did take his advice, at least, and shifted her hand from the wig to the collar of the kimono, \"Huh, you're as much of a bitch as dad said.\" Her smirk widened, the gesture all teeth, \"It's kinda amazing that you've still got your head so far up your ass after I knocked your teeth in.\"\r\n\r\n\"You got lucky.\" Jaune scoffed. He made sure to sound as Weiss-like as possible, \"What do you want, brat? Come to cry on my lap and ask why I left?\"\r\n\r\nYang tossed him roughly onto the bed. Jaune broke character for a second and yelped as he ended up flat on his back. Before he could even sit up, Yang was already on top of him. The other blonde straddled his waist, her eyes searing into his while her hair burned across her back like a fiery waterfall. She was angry, but more than that, she was loving this. She wanted to be pissed.\r\n\r\nJaune twitched as he felt Jaune Junior stirring. The kimono had ridden up when she threw him, exposing the spats underneath (lingerie cost extra, thank you very much). Even with how weird this whole thing was, he couldn't deny that Yang was hot. One of the hottest women in the school, according to chatter in the guys locker room. Even the seniors looked twice when she walked down the halls.\r\n\r\nAnd now she looked like she wanted to destroy him.\r\n\r\nYang cupped the sides of his jaw with both hands and leaned down, capturing his lips in a kiss. No, calling it a kiss was an understatement. He'd had desperate and domineering clients before, but they were usually civilians without Aura or combat training. Yang put them all to shame. Her pressed against his mouth like she was trying to suffocate him, her tongue battering his as she licked, sucked, and bit him like a Grimm mauling a civilian.\r\n\r\nAnd... he was into it.\r\n\r\nHis cock rose rapidly, pressing against her right thigh through his spats. He felt Yang smile against his lips before she growled, \"What's wrong, Raven? Getting hard for the daughter you ditched?\" Jaune winced. Did she really have to remind him that this was about her mommy issues? \"Fucking pathetic.\"\r\n\r\n\"Yang-\"\r\n\r\n\"No.\" She put a finger against his lips, surprisingly gentle, \"You don't get to talk this time, Raven.\"\r\n\r\nYang shucked off her jacket with her tube top following shortly after. Despite everything, Jaune couldn't help but stare. Clients tended to be a mixed bag. Huntress clients were all lookers - it was a joke that there's literally not a single average-looking Huntress in Remnant thanks to their Aura and training - while civilians ran the gamut from pretty to dowdy.\r\n\r\nBut Yang? She was like a work of art. Muscles that almost put Pyrrha to shame with lightly tanned, flawless skin from a life of outdoor living. Her tits were huge, probably the biggest among their two teams, and below that? Abs. Abs you could grate Dust crystals on. While he had a thing for petite women like Weiss, there was an undeniable appeal to a woman who looked like she could paint the walls with his guts.\r\n\r\n... No, he didn't have issues.\r\n\r\n\"See this?\" She flexed her arms, showing off the rippling muscles, \"I didn't need you to be strong, Raven. I didn't need to go squat in the woods like a crazy murder hobo to prove anything.\"\r\n\r\nAnd just like that, he was checking out again. He was almost tempted to pay Yang back her deposit if she just stopped opening her mouth. His eyes glazed over as she continued ranting and he looked out the window. There, sitting on a bench right outside, was a single raven. It stared at them both without blinking, practically radiating judgement. He could've sworn its beak was frowning.\r\n\r\n\"Hey, you listening?!\" Yang grabbed his face and forced him to face her again.\r\n\r\n\"Sorry, I don't care about the opinions of shitty brats,\" Jaune said. Hey, at least he was keeping in character.\r\n\r\n\"You little...\" She growled. For a second, he thought she'd forget the rules and smack him in the face. Instead, she shimmied off her shorts to expose her lightly shaved pussy. He didn't get the chance to say anything back before she tore off his shorts - literally tore them off - and positioned her entrance over his erect dick.\r\n\r\nShe slammed herself down until he took his cock up to the base. No hesitation, no foreplay, nothing. Jaune gasped like he was punched while Yang let out a sound between a growl and a groan of pain. She was tight. Gods, so fucking tight. Through bleary eyes, he saw her hair turning into fire itself, her breaths coming out in quick, ragged pants.\r\n\r\n\"Y-Yang...\"\r\n\r\n\"Sh-Shut up...!\" She pressed both hands against his chest and slowly lifted herself up. Inch by agonizing inch, his cock was slowly pulled out of her cunt, the walls pressing against the sides like they refused to let go. He was tempted to reach out and grab her hips, to slam her back down on his dick till she screamed.\r\n\r\nInstead, he forced his hands to his sides and held back. This was a job, he told himself. This was Yang fucking her way through whatever mommy issues she had. Customer satisfaction. He repeated the phrase like a mantra she raised herself until only the head of his dick was inside.\r\n\r\nThen she slammed back down. It wasn't controlled or particularly methodical. Her hips and ass just fell like she tripped and his dick went inside with a little less resistance than before, \"Th-That's right...\" Yang moaned and balled her hands into shaky fists, tearing at the kimono's high quality fabric. He didn't bother to shout out a warning. It was her money. If she wanted to tear it off, it was her business.\r\n\r\nJaune's breaths came out sharp and quick. He looked away again, trying to focus on something else to keep himself from cumming too quickly.\r\n\r\nHis eyes were drawn to the raven perched outside the window again. It was still there, still watching them with silent judgement. For some reason, he could almost see an eyebrow raised in contempt.\r\n\r\nAnother black bird - a crow - joined the judgmental raven. It perched next to her (after taking a few swipes with its claws) then turned to face the window. Its beak parted once it saw them, like it was expecting them to stop and throw seeds at it right in the middle of their fucking. It looked between them and the perching raven before it fell off the branch like a stone.\r\n\r\n...\r\n\r\nWell, that was weird.\r\n\r\n\"I said LOOK AT ME!\" Yang grabbed his jaw with one hand and forced him to face her. Red met red as Yang held his head in place, \"You don't get to ignore me anymore, Raven! Twenty fucking years and you're finally gonna pay attention to me!\"\r\n\r\nJaune groaned, and it had nothing to do with the fact that his dick was in her snatch. He silently pleading for Yang to just please stop talking, but of course, she didn't. He did his best to simultaneously look at her tune and out the blubbering rant she really should've been giving to a therapist instead of someone she was fucking like a bitch in heat.\r\n\r\nWhen he finally came (after pulling out, of course), it felt more like an obligation than anything else. Did it feel good? Absolutely. Did it feel like he should've been charging more than his usual rate? Also absolutely. Yang gasped and fell on top of him, and even the feeling of her tits pressing against his chest did little to change how mentally haggard he felt. Through the window, he just barely saw the Raven caw before flying away in what felt like disgust.\r\n\r\n\"There, there...\" Jaune patted her back awkwardly as she cried about how 'she' left her. Maybe he should offer counseling services next time.\r\n\r\nHours later, Jaune stood in Team RWBY's bathroom, methodically washing away all traces of the Raven persona. The red contacts came out first, dropped unceremoniously into their case. The wig followed, carefully set aside despite his urge to burn it. As he scrubbed his face clean, he caught glimpses of his expression in the mirror. A thousand-yard stare that spoke volumes about what he'd just endured.\r\n\r\n\"Never again,\" he muttered to his reflection, which seemed to nod in solemn agreement.\r\n\r\nHe reached for his maid outfit, the familiar frills and lace offering a strange comfort after hours of... whatever that had been. At least as Juliette, he was playing a character he'd created, not someone's estranged mother with who they wanted to hate fuck.\r\n\r\nYang lounged on her bed, looking far too relaxed for someone who had just enacted what was essentially several hours of extremely expensive therapy. Her hair was tousled, her expression satisfied in a way that made Jaune's skin crawl when he thought about the context. She didn't look like someone who spent the past couple of hours bawling and asking about why she wasn't good enough.\r\n\r\n\"So,\" she drawled as he emerged from the bathroom, adjusting his headband, \"That was... something, huh?\"\r\n\r\n\"Something's one word for it,\" Jaune replied flatly. He straightened his apron, preparing to leave this experience firmly in his mental 'never speak of again' file alongside most of his Weiss encounters, \"Where's the rest of my fee?\"\r\n\r\nYang's relaxed demeanor faltered. She coughed awkwardly, suddenly finding the ceiling fascinating, \"Right. About that...\"\r\n\r\nJaune paused, a chill running down his spine. He knew that tone. That was the universal tone of someone about to try weaseling out of a financial obligation, \"Yang,\" he said, his voice dangerously calm, \"The rest of my payment?\"\r\n\r\nShe sat up, rubbing the back of her neck with an awkward laugh, \"Okay, well... funny story. I don't exactly... have it?\"\r\n\r\nThe silence that followed was so thick you could have cut it with Crocea Mors, \"You don't have it,\" Jaune repeated, each word carefully measured.\r\n\r\n\"Well, I had it,\" Yang clarified quickly, gesturing toward the discarded Raven outfit, \"But that shit wasn't exactly cheap, you know? Premium silk, custom tailoring, professional-grade contacts...\"\r\n\r\nJaune stared at her blankly, \"You spent my payment... on the outfit... that you made me wear.\"\r\n\r\n\"When you put it like that, it sounds bad!\" Yang whined.\r\n\r\n\"How else should I put it?\"\r\n\r\n\"Like... an investment in the experience?\" She offered a hopeful smile, \"Besides, you got half already! Maybe this one could be a freebie? For friendship? And getting to fuck the hottest chick at Beacon?\" She winked and stuck her tongue out, a gesture that would've left any other man a puddle on the floor.\r\n\r\nJaune was not any other man.\r\n\r\nHis eye twitched. He took a deep breath, counting backward from ten. When he spoke, his voice was eerily calm, \"Yang Xiao Long,\" he said, straightening to his full height (which, in heels, was considerable), \"You owe me the rest of my payment. This is not a negotiation.\"\r\n\r\nYang's smile faltered, \"Come on, Vomit Boy, don't be like that-\"\r\n\r\n\"You have until next week,\" Jaune continued as if she hadn't spoken, \"Or I'll be taking you to small claims court.\"\r\n\r\nYang's jaw dropped, \"What? Small claims- are you fucking serious?!\"\r\n\r\n\"Completely.\" Jaune didn't blink, \"I have our agreement in writing, timestamped messages confirming your booking, and half-payment as evidence of intent. I have a business to run, and I don't work for free. Especially not for whatever that was.\"\r\n\r\n\"That's going way too far!\" Yang yelped, scrambling off the bed, \"We're friends! You can't sue your friends!\"\r\n\r\n\"Friends pay their debts,\" Jaune replied coldly, \"And by the way, you're also banned.\"\r\n\r\n\"Banned?!\" Yang spluttered, \"You can't ban me!\"\r\n\r\n\"One month minimum,\" Jaune continued, collecting his cleaning kit, \"For jerking me around.\" And she didn't even jerk him around. He would've lowered the ban if she did.\r\n\r\n\"But- But-\" Yang was practically hopping with indignation now, \"What if I need your services again? What if I have... you know... urges?\"\r\n\r\n\"Then I suggest cold showers and therapy,\" Jaune said, heading for the door, \"Lots of therapy. Maybe you can book a double session with Weiss. I know a good family therapist if you need a recommendation.\"\r\n\r\nYang followed him, still protesting, \"This is ridiculous! I'll pay you back, but a ban? Really? Come on, Jaune, be reasonable-\"\r\n\r\n\"Goodbye, Yang,\" Jaune cut her off, opening the door, \"I expect payment in full by next Friday. Have a good night.\"\r\n\r\nHe stepped into the hallway, shutting the door on her continued sputtering. Her muffled complaints followed him down the corridor, but Jaune didn't look back. He walked with the straight-backed dignity of someone who had just survived yet another bizarre encounter in what was becoming an increasingly strange career. Not a walk of shame. A walk of pride.\r\n\r\n... Mostly pride.\r\n\r\n\"Therapy,\" he muttered to himself as he headed back to his dorm, \"Definitely scheduling a therapy session tomorrow.\" And maybe a business management course focusing on advance deposits and contract enforcement.\r\n\r\n[line break]\r\n\r\nOmake: That's So Raven\r\n\r\nJaune tugged nervously at the long blonde wig, the hair cascading down his shoulders in a way that felt distressingly familiar. The texture, the color, the particular wave of the strands... it looked exactly like Yang's hair. Far too much like Yang's hair. The resemblance made his stomach twist uncomfortably considering their last meeting.\r\n\r\n\"Is this really necessary?\" he asked, eyeing his client warily.\r\n\r\nRaven Branwen - yes, the Raven Branwen, notorious bandit leader and Yang's estranged mother - merely smirked. Her red eyes glinted with amusement as she gestured imperiously toward the bed.\r\n\r\n\"Sit,\" she commanded.\r\n\r\nJaune sighed but obeyed, perching awkwardly on the edge of the mattress. The hotel room was aggressively luxurious, the kind of place where the minibar water cost more than his old combat boots. The booking request had come out of nowhere: a hefty advance payment and sparse instructions, with the name \"R. Branwen\" on the form. He'd assumed it was a pseudonym until she'd walked through the door in all her terrifying glory.\r\n\r\n\"So... what exactly am I supposed to do?\" Jaune asked, crossing his legs nervously, \"Cleaning? Tea service? Um... other services?\" His female clients came from all ages. Young, old, and in-between. His only stipulation was that they were legal.\r\n\r\nRaven didn't answer. She tilted her head, studying him with an unreadable expression, her mouth a tight line. Then, without a word, she turned and walked toward the door.\r\n\r\nJaune blinked in confusion, \"Wait, where are you-\"\r\n\r\nThe door clicked shut behind her.\r\n\r\nJaune stared at the empty space where Raven had been standing just moments before, his mouth hanging open, \"Uh...\" he said to the empty room. Had she forgotten something? Was this some kind of test? Was she coming back with... equipment? Jaune shuddered at the possibilities. Given his recent experiences with the women in his life, nothing would surprise him anymore.\r\n\r\nHe waited. And waited. Minutes ticked by. The silence of the room pressed in on him. He checked his scroll - fifteen minutes had passed.\r\n\r\n\"Hello?\" he called out uncertainly.\r\n\r\nNo response. He stood up, pacing nervously. Maybe this was some kind of elaborate roleplay scenario he wasn't familiar with? Maybe she wanted him to chase after her? Or maybe she'd been called away for some emergency bandit business? Sorry, can't stay for my weird sex appointment, there's a village that needs raiding cause I'm actually a monster.\r\n\r\nThirty minutes. He sent a message: Is everything okay? No response.\r\n\r\nAn hour. He'd tried the door. Unlocked. He could leave if he wanted, but she'd paid in advance. A lot. And Juliette didn't bail on contracts.\r\n\r\nTwo hours. Jaune lay back on the bed, still wearing the blonde wig, staring blankly at the ceiling, \"What is happening right now?\" he asked the chandelier. The chandelier didn't respond.\r\n\r\nFour hours. He'd gone through all five stages of grief, reorganized his scroll apps by color, and counted the ceiling tiles twice, \"This,\" he said to the empty room, \"Is officially the weirdest booking I've ever had.\"\r\n\r\nFinally, just as the sun was beginning to set, casting long shadows across the plush carpet, the door clicked open. Raven walked in as casually as if she'd just stepped out for coffee, not a hair out of place. She looked at Jaune, still wearing the blonde wig (though considerably more disheveled after hours of anxious fidgeting), and nodded once.\r\n\r\n\"Good. You stayed,\" she said, as if this were a completely normal interaction.\r\n\r\nJaune sat up straight, bewilderment giving way to indignation, \"You were gone for six hours!\"\r\n\r\nRaven shrugged, reaching into her pocket and tossing a stack of lien cards onto the bed beside him, \"Here. For your time.\"\r\n\r\nJaune stared at the money, then back at Raven, \"What... What was that? What just happened? What was the point of all this?\"\r\n\r\nRaven's lips curved into a cold smile, \"Neglect play. I was feeling nostalgic.\"\r\n\r\nThe words took a moment to register. When they did, Jaune's jaw dropped, \"Wait - you mean you just... left? On purpose? That was the whole service you wanted?\"\r\n\r\n\"Yep.\" Raven crossed her arms, looking unnervingly pleased with herself, \"Six hours of abandonment. Just like old times.\"\r\n\r\nJaune stared at her in horrified realization. The blonde wig. The sitting and waiting. The abandonment, \"Oh my god,\" he whispered, \"You're fucked up.\"\r\n\r\nRaven didn't even flinch at the accusation. She merely raised an eyebrow, her red eyes glacial, \"Says the boy taking money to wear a wig and sit on his ass for six hours.\" She gestured to the lien pile, \"Easiest job you've ever had, wasn't it?\" Jaune looked down at the money - it was substantially more than his usual rate - then back at the bandit leader. He couldn't argue with her logic, as twisted as it was.\r\n\r\nUgh...this sucked.\r\n\r\n\"Get going,\" Raven said, \"Unless you wanna stay for round two? I could leave for twelve hours this time. And no scroll.\"\r\n\r\n\"No thank you,\" Jaune said quickly, gathering the lien and standing up. He pulled off the blonde wig, tossing it onto the bed with perhaps more force than necessary, \"I think I've had enough Branwen family therapy for one lifetime.\"\r\n\r\nRaven's cold laugh followed him to the door, \"Smart boy.\"\r\n\r\nAs Jaune reached for the handle, a thought struck him. He turned back, unable to help himself, \"Does Yang know about... any of this?\"\r\n\r\nRaven's smile froze, something unreadable flickering in her eyes, \"What happens between a client and service provider stays between them, doesn't it, Juliette?\"\r\n\r\nThe emphasis on his professional name was clear - a reminder of his own precarious reputation. Jaune swallowed hard and nodded, \"Right. Well. Have a... have a good evening,\" he managed, slipping out the door.\r\n\r\nIn the hallway, Jaune leaned against the wall, exhaling slowly as he tried to process what had just happened. Somehow, despite doing absolutely nothing for six hours, he felt more exhausted than after any other booking.\r\n\r\n\"The Branwen women,\" he muttered to himself, pocketing the huge stack of lien, \"Never again.\" But even as he said it, he knew that given the amount of lien in his pocket, he'd probably do it again in a heartbeat. Six hours of doing nothing but waiting around in a wig? Compared to his usual bookings, that was practically a vacation.\r\n\r\nMaybe he was a little fucked up too.\r\n\r\n[line break]\r\n\r\nMommy issues Yang done. Poor Jaune. Guy might as well just take a job as a proper therapist with all the family issues he's dealing with."
    },
    {
      "title": "Chapter 5",
      "text": "Next Maid Jaune chapter focus on Ruby. No smut for this one. Just Jaune hanging out with his super bestie better than the restie with no weirdness at all.\r\n\r\n[line break]\r\n\r\nWeeks blurred together in a flurry of bookings, outfits, and increasingly unhinged client requests. Jaune had established himself as Vale's premier crossdressing maid-escort (cause that sounded way more dignified than maid-hooker), and business was, quite frankly, booming.\r\n\r\nYang had eventually paid up (after he'd sent her a formal notice of legal action on Beacon letterhead he'd 'borrowed' from Goodwitch's office). She'd stomped up to him in the cafeteria, slammed down a stack of lien cards, and muttered something about him being \"no fun anymore\" before skulking away. The ban remained in effect, not that it mattered. His schedule was so full-up that he wouldn't have been able to pencil her in even if he wanted to.\r\n\r\nPyrrha continued her stress relief sessions with him, though Jaune steadfastly refused to classify these encounters as the same thing he did with paying clients. That was different. He was helping his partner! When she clutched his shoulders and begged him to \"punish her for being a bad girl\", that was just... teamwork. Totally normal partner stuff. Being a champion tournament fighter and celebrity must've been really stressful.\r\n\r\nWeiss, meanwhile, had taken to glaring at him from across classrooms, her icy stare following him as he checked his rapidly filling schedule on his brand-new custom scroll. Sometimes, when he was feeling particularly petty, he'd flash the device at her just to watch her eye twitch. Mean? Maybe. But she made him put on fake cat ears (Blake would've had a field day with that), a collar, and kiss her feet while throwing slurs at him. Like, old Atlesian slurs. He wasn't even a Faunus and he felt offended.\r\n\r\nIt was, all things considered, a remarkably profitable time to be Jaune Arc.\r\n\r\nWhat continued to baffle him, however, was the sheer demand. He'd assumed the novelty would wear off, that his clientele would gradually dwindle as people got their weird maid fetishes out of their systems. But instead, his inbox was constantly flooded with requests. Somehow - and he genuinely couldn't wrap his head around it - the knowledge that a male Beacon student was offering \"premium maid services\" had spread like wildfire through Vale's upper social circles. His website traffic had tripled. He'd had to upgrade his scroll plan just to handle the booking notifications.\r\n\r\nHis rates climbed higher with each passing week in an attempt to stem the side, and still they came (in more ways than one). People were willing to pay out of the ass to get fucked by a guy in a maid outfit., \"It's creepy,\" he muttered to himself one evening as he sorted through a new batch of inquiries, \"Why are so many women into this?\"\r\n\r\nThe most disturbing part was how many of them had family-related fantasies. After Weiss and Yang, he'd updated his website with a new policy: NO FAMILY ROLEPLAY. It resulted in a flood of messages asking for \"exceptions\" and offering to pay double. He'd deleted them all immediately and doubled down on the policy. MAYBE he'd make exceptions at some point, but that was something he'd consider down the line. Right now, his sanity was more important.\r\n\r\nHis standards were evolving. His rates were too.\r\n\r\nBy the time Halloween rolled around - which also happened to be Ruby's 18th birthday - Jaune had enough lien to buy a small house in Vale outright, if he'd wanted to. Instead, he'd invested most of it, upgraded his gear (premium Atlesian steel for Crocea Mors and custom lightweight armor), and was considering taking a vacation to Vacuo during winter break. Somewhere warm, far away, and where nobody knew what a \"Juliette\" was. Pyrrha had invited him to her hometown of Argus.\r\n\r\nShe was a good friend.\r\n\r\nYang, as expected, had gone all out for her sister's birthday. After the school's official Halloween celebration wound down, she reserved one of the study rooms for a private party. Just Teams RWBY and JNPR, some punch (which Nora had almost certainly spiked), a mountain of cookies, and a cake shaped like Crescent Rose.\r\n\r\nJaune arrived dressed as a pirate - complete with an eyepatch, a fake parrot on his shoulder, and a surprisingly realistic cutlass that no one looked twice at considering it was the most normal looking weapon on campus, \"No, Nora,\" he'd said firmly when she'd greeted him at the door with a too-innocent smile and a garment bag in her arms, \"I am not wearing the maid outfit to Ruby's birthday.\"\r\n\r\n\"Oh, come on!\" Nora had whined, shaking the bag temptingly, \"It's a costume party!\"\r\n\r\n\"It's a Halloween party that happens to be on Ruby's birthday,\" Jaune said, \"And I'm already in costume. See?\" He gestured to his pirate getup, \"Yarr.\"\r\n\r\nNora had pouted but relented, though not before giving him a knowing look, \"You're no fun anymore, rich boy.\"\r\n\r\nThe room buzzed with the comfortable chatter of his friends. Blake had come dressed as a ninja (though it was suspiciously similar to her everyday outfit), Weiss was some kind of elegant ice queen (again, debatably just her normal self with a tiara), Pyrrha was an old Mistralian goddess (a bit on the nose, but she pulled it off), and Yang was... well, Yang was dressed as a firefighter in a costume that definitely violated several of Beacon's dress code regulations.\r\n\r\nNow, several hours into the party, Jaune was nursing a cup of punch by the window, watching with mild amusement as Nora (dressed as a viking) tried to convince Ren that his \"monk\" costume wasn't a costume at all but just his regular clothes with a different colored headband. She was probably just mad that he didn't go shirtless like the monks she expected.\r\n\r\nHe was debating whether to call it a night when a blur of red and black bounced up to him, silver eyes shining beneath a set of plastic vampire fangs, \"Jaune!\" Ruby lisped around her fake teeth, her cape swishing dramatically as she spun to face him, \"Howsh the party? Having fun?\" Jaune grinned despite himself. Ruby's costume was, like most things about her, adorably earnest - a frilly gothic dress with a high collar, a red-lined black cape, and those ridiculous lien-store fangs that were clearly too big for her mouth. She'd even painted a trail of fake blood from the corner of her lips down her chin.\r\n\r\n\"It's great, Ruby,\" he said, raising his cup in salute, \"Happy birthday. Sorry I didn't bring a gift. I've been, uh...busy.\" He rubbed the back of his neck awkwardly. Between juggling clients, keeping up with schoolwork, training, and trying to maintain some semblance of normalcy, he'd completely forgotten to shop for her.\r\n\r\nRuby waved a hand dismissively, \"S'okay! Yang got me enough stuff for, like, three birthdays.\" She gestured toward a pile of presents on a nearby table, most wrapped in yellow paper with little fireball designs. Say what you will about Yang Xiao Long - cheapskate, weirdo with mommy issues - but she was doting to her sister, \"Besides, you can totally make it up to me!\"\r\n\r\nJaune couldn't help but smile at her enthusiasm, \"Sure thing. Name it, and it's yours. I can afford pretty much anything these days.\" He couldn't resist a small boast. He'd worked hard for that lien, even if the specifics of how he'd earned it were...unconventional. The money (and stuff) spoke for itself.\r\n\r\nRuby's silver eyes widened, and she practically vibrated with excitement, \"Anything?\"\r\n\r\n\"Within reason,\" Jaune clarified quickly, memories of previous \"anything\" requests flashing through his mind, \"I'm not buying you a new dust-infused scythe blade. I've seen how much those cost.\" Mostly because most sane people didn't use scythes, so you had to get it custom ordered.\r\n\r\n\"No, no, it's not that,\" Ruby assured him, fidgeting with the edge of her cape. She glanced around the room, then leaned closer, lowering her voice conspiratorially, \"I want to hire you.\"\r\n\r\nJaune blinked, his cup frozen halfway to his lips, \"I'm sorry, what?\"\r\n\r\nRuby bounced on her heels, her fangs bobbing precariously, \"I want to hire you! You know, for your...services.\" She waggled her eyebrows in what he assumed was meant to be a suggestive manner but looked more like she was having a mild seizure. Ruby Rose was a lot of things. Loyal, friendly, sweet, and one of the best fighters in their year. But one thing she wasn't was smooth. It was one reason they were friends. Even now, months after his side-job, he wouldn't exactly call himself a charmer. The maid outfit did a LOT of the heavy lifting.\r\n\r\nJaune stared at her, his brain momentarily blue-screening. Ruby Rose, beacon of innocence and weapons enthusiast, wanted to hire him. For that. The same Ruby who once spent an entire afternoon explaining why cookies were a perfectly acceptable breakfast food. The same Ruby who still collected limited edition Gun Tales figurines.\r\n\r\n\"Ruby,\" he started carefully, \"Do you...understand what I do?\"\r\n\r\nShe rolled her eyes dramatically, \"Duh! Everyone knows! Even the profs.\" She flipped her cape dramatically, \"I want you to meet me in Vale this weekend.\" Her voice dropped to a whisper, \"And wear the maid outfit.\"\r\n\r\nJaune shuffled his feet, suddenly finding the punch in his cup utterly fascinating, \"I don't think that's a good idea, Ruby.\"\r\n\r\nRuby's face fell, her silver eyes widening in the puppy-dog look that had probably gotten her out of trouble her entire life, \"But you said anything!\" she protested, her lower lip pushing out in a pout, \"You wouldn't lie to your bestie, would you?\" Jaune felt himself weakening under her pleading gaze. His rational mind was screaming about professional boundaries, about how this was crossing a line he'd promised himself he wouldn't cross. Ruby was his friend. A good friend. The first real friend he'd made at Beacon.\r\n\r\nBut those damn silver eyes...\r\n\r\n\"Fine,\" he sighed, shoulders slumping in defeat, \"This weekend. But we're talking about this first, okay? Making sure we're on the same page about expectations and...stuff.\"\r\n\r\nRuby's face lit up, and she bounced with such enthusiasm that one of her plastic fangs popped out and clattered to the floor, \"Yay! Thank you, thank you, thank you!\" She threw her arms around him in a quick hug before darting away, probably to get the fallen tooth. Jaune watched her go with a growing sense of dread pooling in his stomach. What had he just agreed to? And more importantly, why was his life spiraling into increasingly absurd scenarios involving his friends and a maid outfit?\r\n\r\n\"I need better boundaries,\" he muttered into his punch, \"And possibly a career counselor.\"\r\n\r\nAcross the room, he caught Yang giving him a suspicious look. Jaune raised his cup in mock salute, then quickly turned away. The last thing he needed was Yang thinking he was corrupting her sister - the same sister who had just hired him for what was undoubtedly going to be the most awkward session of his increasingly bizarre career. Nevermind that Yang had asked him to dress up like her not-Mom. Older siblings could be hypocrites like that.\r\n\r\nHe drained his punch, grimacing at the burn of whatever Nora had slipped into it.\r\n\r\nThe weekend was going to be interesting.\r\n\r\n[line break]\r\n\r\nSaturday arrived with the cruel inevitability of a Goodwitch combat assessment. He stood in front of his mirror, adjusting the frilly headband that had become his signature accessory, and wondered how exactly his life had led to this moment, \"Professional,\" he reminded his reflection, which looked back at him with equal parts resignation and despair, \"You're a professional.\" It wasn't like he was AGAINST screwing women for money - most days it was actually enjoyable - but his friends made it...weird. It was one thing to fuck strangers who only knew him as Juliette. It was another to do it to someone he'd have to sit across the cafateria the next day.\r\n\r\nThe maid outfit was immaculate, as always. He'd invested in higher quality material since his early days: premium Atlesian silk for the apron, breathable fabric for the dress itself, and stockings that didn't pinch his thighs after an hour of wear (his old boss was a cheapskate). If he was going to be a professional maid-for-hire, he might as well be comfortable. He'd even gotten custom heels made that supported his arches properly. He wasn't just a maid; he was a high class one.\r\n\r\nThe things he spent money on these days...\r\n\r\nAlmost an hour later, Jaune stood outside Vale Comics, the city's premier comic book store, silently questioning every life choice that had led him to this moment. He tugged self-consciously at the hem of his maid outfit, the crisp black fabric and white frills drawing more attention than he'd anticipated. The heels made him tower over the average passerby, transforming him from \"tall guy\" to \"conspicuously tall maid\" in an instant. Every click against the pavement felt like it announced his presence to the entire street.\r\n\r\nI'm a professional, he reminded himself, straightening his posture and adjusting the frilly headband perched on his blonde locks. This is just another job.\r\n\r\nExcept it wasn't. This was Ruby. Ruby Rose. The girl who got excited about weapon modifications and snorted milk through her nose when Yang told bad puns. The same girl who had somehow decided that hiring Vale's most sought-after crossdressing maid-escort was an appropriate birthday gift to herself.\r\n\r\nA whistle cut through his thoughts, followed by a distinctly feminine voice, \"Looking good, sweetie! Those legs go all the way up, don't they?\" Jaune stiffened, his cheeks burning as he pointedly stared at the store window, refusing to acknowledge the woman who'd called out to him. The catcalls had started as soon as he stopped by the store. And the strangest part? Most of them were coming from women.\r\n\r\n\"Hey honey, need help dusting any high shelves? I've got something that could use a good polish!\" Jaune's eye twitched. That one came from a middle-aged woman in a business suit, who was now giggling with her friends like they were teenagers instead of professional adults. He kept his gaze firmly fixed on a display of X-Ray and Vav comics, silently wishing he could disappear into the pages. He made a mental note to spoil himself for today.\r\n\r\n\"Work it, girl! Whoever hired you has excellent taste!\"\r\n\r\n\"Can I get your number? My apartment's a disaster!\"\r\n\r\n\"Are those real stockings? I'm digging the commitment!\"\r\n\r\nThe comments kept coming, each one more mortifying than the last. Jaune couldn't decide what was worse. The fact that he was being openly objectified on a public street, or the fact that most of these women seemed to have no idea he was a guy. Had he really gotten that good at this? Was his crossdressing so convincing that an entire demographic of Vale citizens couldn't tell the difference? The thought was simultaneously depressing and oddly validating. At least he was good at something, even if that something was looking distressingly convincing in thigh-high stockings and a frilly apron.\r\n\r\nA passing group of college-aged women slowed down as they approached, their eyes traveling up and down his form with unabashed interest, \"Excuse me,\" one of them called out, a tall brunette with glasses, \"Are you with one of those maid services? Because my roommate's birthday is coming up and-\"\r\n\r\n\"I'm waiting for someone,\" Jaune cut her off, his voice pitched higher in his 'Juliette' persona. He'd learned early on that using his normal voice while in costume just confused people. Or turned them on even more. Usually both.\r\n\r\nThe woman looked momentarily disappointed before her expression brightened, \"Well, if that doesn't work out...\" She pulled out a business card and tucked it into his apron pocket with a wink, \"Call me. We'd love to book you.\"\r\n\r\nHer friends giggled as they continued down the street, leaving Jaune to stare after them in bewilderment. Was there some kind of cultural shift he'd missed? When had maids become Vale's hottest commodity? And why were so many women suddenly interested in hiring them?\r\n\r\nA loud wolf whistle from across the street made him turn, only to see an elderly woman with a skull cane and bright blue prosthetic glasses giving him an enthusiastic thumbs-up, \"Work it, honey! These young'uns don't appreciate the classics!\"\r\n\r\nJaune groaned, checking his scroll for the fifteenth time. Ruby was late. Fifteen minutes late, to be precise. He was starting to wonder if this was some elaborate prank. Maybe Yang had put her up to this as revenge for the ban (in which case, lifetime ban, Xiao Long!). Maybe the whole thing was a setup to humiliate him, to get back at him for his newfound success.\r\n\r\nA group of women leaving a nearby cafe spotted him, and one of them elbowed her friends, pointing in his direction, \"Oh my gods, that's him! That's Juliette!\" Jaune froze as the women approached, recognition gleaming in their eyes. This was new. And concerning, \"It really is you!\" the same woman squealed, pulling out her scroll to snap a photo, \"I've been trying to book an appointment for weeks, but you're always full up!\"\r\n\r\n\"My sister hired you for her bachelorette party,\" another one chimed in, \"She said it was the best three hours of her life.\"\r\n\r\nJaune blinked rapidly, \"Uh, thank you?\" He didn't recall any bachelorette parties, but he supposed his client list had grown extensive enough that some details might blur together. Sex still felt great, of course, but the sheer amount of clients he had meant that he kinda went through the motions a lot of the time.\r\n\r\n\"Do you have any openings next month?\" another woman asked, already scrolling through her calendar, \"My birthday's coming up, and I want to treat myself.\"\r\n\r\nJust as he was contemplating making a tactical retreat, a familiar voice called out, \"Jaune! Sorry I'm late!\" Ruby was jogging toward him, dressed in her normal combat skirt and corset, her red cape billowing behind her. She looked completely ordinary. No special outfit, no indication that she was meeting someone for... services. She looked like she was there for a casual hangout between friends.\r\n\r\nBefore Jaune could process, before he could even begin to formulate the many, many questions churning in his mind, Ruby reached him. With the cheerful obliviousness that was so characteristically her, she wrapped her arms around his left one and began tugging him toward the store entrance, \"Come on! They just got the new limited edition Grimm Slayer variants, and I want to grab one before they sell out!\" She completely ignored the women around him.\r\n\r\nJaune stumbled after her, his heels clicking awkwardly as he was pulled into the comic book store. He was vaguely aware of the jealous stares following them; women on the street shooting daggers at Ruby for commandeering the tall, attractive maid they'd been openly admiring.\r\n\r\nAs the door swung shut behind them, cutting off the sounds of the street, Jaune couldn't shake the sinking feeling in his gut. What exactly had he gotten himself into?\r\n\r\nThe comic book store was surprisingly busy for a Saturday afternoon. Jaune followed Ruby inside, bracing himself for the inevitable stares and whispers. Sure enough, several customers did double-takes, a few scrolls were raised to snap discreet photos, and the clerk behind the counter nearly dropped the stack of comics he was sorting.\r\n\r\nBut Ruby, bless her heart, didn't seem to notice any of it. She bounced straight to the new releases section, pulling Jaune along by the arm, \"Okay, so I've been waiting for the new Red Huntress special edition to come out for months,\" she said excitedly, flipping through the colorful displays, \"They're doing this crossover with Captain Atlas where they fight the Vacuo Viper, and I heard they might introduce a new female character who could potentially be RH's long-lost sister!\"\r\n\r\nJaune blinked, waiting for the other shoe to drop, \"That's... why you hired me? To discuss comic books?\"\r\n\r\nRuby looked up at him with genuine confusion, \"Well, yeah! Yang never wants to talk about comics with me. She just pretends to listen while playing games on her scroll.\" She pointed to a particularly vibrant cover featuring a heroine in weirdly familiar armor, \"What do you think of the new art style? They switched artists after issue #47, and I'm not sure how I feel about X-Ray's new helmet design.\"\r\n\r\nJaune adjusted his frilly headband, glancing around at the other customers who were trying (and failing) to pretend they weren't staring at the unusual pair  a caped Huntress-in-training and a blonde in a full Vale maid outfit discussing superhero fashion choices with absolute seriousness.\r\n\r\nBut as the minutes ticked by and Ruby continued chatting enthusiastically about plot developments and character arcs, Jaune found himself oddly... relaxing? There was something almost refreshing about the normalcy of their conversation, despite the absurdity of his attire.\r\n\r\n\"Wait, so you think the Achieve Men are going to make a cameo?\" he asked, genuinely interested now as he flipped through the latest issue, \"That would be pretty cool. They could do a musical number during the big fight scene.\"\r\n\r\n\"Right?!\" Ruby exclaimed, practically vibrating with excitement, \"And their superpowers could be sound-based! Imagine Mogar using his battle cry to shatter windows!\"\r\n\r\nAn hour flew by as they debated storylines, critiqued costume designs, and stacked up purchases. Ruby insisted on buying him the first volume of a series called \"The Dusty Maidens\"  a manga about combat maids who fought crime while keeping Vale's mansions spotless, \"For research,\" she'd said with a wink that was probably supposed to be sly but looked more like she had something in her eye.\r\n\r\nNot once did she make any suggestive comments. No lingering touches. No uncomfortable propositions. Just... comic books.\r\n\r\n\"This is actually kind of nice,\" Jaune said to himself as they exited the store, bags of comics in hand. He'd been so tense about what Ruby might expect from him that he hadn't considered the possibility that she just wanted company.\r\n\r\nHis relief was short-lived.\r\n\r\n\"Next stop!\" Ruby announced, pointing dramatically down the street, \"Clothes shopping!\"\r\n\r\nJaune followed her gaze to \"Charlotte's Boutique,\" a distinctly feminine clothing store with mannequins in flowing dresses and glittering accessories displayed in the windows, \"Uh, Ruby? That's a women's clothing store.\"\r\n\r\nRuby nodded enthusiastically, \"Yep! Now come on, we're burning daylight!\" She grabbed his arm again, tugging him toward the shop.\r\n\r\n\"Wait, wait, wait,\" Jaune protested, heels skidding slightly against the pavement, \"I'm already in a maid outfit. What more clothing do you want me to try on?\"\r\n\r\n\"All sorts of things! I've got ideas!\" Ruby declared, unperturbed by his resistance, \"Don't worry about the cost. I've been saving up my mission stipends for months! I can afford it!\"\r\n\r\n\"The cost isn't really the issue here-\" Jaune said, but Ruby had already pulled him through the boutique's entrance, triggering a delicate chime that announced their arrival to the shop attendants.\r\n\r\nA sharply dressed saleswoman approached them, her professional smile only faltering for a brief moment at the sight of Jaune in his maid attire, \"Welcome to Charlotte's Boutique,\" she greeted smoothly, \"How can I assist you today?\"\r\n\r\nBefore Jaune could formulate a response, Ruby jumped in, \"We need outfits for my friend Julie here! Lots of them. Different styles. Maybe start with something casual and work our way up to formal wear?\" Did she just call him Julie?\r\n\r\n\"Certainly,\" the saleswoman replied, eyeing Jaune with an appraising look of someone calculating measurements, \"Did you have any particular styles in mind?\"\r\n\r\n\"I was thinking we could start with a nice summer dress? Something with flowers, maybe?\" Ruby said , browsing through a nearby rack, \"Oh! And definitely some combat skirts like mine. Julie is super active. She's a Huntress-in-training, you know!\"\r\n\r\n\"I'm not really a-\"\r\n\r\n\"And maybe some professional attire?\" Ruby continued, undeterred, \"Like, business casual? For meetings and stuff?\"\r\n\r\nThe saleswoman nodded, already pulling items from various displays, \"We just received our fall collection. There's a lovely blouse and pencil skirt combination that would complement your friend's coloring.\"\r\n\r\nJaune stood there, bemused, as the two women began assembling an impromptu wardrobe for \"Julie.\" This was... not what he had expected. At all. He was used to his clients having specific outfits in mind. Usually just the one, and typically involving either less fabric or more fetish elements than his standard maid uniform. And that's if they weren't telling him to just hike up his skirt and fuck them like naughty masters (their words, not his)\r\n\r\nBut Ruby was acting like this was a normal shopping trip with a girlfriend. She held up a pale blue sundress, beaming, \"This would look so cute on you! The color really brings out your eyes!\"\r\n\r\n\"Ruby,\" Jaune whispered urgently, leaning down to her level as the saleswoman wandered off to find more options, \"What exactly is happening right now? Why are you doing this?\"\r\n\r\nRuby blinked at him, her silver eyes wide with what appeared to be genuine confusion, \"What do you mean? We're shopping! It's fun!\"\r\n\r\n\"But why did you hire me for this? I'm not usually paid to... try on sundresses and discuss comic books.\"\r\n\r\nRuby shifted slightly, a faint blush coloring her cheeks, \"Well, I mean, everyone says you charge a lot for your time, and I wanted to hang out with you, and Yang said if I wanted guaranteed time with you I should hire you because you're super busy these days, and-\" She took a breath, \"Is that not okay? Am I doing it wrong?\"\r\n\r\nJaune stared at her, utterly perplexed. The itching feeling at the back of his head intensified. Something was definitely off here, but he couldn't quite pinpoint what. She wasn't being entirely truthful about how she just wanted to hang out with him after weeks of being busy.\r\n\r\n\"Here we are!\" The saleswoman returned, arms laden with garments in various colors and styles, \"Let's start with these, shall we? The changing rooms are right this way.\"\r\n\r\nRuby bounced excitedly, all hesitation gone, \"This is going to be so great! Like having a life-sized dress-up doll!\" As Jaune was shepherded toward the changing rooms, an armful of feminine clothing clutched against his chest, he couldn't shake the sinking feeling in his gut. This wasn't normal client behavior  not even close  but it also wasn't... bad? Just deeply, profoundly weird, \"Remember to show me each outfit!\" Ruby called after him, \"I want to see everything!\"\r\n\r\nJaune sighed as he closed the changing room door behind him. Somehow, this was simultaneously better and stranger than what he'd been expecting. At least she wasn't asking him to roleplay as her mom, sister, dad, or uncle.\r\n\r\n...Yet.\r\n\r\n[line break]\r\n\r\nThe shopping trip ended with Jaune carrying several bags of women's clothing he had absolutely no intention of ever wearing again. Despite his protests, Ruby had insisted on paying for everything. Aa small fortune in sundresses, blouses, and at least three combat skirts in varying colors. She'd brushed off his warnings that he wouldn't wear them. It reminded him of Saphron.\r\n\r\n\"I'm starving!\" Ruby said as they exited the boutique, their arms laden with shopping bags, \"Let's get lunch!\"\r\n\r\nJaune, still trying to process what was happening, simply nodded and followed her to a nearby cafe with outdoor seating. He was grateful to finally sit down, his heels having done a number on his arches despite their custom design, \"Two strawberry milkshakes, please! And two of the deluxe burger combo!,\" Ruby said cheerfully when the waiter approached. The poor man kept glancing between the caped girl and the blonde in the maid outfit, clearly struggling to decide which of them was weirder.\r\n\r\n\"Ruby, I can order for myself,\" Jaune said once the waiter left.\r\n\r\n\"Nonsense! I hired you, remember?\" Ruby's smile was just a bit too bright, her silver eyes twinkling with something Jaune couldn't quite identify, \"Besides, everyone likes strawberry milkshakes!\"\r\n\r\nWhen their food arrived, Jaune reached for his burger, only to have Ruby swat his hand away.\r\n\r\n\"Let me,\" she said, picking up his burger and holding it out toward him, \"Open wide!\"\r\n\r\nJaune stared at her incredulously, \"You want to... feed me?\"\r\n\r\n\"That's what you do with- I mean, yesyepOpen up!\" Ruby wiggled the burger enticingly in front of his face. Reluctantly, feeling like he'd stumbled into some bizarre alternate reality, Jaune opened his mouth. Ruby immediately shoved the burger forward with more enthusiasm than precision, causing ketchup to smear across his cheek, \"Sorry!\" she chirped, not sounding sorry at all as she dabbed at his face with a napkin, \"Just like feeding a- I mean, there we go! All better!\"\r\n\r\n\"Ruby,\" Jaune said slowly, wiping his face with his own napkin, \"What exactly is happening right now?\"\r\n\r\nBefore she could answer, a young man from a nearby table approached, eyeing Jaune with unmistakable interest. He was handsome in a generic sort of way with a face and hairstyle that reminded Jaune of someone who was cast as an extra for the popular clique.\r\n\r\n\"Hey there,\" the newcomer said, leaning against their table with practiced casualness, \"That's a really cute outfit. I like a woman who's confident enough to express herself.\"\r\n\r\nBefore Jaune could respond (with what, he wasn't entirely sure), Ruby's hand shot to her side where Crescent Rose would normally be. Finding it absent (restuarants didn't exactly like customers coming in with deadly weapons), she grabbed a butter knife instead, brandishing it with alarming enthusiasm, \"Back off, buddy!\" she said, her voice dropping to a growl that sounded like a child trying to impersonate Yang, \"Can't you see we're having quality time here?\"\r\n\r\nThe man backed away, hands raised defensively, \"Whoa, sorry! Didn't realize you two were... a thing.\"\r\n\r\n\"We're not-\" Jaune started.\r\n\r\n\"That's right, scram!\" Ruby called after him, still waving the butter knife menacingly. Once he was safely out of earshot, she turned back to Jaune with an abrupt shift in demeanor, \"You have to be careful who you talk to,\" she said, her voice suddenly dropping to what she clearly thought was a mature, worldly tone, \"There are many predators out there looking to take advantage of innocent young ma- people like yourself.\"\r\n\r\nJaune's eyebrows shot up, \"I think I can handle myself, Ruby.\"\r\n\r\n\"Oh, of course you can, sweetie,\" Ruby said, patting his hand condescendingly. Did she just call him sweetie? That sounded so... wrong coming from her, \"But the world is full of dangers that someone as...\" she paused, searching for the word, \"...pure as you might not recognize.\"\r\n\r\n\"Pure?\" Jaune repeated, choking slightly on his milkshake, \"Ruby, I literally sleep with people for money.\"\r\n\r\nRuby's cheeks flushed red, but she plowed ahead with the same determination she used when killing Grimm, \"Well, yes, but that doesn't mean you understand the complex emotional dynamics of adult relationships,\" she said, sounding like she was reciting something memorized, \"It's my responsibility to protect you from those who might exploit your... naivete.\"\r\n\r\nJaune nearly spit out his drink, \"My what? Ruby, I'm two years older than you!\"\r\n\r\n\"Age is just a number,\" Ruby replied with the all-knowing nod of someone quoting a fortune cookie, \"Maturity is what matters. Now, eat your burger before it gets cold. You need your strength.\"\r\n\r\nThe rest of lunch continued on that same bizarre track with Ruby alternating between feeding him like a toddler and dispensing worldly \"wisdom\" in a voice at least an octave lower than her natural tone. Every time Jaune tried to speak, she would cut him off with another patronizing comment or an offer of more food. Jaune was torn between feeling confused and offended. Not something he wanted to feel when thinking about Ruby, of all people.\r\n\r\nBy the time they left the cafe, Jaune was thoroughly bewildered. This wasn't just strange; it was Ruby acting like she'd learned about adult behavior exclusively from bad sitcoms.\r\n\r\nTheir final stop was the park where Ruby insisted they sit on a bench overlooking the duck pond. The afternoon sun was pleasant, at least, and Jaune was grateful for the chance to rest his feet again.\r\n\r\n\"So,\" Ruby said, turning to face him with an expectant smile, \"Did you enjoy your day?\"\r\n\r\nJaune considered the question. Despite the utter strangeness of it all, he hadn't actually had a terrible time. Weird? Absolutely. But there was something almost endearing about Ruby's enthusiasm, even if he still had no idea what was really going on. And she wasn't making him do any weird family roleplay crap, so that was a plus.\r\n\r\n\"Yeah, actually,\" he said, \"It was... different.\"\r\n\r\nRuby nodded, her smile softening, \"I'm so glad. I've been worried about you, you know.\"\r\n\r\n\"Worried about me? Why?\"\r\n\r\n\"This big, bad world,\" Ruby said, gesturing vaguely around them, \"All these people trying to get a piece of you. Men, women; they all just want to use you for your body!\" Jaune blinked at the shift in her tone. Where exactly was this going? Ruby cleared her throat, her expression turning serious, \"Julie, I think it's time we had... a talk.\"\r\n\r\n\"A talk...?\"\r\n\r\n\"Yes. About...\" She lowered her voice to a dramatic whisper, \"The birds and the bees.\" Jaune stared at her blankly, waiting for the punchline. None came, \"You see,\" Ruby continued, her face flushed but determined, \"When two people care about each other very much, one of them might want to... load their ammo into the other's chamber.\"\r\n\r\n\"Ruby-\"\r\n\r\n\"It's like with Crescent Rose,\" she pressed on, apparently committed to this insanity, \"First, you have to make sure the barrel is clean and properly oiled. Then, you insert the magazine firmly but gently. You don't want to jam it or force it, or you might damage the mechanism.\"\r\n\r\n\"Ruby, seriously-\"\r\n\r\n\"And sometimes,\" she continued, her voice rising slightly in pitch despite her attempt to sound mature, \"You might want to fire multiple rounds in quick succession, but you have to be careful not to overheat the-\"\r\n\r\n\"I KNOW WHAT SEX IS!\" Jaune shouted, loud enough to startle a nearby flock of pigeons into flight, \"Ruby, I literally get paid for it! It's my literal job! I don't need the... the gun analogy version of 'the talk' from you!\"\r\n\r\nSeveral park-goers turned to stare at them. Jaune felt his face burning with embarrassment, \"Why are you acting so weird today?!\" he said, lowering his voice to a hiss, \"The feeding, the shopping, the... whatever this is? What's going on?!\"\r\n\r\nRuby played with the hem of her cape, suddenly looking much younger than her eighteen years, \"I don't know what you mean,\" she mumbled, not meeting his eyes.\r\n\r\n\"Yes, you do. This whole day has been bizarre. You hired me, which made me think you wanted...\" He gestured vaguely, \"But then you're treating me like I'm five years old while simultaneously trying to act like you're forty? What gives?\"\r\n\r\nRuby's shuffled her feet for a few more seconds before she sighed, \"Okay, fine!\" she said , throwing her hands up, \"I just wanted to feel like the big sister for once, okay?! I'm eighteen now, but everyone still treats me like a baby just because I'm a couple years younger! Yang's always looking out for me, Weiss is always correcting me, Blake's always explaining things to me...\" She took a deep breath, \"I thought maybe if I hired you, I could show what a totally mature adult I am by taking care of someone else for a change!\"\r\n\r\nJaune stared at her flatly, \"People usually have sex to prove they're adults in movies, you know. I would've honestly preferred if we just did that.\" It wasn't exactly an offer, but it was close enough that Yang or Weiss would've taken it as one.\r\n\r\nRuby laughed, waving her hand dismissively, \"Hah, no way! Sleeping with you would be weird! You're like my first ever guy bestie!\"\r\n\r\n\"And making your guy friend dress up in a maid outfit so you can play big sister isn't weird?\"\r\n\r\nShe considered this for a moment, head tilted thoughtfully, \"Not really,\" she decided, \"I mean, you already dress up anyway, right? This way, we both get what we want!\" Jaune blinked slowly, processing her logic. Sex with a guy friend? Weird. Having that guy friend dress up as a maid so you could play big sis? Perfectly normal.\r\n\r\nWithout a word, he stood up from the bench, smoothed down his apron, and began walking away.\r\n\r\n\"Hey, wait!\" Ruby called after him, scrambling to her feet, \"The day isn't over yet! I was going to give you your first gun!\"\r\n\r\nJaune just kept walking, his heels clicking rhythmically against the pavement as he steadfastly ignored her continued calls. Some things, he decided, were simply beyond explanation. And Ruby Rose's idea of \"adult behavior\" was definitely one of them. Behind him, Ruby was still shouting something about proper trigger discipline, but Jaune had already mentally checked out. He'd have to update his website again.\r\n\r\nNO FAMILY ROLEPLAY. NO SISTER-FOR-A-DAY SCENARIOS.\r\n\r\nAnd maybe, just maybe, it was time to start charging his friends double. A friend and family spitecount.\r\n\r\n[line break]\r\n\r\nThe walk back to Beacon was a blur. Jaune had ditched the heels halfway through, carrying them in one hand while padding along in his stockinged feet. The stone path was cool beneath his soles, a small mercy after the day he'd endured.\r\n\r\nSomewhere between the park and the airship station, he realized he'd left all those shopping bags - hundreds of lien worth of clothing he'd never wear - sitting abandoned on the park bench. The thought flickered through his mind for approximately two seconds before dissolving into complete apathy. Let Ruby keep her \"big sister\" souvenirs. He was done. If someone wanted to steal a bunch of women's clothing sized for a 6'1 guy with broad shoulders, they were welcome to it.\r\n\r\nThe evening air was cool against his face as he trudged up the path toward the dormitories. A few students gave him double-takes as he passed, but Jaune was far beyond caring at this point. The Beacon rumor mill had long since established that Jaune Arc moonlighted as \"Juliette\", and anyone who hadn't heard was clearly living under a rock.\r\n\r\nHe didn't even bother changing before returning to his dorm. What was the point? Team CRDL had already seen him in the outfit more times than he cared to count, Professor Port had once given him a wink and a thumbs-up in the hallway, and even Professor Goodwitch had taken to ignoring his maid-clad presence with a practiced air of professional detachment (though he didn't miss the way she gave him the occasional once-over).\r\n\r\nBy the time he reached his room, Jaune felt like he'd aged several decades in a single day. He pushed open the door with a weary sigh, prepared to collapse face-first onto his bed and possibly remain there until graduation.\r\n\r\nHe stepped inside, already reaching for his headband to remove it. Pyrrha was sitting alone on her bed, a textbook open beside her but clearly forgotten. She looked up as he entered, her emerald eyes widening slightly at his appearance before her cheeks flushed pink. She shifted on the mattress, looking uncharacteristically nervous, \"Oh! Jaune,\" she said, her voice a bit higher than usual, \"You're back. How was your... appointment?\"\r\n\r\nHe closed the door behind him with a weary sigh, \"Don't ask. Ruby decided she wanted to play 'big sister' for a day. There were gun analogies for sex talks. It was weird.\" He brought a hand across his hair and shook his head, the hair extensions swinging. Usually, he changed into and out of his maid uniform outside of the dorm to make things less weird for his teammates. But right now, he was just way too drained to worry about that.\r\n\r\nPyrrha blinked, \"I... see.\"\r\n\r\nJaune studied her more closely. She was fidgeting with the edge of her skirt, a slight sheen of sweat visible on her forehead. Her leg was bouncing slightly, a nervous habit she usually kept under control. Something was definitely up, \"Are you okay?\" he asked, frowning in concern, \"You seem tense.\"\r\n\r\nPyrrha let out a small, awkward laugh, \"Me? I'm fine! Perfect, actually. Just... studying. Very intensely.\"\r\n\r\nJaune's brows furrowed. After a day of dealing with Ruby's bizarre behavior, he was getting pretty good at spotting when something was off. He glanced at Pyrrha's textbook. It was upside down, \"Bad day?\" He smiled sympathetically, setting his scroll down on his desk, \"You look stressed.\"\r\n\r\nPyrrha bit her lip, her eyes darting away from his, \"I suppose I am a bit... on edge.\" Jaune nodded. After everything they'd been through together, he could read Pyrrha pretty well. This was familiar territory, at least. Not like whatever fever dream his day with Ruby had been.\r\n\r\n\"Do you want some stress relief?\" he asked, already reaching for the bow on his apron. This, at least, made sense to him.\r\n\r\nPyrrha looked like she wanted to say something. Her mouth opened slightly, her brow furrowed as if wrestling with some internal debate. For a moment, Jaune thought she might actually decline because once a day (sometimes twice) for the past week was too much.\r\n\r\nThen she exhaled softly, her shoulders relaxing as she nodded, \"Yes, please.\"\r\n\r\nJaune felt a weight lift from his shoulders. This, he understood. This was simple. Uncomplicated. Just helping his partner unwind after a stressful day, no weird family roleplay or forced attempts at adulthood required.\r\n\r\n\"Finally,\" he muttered to himself as he untied his apron, \"Something normal.\" He began undoing the buttons on his maid uniform, grateful for the familiarity of the routine. After a day of being dressed up, fed like a child, lectured about \"adult relationships\" by someone who clearly learned about them from weapon manuals, and nearly given a firearm as a coming-of-age present, the simple act of helping Pyrrha de-stress felt like an oasis of sanity.\r\n\r\nPyrrha eyed him the entire time. Probably that tournament fighter in her. She told him once that she was hardwired to look at people's muscles to see their shifts in movement. That was why she couldn't stop staring at him whenever he changed.\r\n\r\n\"Gods,\" He sighed as he shimmied out of the skirt, leaving the thigh-high stockings in place (Pyrrha mentioned once that she liked how they looked), \"Why can't everyone else just be normal about this stuff? It doesn't have to be weird.\" Pyrrha made a small noise that might have been agreement, her eyes never leaving his body, \"I mean,\" Jaune continued, tossing the dress aside, \"We're just partners helping each other out. No pretending I'm someone's mother or sister or whatever. Just... straightforward stress relief between friends.\"\r\n\r\n\"Right,\" Pyrrha murmured, her voice soft, \"Just... friends.\"\r\n\r\nJaune climbed onto the bed over Pyrrha, his mind already settling into the comfortable routine of what had become, ironically, the most normal part of his increasingly bizarre life. Just two partners, helping each other out. Nothing weird about that at all.\r\n\r\n[line break]\r\n\r\nPoor Jaune. And Pyrrha. And Ruby who spent a lot of money on those clothes Jaune just ditched.\r\n\r\nLikely back to smut next chapter, I just don't know who yet. Cinder? Goodwitch? Blake? Someone else?"
    },
    {
      "title": "Chapter 6",
      "text": "Maid Jaune 6. I'm VERY sorry for the gap. Like I said in the status update, sickness and business thing. Most of my family went abroad as well, so that's a thing. I'll be writing my next output (Mr and Mrs. Arc-Schnee) quicker. Lack of smut makes it easier.\r\n\r\nAnyway, this chapter is a nice change of pace for me since Jaune's not acting like he hates his job. Glynda provided some refreshing content.\r\n\r\n[line break]\r\n\r\nA couple of days later, Jaune found himself contemplating his life choices yet again. This had become something of a daily ritual for him  wake up, train, attend classes, and wonder exactly how he'd gone from \"farm boy with a dream\" to \"Vale's most notorious crossdressing maid-for-hire.\" Today, however, the existential crisis hit a bit differently.\r\n\r\nBecause today, he had an appointment with Professor Glynda Goodwitch.\r\n\r\nProfessor Goodwitch. Beacon's deputy headmistress. The woman who could reduce fourth-year students and politicans to tears with a single raised eyebrow. The same woman who had once made Cardin wet himself during a particularly brutal detention session (a story that would never die, much to Cardin's continued humiliation). There were rumors that the Vytal Tournament only took place every two years because she'd won every year back when she was a student and they wanted to give everyone else a chance.\r\n\r\nAnd now she'd officially booked him.\r\n\r\nJaune gulped nervously as he stood outside her office, the familiar wooden door somehow looking far more intimidating than usual. He'd been here a few times before, of course, whenever his combat performance dipped below acceptable levels  which, given his falsified transcripts and complete lack of formal training, was embarrassingly often.\r\n\r\nBut he'd never stood here wearing his (custom-tailored) maid outfit. The silk felt unusually tight against his skin, the collar itchy despite its premium material. He adjusted the frilly headband, ensuring it sat perfectly on his blonde locks, and straightened the apron with shaking hands. His heels clicked against the floor as he shifted his weight from one foot to the other, trying to dispel the nervous energy coursing through him.\r\n\r\nHe felt a strange mix of nervousness and, as much as he didn't want to admit it, excitement. Aside from the weirdos  Ruby's bizarre big sister fantasy still gave him shivers  there was really only one reason women took his services. He didn't exactly make it a secret what he did, and the thought that Professor Goodwitch wanted that was... well, it was enough to make his heart (and other places) pulse. He pressed down his blouse to keep it from rising.\r\n\r\nThe woman was the archetypal Hot Teacher and Sexy Librarian rolled into one. Her fitted blouse, that pencil skirt, and those glasses that somehow made her stern glare even more intimidating. Every male student at Beacon had fantasized about her at least once; it was practically a rite of passage. Even Ren, the most composed person Jaune knew, had once mumbled her name in his sleep, which Nora did NOT take well.\r\n\r\nJaune took another deep breath, trying to calm his racing heart. This was just another job, he reminded himself. Just because it was Professor Goodwitch didn't make it any different from his other clients. He was a professional, damn it. A professional maid-escort with a growing investment portfolio and a custom weapon upgrade that would make Ruby drool (if she were still speaking to him, which she wasn't).\r\n\r\nHe smoothed down his skirt one final time, then raised his hand and knocked on the door, \"Mistress?\" he called out in his practiced 'Juliette' voice, high-pitched and demure, \"It's Juliette. I'm here for our appointment.\"\r\n\r\nThere was a moment of silence from the other side of the door. Then, Professor Goodwitch's crisp, authoritative voice responded, \"Come in.\"\r\n\r\nJaune took a deep breath, steadying himself. He reached for the doorknob, turned it, and pushed the door open.\r\n\r\nHe stepped inside with a nervous gulp. He'd been in the office before, but doing it in this outfit was surreal. The same old bookshelves crammed with dusty academic crap and combat manuals looked way more intimidating now that he was sporting frills and stockings. Professor Goodwitch sat at her desk, back straight as a board, her blonde hair yanked back in that crazy-tight bun that seriously, how did she not get headaches? She looked up at him without so much as a raised eyebrow, like seeing a guy in a full maid getup was totally normal for a Tuesday afternoon.\r\n\r\nJaune readied himself. His brain had already cooked up about a dozen different scenarios, each one more crazy than the last. Maybe she had some weird authority kink? Or wanted to play strict headmistress while he was the naughty student? Brothers, he hoped it wasn't another \"detention\" roleplay. The last client who tried that had him writing \"I will not be a bad maid\" on a chalkboard for three freaking hours. His wrist had felt like it was gonna fall off. The sex felt more exhausting than anything.\r\n\r\nBut instead of any of that, Professor Goodwitch just pointed to another desk shoved in the corner of her office. It was buried under a mountain of paperwork  forms, reports, and what looked like enough detention slips to wallpaper team RWBY's dorm room, all stacked in neat but terrifying piles, \"Your first task,\" Professor Goodwitch said, sounding like she was reading off a grocery list, \"is to sort through these forms. They need to be organized by type, date, and priority level. Once that's done, I'll need you to input the data into the system.\"\r\n\r\nJaune blinked.\r\n\r\n\"I... come again?\"\r\n\r\nProfessor Goodwitch adjusted her glasses, the light doing that anime villain thing where you couldn't see her eyes for a second, \"Your website indicated that you were skilled in administrative duties,\" she said, talking to him like he was five years old, \"I have paperwork that needs to be completed, and my usual assistant is out with Dust poisoning after an unfortunate incident in Professor Peach's class.\"\r\n\r\nJaune blinked again, harder this time, like maybe his eyeballs could reboot his brain, \"I... yeah, I am,\" he found himself saying. It wasn't even a lie. Growing up with seven sisters meant he'd always gotten stuck with the boring crap nobody else wanted to do. He'd done tons of paperwork for the family wine business, keeping track of inventory and shipments while his sisters got to do all the fun stuff with actual customers.\r\n\r\nProfessor Goodwitch nodded, her face softening about half a millimeter, \"Good. Get to it, then.\" She turned back to her own work before adding, like it was totally an afterthought, \"Oh, and I'll be expecting you to serve tea occasionally, but the paperwork is the priority here.\"\r\n\r\nJaune just stood there like an idiot for a moment, his brain still buffering. This was what Professor Goodwitch had hired him for? Paperwork and pouring tea? Not... you know... the other stuff? He'd worn his best stockings and everything! The ones that cost more than his first training sword!\r\n\r\n\"Is there a problem, Mr. Arc?\" Professor Goodwitch asked without looking up, her pen scratching away like she was trying to stab the paper.\r\n\r\n\"Nope! No problem at all, Professor,\" Jaune replied quickly, shuffling over to the desk in the corner. His skirt swished around his thighs in a way that would've had his regular clients practically drooling. Professor Goodwitch didn't even bother to glance up.\r\n\r\nHe dropped into the chair, which creaked under his weight like it was judging him. This was... weird. Super weird. Even weirder than Ruby trying to play \"big sister,\" which was really saying something.\r\n\r\nAs he started sorting through the first stack of papers, Jaune's mind raced. Maybe this was just foreplay? Maybe Professor Goodwitch was testing him, making sure he could follow directions before moving on to the fun stuff? He'd had clients who got off on bossing him around first, making him do random crap before getting down to business. Weiss literally made him clean the hotel room once and ignored him when he pointed out that there's people whose actual job that was.\r\n\r\nBut as the minutes ticked by and Professor Goodwitch just kept working in total silence, completely ignoring the fact that there was a dude in a maid outfit sitting in her office, Jaune got more and more confused. If she'd wanted someone to file paperwork, why hire the guy known across Vale for his \"special maid services\"? The outfit alone seemed like major overkill for sorting detention slips.\r\n\r\nHe mindlessly flipped through a stack of incident reports, his thoughts wandering. The last time he'd been in this office, Professor Goodwitch had been chewing him out for getting his butt handed to him by Russel. She'd been tough but fair, those green eyes drilling into him behind her glasses as she'd laid out exactly how his crappy form had screwed him over. She hadn't even been that hars, not like when she tore into students with potential who slacked off; like Yang during her \"can't be bothered\" phases.\r\n\r\nYang had said once, after way too many drinks at a team hangout, that she found Professor Goodwitch's strictness \"kind of hot, not gonna lie.\" Blake had rolled her eyes, but Jaune had caught the telltale blush that said she was totally on the same page. Even Weiss, Miss Prim and Proper herself, was busted staring at Professor Goodwitch's riding crop for way too long during class.\r\n\r\nThat same riding crop was just chilling on the edge of Professor Goodwitch's desk, like it wasn't the star of half the student body's fantasies. Jaune couldn't help glancing at it every few minutes, his collar suddenly feeling way too tight. He remembered again how Ren  calm, collected Ren  had mumbled Professor Goodwitch's name in his sleep once, which led to Nora \"accidentally\" dumping a full glass of ice water on his face at 3 AM. The shouting match that followed kept him and Pyrrha up for an hour, with Nora insisting that Ren was \"having dirty thoughts about the enemy\" while Ren stammered out excuses that got more ridiculous by the second.\r\n\r\nThe memory made Jaune smile despite his confusion. He turned his attention back to the paperwork, figuring he might as well go with it. Maybe Professor Goodwitch really did just need office help. Maybe she thought his prices were fair for the quality of his work. Maybe this wasn't just another chapter in the weird-ass story his life had become.\r\n\r\n[line break]\r\n\r\nThree hours passed and absolutely nothing happened besides mind-numbing paperwork. Jaune's fingers were starting to cramp from filling out form after form, and his eyes burned from squinting at tiny print detailing the many, many ways Beacon students had managed to break school property.\r\n\r\nSeriously, who even tries to use a Boarbatusk as a mount? Nora, of course. Team RWBY had their own filing system with the damage they did. He had no idea how the school wasn't bankrupt or how they hadn't gotten expelled yet. All Professor Good said was \"Ozpin\" and nothing more.\r\n\r\nProfessor Goodwitch had asked for tea precisely once during the whole time. He'd obliged, following her instructions to the letter  two sugars, a splash of milk, steeped for exactly three minutes and thirty seconds. Another skill he'd perfected growing up with seven sisters: how to make the perfect cup of tea for princess-themed tea parties. Saphron had been particularly picky, insisting her tea be \"royal quality\" or she'd make him play the dragon instead of the knight.\r\n\r\n\"Thank you, Mr. Arc,\" Professor Goodwitch had said after taking a sip, nodding in satisfaction, \"This is perfect. I've been dealing with everyone's paperwork all week, and it's giving me a migraine.\"\r\n\r\nJaune blinked, \"Wait, aren't the other teachers supposed to do their own paperwork?\"\r\n\r\n\"Yes,\" she replied, taking another sip, \"They should.\" He waited for her to elaborate. She didn't. Just went right back to scribbling notes on some poor student's combat evaluation.\r\n\r\nThe silence stretched on for another twenty minutes. Jaune's back was starting to ache from hunching over the desk, and his butt had gone numb from sitting in the wooden chair for so long. He'd spent the last hour trying to figure out what the hell was going on. Was this some kind of test? A weird power play? Had someone pranked him?\r\n\r\nHe cracked his neck, stood up, and decided to test the waters, \"Professor, would you, uh... like a massage? Your shoulders look tense.\"\r\n\r\nProfessor Goodwitch hummed thoughtfully, then set down her pen, \"That would be lovely, actually.\"\r\n\r\nJaune hesitated for a split second before moving behind her chair. He placed his hands on her shoulders, trying desperately not to think dirty thoughts (impossible) as he began kneading the stiff muscles. Even through her blouse, he could feel how tense she was. Knots upon knots, like someone had tied sailor's rope under her skin. His thoughts drifted to what was under that blouse. Pale, flawless skin that looked like it belonged to a woman half her age. He wondered what color her bra was. Purple like her cape? Black like her skirt? Did it have lace?\r\n\r\nShe sighed softly as his thumbs worked into a particularly tight spot near her neck. (Down, Jaune Junior, down!) The sound was way too close to other, less professional noises he'd heard from clients, \"You have heavenly fingers, Mr. Arc,\" she murmured, her head lolling slightly to the side as he worked out another knot, \"Perhaps you should advertise this instead of your... main services.\"\r\n\r\nJaune laughed awkwardly, his face heating up, \"I, uh, you know... kind of figured that's what you called me for, actually,\" he admitted, \"But I was wrong, obviously.\"\r\n\r\n\"No,\" Professor Goodwitch replied, her tone so matter-of-fact she might have been discussing the weather, \"I am planning to sleep with you.\"\r\n\r\nJaune's fingers froze mid-knead, \"Pardon?\"\r\n\r\nProfessor Goodwitch didn't turn around, just rolled her shoulders slightly to prompt him to continue the massage. He did, \"Nothing turns me on more than paperwork being completed before deadlines,\" she continued in that same casual tone, \"It's a particular weakness of mine.\"\r\n\r\nJaune gulped, his mouth suddenly dry as a Vacuo summer, \"I, uh, only have one stack left,\" he said, his voice cracking like he was going through puberty all over again.\r\n\r\nProfessor Goodwitch smiled  he couldn't see it, but he could feel it somehow. (Down, Jaune Junior, damn it! This is NOT the time!) \"You'd better get to it then,\" she said, the barest hint of suggestion coloring her professional tone.\r\n\r\nJaune fucking bolted for the desk, knocking over an empty teacup in his haste. He caught it before it hit the floor, set it down with shaking hands, and dove into the final stack of papers like his life  or at least his sex life  depended on it.\r\n\r\nHe went through the paperwork like a man possessed, though he made sure to double-check everything for errors. The last thing he wanted was for the mood to be ruined because he made a typo or something. Professor Goodwitch didn't say a word, but he could see her occassionally looking up with a twinkle in those green eyes. That was the look of a woman who knew exactly how hot she was and what she was offering.\r\n\r\nThe last paper was practically slammed down into the 'Done' pile, \"D-Done, mistress!\" Jaune said, his voice high once more with the Juliette lilt. Sex had turned from something he craved to... well, a job. He didn't hate it, but he was often more focused on what his clients wanted more than anything else. His enjoyment was secondary, even if the sex still felt good most of the time (when weirdos like Weiss and Yang weren't making him dress up for weird pseudo-incest fantasies).\r\n\r\nBut now? Pure excitement. Because this was Glynda Goodwitch he was about to sleep with. His cock stirred underneath the skirt and he bit his lower lip. Even if she spent the whole time whipping him with her riding crop, he would've said thank you and asked for seconds.\r\n\r\n\"I'll need to check to be sure, Juliette.\" The sudden change in name made him feel weird. Not a bad weird, though, \"In the meantime, make yourself useful.\"\r\n\r\nShe pushed her chair back and pointed to the (generous) space under the desk. Jaune gulped and slowly walked forward. Her casual dominance made him lightheaded. It wasn't like with Weiss, where she was clearly trying too hard to throw her (tiny) weight around. Professor Goodwitch was raw confidence. She didn't raise her voice or stomp her feet to make demands. She ordered and he obeyed. He was suddenly reminded of Saphron saying she always loved a woman who could fucking kill her.\r\n\r\nJaune crawled inside the space, which was big enough to hold even someone of his size. The wall behind him kept him safely out of sight, \"I'm in,\" he called out. Professor Goodwitch hummed and slid her chair closer, her legs parting. Jaune's breath hitched.\r\n\r\nShe wasn't wearing underwear.\r\n\r\nHe'd seen dozens of, ahem, lady parts before. Weiss, Yang, Pyrrha, and dozens of his clients. Back then, he'd been downright excited...even if half the time it ended up being weird. Weiss with her weird bratty dom thing and sister fetish. Yang with her mom fetish. Pyrrha not just asking him for sex like a normal partner before carrying him out of the maid cafe over her shoulder like some desperate cavewoman. That wasn't even getting into the bizarre crap half of his other clients were into. It was like regular sex was some kind of taboo thing to not even be considered.\r\n\r\nJaune gulped and traced his fingers along her thick, smooth thighs, \"How should I...?\"\r\n\r\n\"They're stockings, Juliette. They aren't body armor.\"\r\n\r\nThe implicit order was clear. Gulping again, Jaune reached out - gods, her skin was warm - and tore the stockings. The sounds of tearing fabric seemed to echo across the room. The smell of her perfume (lilacs) mixed with the faint tang of sweat made him feel lightheaded. He breathed in deep, taking in the smell. Professor Goodwitch always had a flawless quality about her. Never a hair out of place, not a wrinkle in her clothes and glasses always balanced. It was almost inhuman.\r\n\r\nBut right now she looked very, very human.\r\n\r\nJaune shuffled forward and licked his lips. This was really happening. He could feel the collective resentment and jealousy of every guy in Beacon, hundreds of collective male fantasies crying out in resentment, \"Here I go, mistress.\" She didn't say anything, but he legs spread just an inch more in invitation. Jaune grabbed his thighs with both hands and leaned his head down.\r\n\r\nUnlike his first time with Weiss, he didn't lick haphazardly like someone sucking on an ice cream cone. He started off slowly at first, his tongue gently sliding across her slit. He'd done this at least a dozen times before. Mistral clients in particular - usually nobility - seemed to love it. High-class ladies who only had to \"lay back and think of Atlas\" found a thrill in making someone work for their pleasure for a change.\r\n\r\nHe did make sure not to take clients who were currently married or didn't have \"arrangements\" (which was disturbingly common) with their husbands, though. Last thing he needed some some angry cuckold trying to kill him.\r\n\r\nProfessor Goodwitch let out a soft, pleased breath. It wasn't a moan, but coming from her, it might as well have been. Jaune felt a tingle of satisfaction go down his spine and he slowly picked up the pace. Not too fast - he'd made that mistake before - but slowly winding up. His eyes flicked up to the hooded clitoris. Not yet, he thought. Too soon and he'd end it too quick.\r\n\r\nJaune's hands tightened their hold slightly on her thighs as he continued. The sounds of the keyboard clicking above him made the whole thing seem oddly mundane. Jaune continued trying to please her. ignoring how cramped the space was and how his knees were getting kind of sore (Pyrrha was teaching him about dealing with muscle fatigue with Aura in-between their stress relief sessions). Logically, he knew being kept under the desk like some dirty little secret wasn't that different from some of the other things he griped about, but he found himself not minding.\r\n\r\nHe was just about to move up when he heard the door open.\r\n\r\n\"Ms. Schnee, please come in,\" Professor Goodwitch said, calm as can be. Like she didn't have one of her students going down on her underneath her desk. Jaune froze and debated pulling back when Professor Goodwitch's legs wrapped around him. The message was clear: don't go anywhere.\r\n\r\n\"Professor,\" Weiss' prim and proper voice greeted back, \"I... assume this is about the incident in today's combat class.\"\r\n\r\n\"Exactly so.\" Professor Goodwitch pulled him even closer, his face pressed against her snatch. The intoxicating smell was overwhelming now, \"You've been acting particularly aggressive during sparring matches. This isn't like you, Ms. Schnee.\"\r\n\r\n\"I... that is...\" He could practically see Weiss shuffling from one foot to another, \"I've been... frustrated in recent days, professor. My apologies.\"\r\n\r\n\"Would that be because of your conflict with Mr. Arc?\" Her right hand reached down and patted his head. Jaune back to lick again, clumsier this time but still eager to please. If Professor Goodwitch showed any signs that she was being eaten out, then Weiss didn't notice.\r\n\r\n\"That's not-\" Weiss took a deep breath, \"That is, I apologize for my behavior. Juli- uh, Jaune has been difficult.\" Despite the situation, Jaune almost rolled his eyes. He was being difficult? Says the woman trying to get freebies from an old crush (that he didn't have anymore) because she wanted to get her rocks off making him play the naughty Faunus maid. Seriously, it was either she secretly wanted to fuck her sister or Blake. There was no in-between.\r\n\r\n...Well, except for when she was clearly angling to have him put on a black wig with red tips. Thankfully, daddy Schnee cut her off before then.\r\n\r\n\"Difficult. I see.\" Professor Goodwitch gripped his head. Not enough to hurt, but enough to remind him (as if he needed it) that she had total control, \"Would you like me to call Mr. Arc here so you two could resolve your differences?\"\r\n\r\n\"No! I mean-\" Weiss stuttered for an explanation, \"It's nothing that deserves your personal attention, professor. I... I lost my cool. I was frustrated and lashed out. It was wrong and I won't do it again.\"\r\n\r\n\"Hm. Mr. Arc must've frustrated you dearly.\" She moved his head up, nose practically adhered to her muff. She was leading him to her clit, which was slowly coming out of its hood. Jaune moved with the training of someone who'd done this dozens of times before. Tentative licks first to ease her into it. No biting and sucking, at least not yet. Even if some suicidal part of him was tempted to bite down and make Goodwitch squeal in front of Weiss.\r\n\r\n\"Yes. It's been...difficult since our disagreement.\" This time he did roll his eyes. Nice way to say 'Daddy cut my allowance and now I can't afford my fetishes', \"But again, it doesn't justify my poor behavior. I'll make sure to control myself better in the future.\"\r\n\r\n\"See that you do.\" Her clit was out in full now, and despite Jaune's ministrations, she sounded completely calm. Jaune began to gently suck on the nub, some part of him almost hoping Goodwitch's voice would stutter even just a bit, \"I'm sure Juliette would be disappointed to hear her mistress is acting out.\"\r\n\r\nThe air in the room seemed to drop 10 degrees. Jaune stopped eating the professor out before a quick tug on his hair silently ordered him to keep going. At the same time, he heard Weiss gasp, \"Wh-What did you say?\"\r\n\r\n\"I said that Mr. Arc would be saddened if he thought he was responsible for any poor behavior,\" Goodwitch said. She sounded so damn confident that he almost believed her, \"I thought you were getting along better ever since he stopped his rather crude flirtations. Or was I mistaken?\"\r\n\r\n\"Julie- JAUNE and I have been getting along... better, yes.\" Weiss sounded like she wanted to be anywhere but here. He couldn't blame her, \"I... is there anything else, professor? If not, I really should be going now. Train more.\"\r\n\r\n\"Yes, I'm sure you'd like that. Perhaps you should train with Mr. Arc in the future. I understand he's been refining his technique.\" He sucked particularly hard on her clit and felt a little burst of satisfaction when she let out a soft breath. Not enough for Weiss to notice, but he did.\r\n\r\n\"I'll... take that under advisement. Th-Thank you, professor.\" Weiss turned on her fancy high heel and left, each step echoing against the carpet.\r\n\r\nIt was only when the door finally clicked shut again that Jaune finally released a breath he didn't realize he was holding. Goodwitch's grip on his hair loosened and she murmured, \"Good boy.\" Something about those two words made him snap. He sucked and bit at her clit in a frenzy, desperate to make her lose her cool. One moan, one little muffled cry. Something.\r\n\r\nInstead, she just gave that pleased hum like she'd seen a particularly good research paper, \"Someone's eager,\" she murmured, laughing under her breath, \"Why not take care of yourself while you're down there? I still have a little bit to go.\"\r\n\r\nIt wasn't an order, it wasn't even a demand, but Glynda Goodwitch had a way of making people listen. His right hand fumbled for his skirt and he reached under it and through the silk underwear (so he was thorough, sue him) to grab at his rock-hard dick. He'd been hard ever since she spread her legs, but he kept himself from getting handsy by remembering his work. The client's needs came first, even if he (rightfully) complained when his friends got him into some weird shit.\r\n\r\nHis jerking was clumsy, which wasn't helped by his position and the fact that he was still focused on eating her out. While his hand jerked across his length with a shaky fist, his mouth and tongue were practically glued to Goodwitch's slit. Her cunt was wet not just from his own fluids but from her obvious arousal, even though she kept typing up above like she didn't even notice. It was a challenge now. He wanted her to slip just once, gods damn it.\r\n\r\nUp and down his hand went, his cock slick with his sweat and pre. He closed his eyes and imagined Weiss standing in front of Goodwitch's table again. The thought of her being there while he was eating out the deputy headmistress made his skin tingle in ways he couldn't explain. So far, he'd avoided any exhibitionist fantasies. Some of his clients definitely wanted it (and were willing to pay quadruple digits), but the thought of being caught ass-naked in a park bush kept him from accepting.\r\n\r\nBut now, the thought of being caught - even pushing Goodwitch to slip and make it obvious to Weiss - made his gut burn with want.\r\n\r\n\"I must say, while your combat skills are still a work in progress, your other talents are... satisfactory.\" The brief pause sent a pleasurable tingle down his spine. She still soundeded calm as can be, but he noticed how her fingers stopped typing for ten seconds. Ten seconds of her trying to balance herself, \"Perhaps I should make this a repeat arrangement. I just finished double checking your paperwork. Some minor typos and mistakes, but easily rectified in minutes.\"\r\n\r\nJaune felt a burst of irritation. Was she seriously talking about paperwork right now? This was-\r\n\r\n\"Of course, if you do better next time, I could... reward you. Excellent work deserves proper compensation, after all.\"\r\n\r\nPaperwork? Amazing. Love it. Already training to do better.\r\n\r\n\"I'm close, Juliette.\" Brothers, he didn't know whether to be annoyed or turned on with how casual she sounded. She'd stopped typing now, leaning back on the chair with a soft, satisfied sigh. He chanced a look up. Her face was dotted with the slightest bits of sweat and her eyes were closed. The most amazing thing was the fact that her glasses were askew. To anyone else, that might've looked normal, but for Glynda Goodwitch? It was about as normal as seeing Weiss in sweatpants. It just didn't happen.\r\n\r\nShe was rattled.\r\n\r\nHis own jerking had reached a fever pitch now. Sweat dripped down his brow as he forced himself to focus on both pleasing his mistress and bring himself to his own climax. The head of his cock was practically dripping with seed now as he imagined inserting something else besides his tongue up her quim.\r\n\r\nShe came when he gently bit down on her clit. There was no graphic moan or dramatic back arching. She let out a soft breath and gripped the armrests with (almost) controlled tightness as she released. The slighty tangy taste of her cum wasn't anything different from all the others he'd tasted before, but knowing that it was coming from the most desired woman on campus - even over Weiss, Yang, and Pyrrha - made it feel sweeter somehow.\r\n\r\nHe came himself only seconds later. He was too in the moment to even care that his semen shot out like a geyser and pelted Glynda's thighs or fell down to the floor. He froze, almost expecting to get telekinetically launched out the window. When he looked up, he found his mistress looking down at him with half-lidded eyes and an amused... well, it wasn't exactly a smile, but it was close enough. It was a look most guys in Beacon would literally kill for.\r\n\r\nJaune licked his cum-soaked lips and finally managed to find his voice, \"Was... Was that satisyfing for you, mistress?\"\r\n\r\n\"Yes, Juliette, it was.\" She pushed her chair back, finally giving him space to stand. Jaune winced at the slight feeling of stiffness on his limbs and wiped the rest of the cum off his face. His dick was already softening, but the sight in front of him made it impossible for it deflate completely. Gods, he wanted to fuck her so bad, but he reminded himself of his place here. He was the maid, he did whatever his client wanted. He couldn't push, no matter how much he wanted to.\r\n\r\nAnd he really, really wanted to...\r\n\r\nJaune wiped his mouth one more time, trying to play it cool despite the fact that his heart was still hammering like Nora after too much caffeine. He glanced up at Professor Goodwitch, who was already straightening her skirt and fixing her glasses like nothing had happened. The woman had just been eaten out under her desk while having a casual conversation with Weiss, and she looked like she'd simply finished grading papers.\r\n\r\nMeanwhile, Jaune felt like he'd just run a marathon in heels. Which, technically, he kind of had, \"So, uh...\" he started, his voice still a bit hoarse, \"Did you want to... do more?\" His eyes drifted hopefully toward the riding crop still sitting on her desk. He'd been fantasizing about that thing for months, and now seemed like the perfect opportunity to find out what Professor Goodwitch could do with it besides terrifying students into proper combat stances.\r\n\r\nProfessor Goodwitch followed his gaze and raised an eyebrow, \"I'm quite satisfied for now, thank you,\" she said, adjusting her blouse, \"Though I wouldn't say no to a foot massage. All this paperwork has me rather tense.\"\r\n\r\nJaune's face lit up. Not exactly what he'd been hoping for, but hey, touching Professor Goodwitch in any capacity was still a win in his book, \"Absolutely! I mean, yes, mistress. Whatever you need.\"\r\n\r\nShe settled back into her chair, extending one stockinged leg toward him. The torn fabric from earlier hung in tatters, but somehow that just made the whole thing hotter. Jaune knelt down and carefully took her foot in his hands, working his thumbs into the arch. All those years of rubbing his sisters' feet after their shopping marathons were finally paying off in the weirdest way possible. A part of him hated how he was so eager to please - simp... - but an even bigger part told it to shut the fuck up.\r\n\r\n\"You know,\" Professor Goodwitch said casually as he worked, \"Your... side job is cutting into your training time with Ms. Nikos.\"\r\n\r\nJaune's hands faltered slightly, \"I, uh, try to balance things-\"\r\n\r\n\"You need all the help you can get, considering your fake transcripts.\"\r\n\r\nJaune froze completely, his blood turning to ice in his veins. Oh shit. Oh fuck. Oh shit fuck damn hell-\r\n\r\nProfessor Goodwitch must have felt him tense up because she chuckled softly, \"Relax, Juliette. At this point, that's the least illegal thing about you.\" She gestured vaguely between them, \"Or did you think the deputy headmistress having 'relations' with a student was perfectly normal?\"\r\n\r\nJaune's mouth opened and closed like a fish out of water. His brain had officially short-circuited. She knew? About the transcripts? And she was cool with it? \"I- you- we-\" he stammered, his usual eloquence completely shot to hell.\r\n\r\n\"Before you give yourself an aneurysm,\" Professor Goodwitch interrupted, \"I have a proposition for you.\" She switched feet, placing her other one in his still-trembling hands, \"I'd like to offer you additional combat training. Private sessions, on my own time.\"\r\n\r\nJaune blinked rapidly, trying to process this development, \"You... want to train me? Even though I'm a fraud who just had his face between your-\"\r\n\r\n\"Especially because of those things,\" she said matter-of-factly, \"You clearly have motivation to improve, and I have... personal reasons for wanting to ensure you succeed. Convenience reasons.\"\r\n\r\n\"But why?\" Jaune asked, genuinely confused, \"I mean, I'm grateful, obviously, but-\"\r\n\r\n\"Because I want to,\" Professor Goodwitch cut him off, \"Does there need to be another reason?\"\r\n\r\nJaune stared at her for a moment, then broke into the biggest grin he'd had all week, \"Yes! Hell yes. I mean, yes please, Professor. I'd love that.\"\r\n\r\nShe nodded approvingly, \"Good. We'll start next week. And Mr. Arc?\" She leaned forward slightly, her green eyes boring into his, \"This arrangement stays between us.\"\r\n\r\n\"Of course,\" Jaune nodded frantically, \"Secret. Got it. My lips are sealed.\"\r\n\r\n\"They'd better be,\" she said with the faintest hint of a smirk, \"Now, finish with my feet. I have a faculty meeting in an hour.\"\r\n\r\nAlmost an hour later, Jaune stumbled back toward his dorm room looking absolutely fucked stupid. His maid outfit was completely askew - the headband hanging off one ear, his skirt twisted around his waist, stockings laddered beyond repair, and his apron had somehow gotten tangled with his hair extensions. He probably looked like he'd been through a blender, which honestly wasn't that far from the truth.\r\n\r\nHis brain was still trying to process everything that had happened. Professor Goodwitch knew about his transcripts and didn't care. She'd basically admitted to committing a crime by sleeping with him and also didn't care. And somehow, out of all that insanity, he'd ended up with a personal combat instructor who happened to be one of the most skilled Huntresses in Vale. Pyrrha was impressive, best partner ever, 10 out of 10, but Professor Goodwitch was... Professor Goodwitch.\r\n\r\nHis life was fucking weird.\r\n\r\nHe pushed open the door to Team JNPR's dorm, still in a daze. Ren was at his desk reading, Nora was upside down on her bed tossing pancake bits at the ceiling (and completely missing the trash can), and Pyrrha was sitting on her bed, polishing Mil with maybe a little more force than necessary.\r\n\r\nAll three of them looked up when he entered. Pyrrha's smile seemed particularly forced, her green eyes scanning his disheveled appearance with an expression that was hard to read. She seemed stressed, but he was too tired for their daily five stress relief sessions. Maybe next time, \"So,\" Pyrrha said, her voice bright and cheerful in an odd way he couldn't place \"How was your appointment, Jaune? Who was your client today?\"\r\n\r\nJaune flopped down on his bed, not even bothering to change out of the maid outfit, \"Professor Goodwitch,\" he said, his voice slightly muffled by his pillow.\r\n\r\nThere was a moment of stunned silence. Then Ren, without looking up from his book, said in his usual deadpan tone, \"Nice.\"\r\n\r\n\"REN!\" Nora shrieked, immediately rolling off her bed and tackling her partner, \"You're supposed to be PURE! INNOCENT! How do you even know what that means?!\"\r\n\r\n\"I have eyes, Nora,\" Ren replied calmly, even as she tried to put him in a headlock, \"And I'm not blind to what Jaune does for work.\"\r\n\r\n\"That's not the point!\" Nora wailed, now attempting to cover Ren's ears with her hands while he continued reading like all was right with the world, \"You're not supposed to appreciate other people's sexy times! What about OUR sexy times?!\"\r\n\r\n\"We don't have sexy times, Nora.\"\r\n\r\n\"EXACTLY! That's the problem!\"\r\n\r\nJaune tuned them out and went to sleep. After the day he had, he deserved it.\r\n\r\n[line break]\r\n\r\nNo penetration for Glynda... yet. Glynda being one of the clients Jaune is super into, plus her not being a stupid 19-20 something, means she doesn't blow her load early. It also means she can show up for a sequel chapter where that riding crop gets used.\r\n\r\nWho do you guys want next? Last time Glynda was voted so I put her in. Cinder? Winter? Someone else?"
    }
  ]
}