{
  "title": "Mr and Mrs Arc",
  "author": "Dr. Jhon Smith",
  "synopsis": "Team JNPR wake up one morning to a slightly off kilter Jaune Arc. It turns out his parents are visiting. Joy...Oh wait-",
  "chapters": [
    {
      "title": "Chapter 1",
      "text": "Matters of Family\r\n\r\nDawn graced Beacon. The morning chill swept away by the light, the birds began to fill the air with the sounds of Vale, and-\r\n\r\n\"We're all gonna die!\", were the words they woke to, on this fine Tuesday.\r\n\r\nThe day had come. He knew it was coming, but the cold hard reality hadn't hit him till today. THIS DAY. THIS DAY. THE DAY. TOD-\r\n\r\n\"Jaune?\", Ren slid aside his night cap.\r\n\r\n\"It's all over. There's no hope. We're SKEWERD!\". Jaune was pacing madly about the center of the dorm, waving Crocea Mors as he twitched.\r\n\r\n\"...Are you...Oka-\", Jaune cut him off and he pounced on the gunner, pinning him to the bed, and pressing a finger to silence him.\r\n\r\n\"Shh...\", Jaune hushed, not breaking eye contact. \"The walls have portals.\"\r\n\r\nHis eyes darted to the side, eying the cracked plaster just left of the door.\r\n\r\nChoosing not to validate that response, Ren remained still, wondering what in the name of dust had his friend all worked up.\r\n\r\nSuddenly, Jaune scurried off the bed, much akin to how a mole rat, scurries into its burrow. He disappeared beyond the edge of the bed.\r\n\r\nOnly the rustling of sheets, and the surprised \"Ah!\" of Pyrrha told him where he had gone off to.\r\n\r\n\"Pyrrha darling.\", she was about to say something about it being too soon when he pressed a finger to her lips. \"Shhh\"\r\n\r\n\"Ah, Jaune...well\", she let the last syllable roll of her tongue. The tint on her cheeks darkening, matching the tint of her pajamas. \"If this is a dream don't wake me up.\"\r\n\r\n\"Shh\", he pressed his finger to her lips again, using her blanket like some kind of hood.\r\n\r\n\"Pyrrha, sweetheart. I need to know something very, very important.\"\r\n\r\n\"Yes Jaune! Tak-\", he suddenly took a hold of her face, lifting her into a sitting position.\r\n\r\n\"Do you perchance have the Shield of Ajax on hand? If not I'll need the Helmet of Hades. If you don't have either I'll settle for the Fleece? Nod if you have any of these items, if not shake your head. Also that shampoo you're using smells wonderful, apples. \", after a few moments she very slowly shook her head, his warm fingers giving little resistance.\r\n\r\n\"Lovely.\", he pressed his lips against hers, and hopped off the bed. It was a very chaste peck, but Pyrrha's head went spinning, surprise clear on her face. Then she hit the pillow, a content expression on her face.\r\n\r\n\"NORA!\", He over to her bed.\r\n\r\n\"Sghhk sghhk,\", she awoke, her bed hair flying about the place like she was struck by lightning.\r\n\r\nIt took a few moments to register, but when the realization came, the smile that grew on her face was diabolical.\r\n\r\nShe stood up on the bed \"IIIITTTT'SSSS MOR-\", Jaune shoved her back under the covers.\r\n\r\n\"SHHHHH! The morning is evil. EVIL!\", he said.\r\n\r\n\"It's all over. Nowhere to run. Nowhere to hide. We're all dead. Just us...and our inevitable gobsmacking.\", he said between heavy breaths, punctuating syllables with meaningless hand gestures.\r\n\r\n\"Jaune, are you...coming on to me?\", Nora narrowed her eyes slightly.\r\n\r\n\"Yes. NO!\", he corrected himself quickly.\r\n\r\nPyrrha rose quickly from her stupor, with a surprising need to cause some bodily harm. With a smile that promised only pain.\r\n\r\nBut before she could act upon them, Jaune quickly handed Nora Manghild.\r\n\r\n\"Listen to me very carefully\", he said, punctuating each word with a caress against Manghild's dust reinforced percussive face. \"I need you, to hit me with her, very, very hard. So hard infact, that I end up in next week, or next month.\"\r\n\r\nNora smile unfolded her trusty explosive hammer, and reared up.\r\n\r\nSensing immediate harm to her man, and his more important bits, Pyrrha willed her semblance to chuck a stapler at Manghild. It hit Manglind mid swing, skewing the head farther up than intended.\r\n\r\nBOOM.\r\n\r\nPlaster and drywall flew everywhere, as Manghild tore a hole in the wall the size of an Ursa.\r\n\r\nWhen the smoke cleared, everyone, including Team RWBY across the hall, and everyone else on this wing of the dorms, was awake.\r\n\r\n\"Aww. I missed.\", Nora looked slightly dejected, chucking Manghild into the closet.\r\n\r\n\"Goodwitch is going to kill us.\", Ren said flatly.\r\n\r\nPyrrha made her way over to Jaune, her not-so-fearless leader sitting in fetal position, rocking back and forth, a crazed look in his eyes.\r\n\r\nSlowly, she leaned down and embraced him.\r\n\r\n\"Jaune. What's wrong.\", he didn't answer her. Instead, he turned his head towards the desk beside his bed.\r\n\r\nPyrrha gave him one final assuring pat on the back, before getting up to see exactly what had Jaune so worked up.\r\n\r\nWhen she got there, she found a letter. It was no ordinary letter, seeing as this was causing her leader some extraordinary grief. It was a simple envelope, sapphire in color, and a light yellow trim along the mouth.\r\n\r\nShe opened it, and found a GOLDEN letter. It wasn't so much that the letter was in the color of gold, or that the paper was reflective like gold. No, the letter itself was SOLID GOLD, the folds were joints made of papyrus, if the texture was anything to go by.\r\n\r\nWith some hesitance, she began to read the wording, carved into the tablets and laden with sapphire.\r\n\r\n\"This isn't so ba-\", she kept reading.\r\n\r\n\"Oh.\", she said.\r\n\r\nRuby chose this moment to walk into the room, through the hole manghild had punched into the hall.\r\n\r\n\"Hey guys, what's up.\", she said, inspecting the truly magnificent damage that Nora had wrought upon the architecture.\r\n\r\n\"Wow, Goodwitch is going to kill you.\", she observed.\r\n\r\n\"No, Ruby. We are already dead.\", Jaune said.\r\n\r\n\"I'm sure she might viciously maim you verbally, but its not lik she can...kill you...I think.\", Ruby said.\r\n\r\n\"Death by Goodwitch, is mercy.\", Jaune said.\r\n\r\nRuby raised an eye brow, \"Is he...\"\r\n\r\n\"Going to be alright?\", Ren finished.\r\n\r\n\"Maybe.\", Nora said.\r\n\r\n\"Ha..haha...MHHAHAHAHAH!\", Pyrrha cackled.\r\n\r\nIt was perfect, too perfect! This was her chance, if she won victory here, she could possibly hit home run. Finish the whole set, get the baker's dozen.\r\n\r\n\"Oh no. She caught the crazy.\", Nora said.\r\n\r\n\"Oh no Nora, I'm not crazy.\", Pyrrha said.\r\n\r\n\"She's lost it.\", ren said.\r\n\r\n\"I'm going to meet his parents.\", more mad cackling ensued.\r\n\r\n[=]\r\n\r\nDear Jaune,\r\n\r\nThou hast gone far my wayward son. Far enough from the protection of our realm, and well beyond the reach of your father's wealth. Yet despite this distance, you have carved out your own path separate from us. At a fine school you have found yourself purchase in, and a finer profession doth thou pursue. You have brought much pride to the name Arc, and although thous't lord father will not admit, save for his own pigheadedness, he as well is proud of your deeds.\r\n\r\nStill, you haven't spoken to us in ages, my son. Not a letter, nor a phone call. If I didn't know better, I would venture to say that you were avoiding us.\r\n\r\nAs such I've decided to pay a visit to the institution in charge of your tutelage. We'll arrive on the second Tuesday of Samhain. We look forward to seeing you.\r\n\r\nYour loving mother,\r\n\r\nA.P. Arc\r\n\r\nPS. Your father insists on coming, as he insisted on writing the letter."
    },
    {
      "title": "Chapter 2",
      "text": "Coffee or Tea?\r\n\r\nThe tea was warm. Despite Beacon's pro-coffee majority, a select portion of the student body, and some of the staff preferred tea. Mainly Ms. Goodwitch and Professor Peach. Everyone else drank coffee, and despite the claims that coffee was the far superior beverage, Jaune liked to belong to the minority.\r\n\r\nStill the tea was doing little to calm his nerves. In fact his hands hadn't stopped shaking since they pried Crocea Mors out of his hands. Thankfully Ms. Goodwitch was more than understanding, and with a flick of her magical leather riding crop, I will never utter those words, the wall was fixed, good as new. He felt a bit guilty about having Phyrra handle that.\r\n\r\n\"He sure is taking this bad.\", Noted Ruby.\r\n\r\n\"Well at least he isn't still going on about our imminent deaths.\", said Weiss.\r\n\r\nA muffled, \"We're doomed.\", sounded as Jaune's forehead met the table again.\r\n\r\n\"Too soon.\", Ren said.\r\n\r\n\"Ren, be nice.\" commanded Nora, inhaling another plate of pancakes.\r\n\r\n\"I don't understand what's the big deal is. It's just a parent's visit. Isn't that the right of every parent to know their child is being treated well?\", Weiss said, taking a bite out of her English muffin.\r\n\r\n\"Circumstances...are different. At least for Jaune.\", Phyrra said. \"his parents weren't aware of his admission to Beacon until recently.\"\r\n\r\n\"Which brings us to the topic at hand.\", Weiss said. \"I understand that Mr. Arc here doesn't exactly have the most accurate summation of their skill on paper, but I'm certain that you've proven yourself to the professors at this point.\"\r\n\r\nA silence passed.\r\n\r\n\"Wow, that is probably the nicest thing you've said to Jaune in...\", Ruby tilted her head.\r\n\r\n\"Ever.\", Yang finished. \"are you feelin alright there Ice Queen?\"\r\n\r\n\"Hey!\", she was about to protest that statement, but Blake's ninja skills were far too perceptive to allow such a tsundere moment. As such she performed a silencing maneuver that required both precision and deadly accuracy. She placed a hand on the heiress' mouth.\r\n\r\n\"As entertaining as this lovely banter is...we're getting off topic.\", she said, as Weiss continued to try and speak through the hand.\r\n\r\n\"So, your parents. Why don't you ever talk about them?\", Yang said.\r\n\r\nJaune immediately lifted his head.\r\n\r\nHe took a moment and took a look around the table. Namely at Ruby, then Weiss, then Yang, and finally Blake.\r\n\r\n\"Are you seriously asking me that question?\", he said.\r\n\r\n\"Oh...well. Right. I can see why that would be...awkward.\", Yang said, reddening a little.\r\n\r\nRuby let out a subdued \"Ye-p\", and Weiss looked rather sheepish for a moment, glancing down at the table. Blake closed her eyes and nodded understanding.\r\n\r\n\"I'm okay with it.\", Ruby said. \"It was a long time ago, and...\", she hesitated a moment. She locked eyes with Yang, and then at Weiss, and then at every one else present.\r\n\r\n\"I'm not over it, but I'm strong enough to accept that it happen.\", she smiled solemnly.\r\n\r\nIt took a moment to register, but\r\n\r\n\"Exes-tine-teli\", she twisted her tongue.\r\n\r\n\"Existentialist\",Blake corrected.\r\n\r\n\"Whatever-angst, that...is funky stuff. Painful stuff...\", Ruby said.\r\n\r\n\"But you can't let it control you.\", Ruby's expression hardened. \"It's a part of you, and you can't let it go, but you can't let it define who you are.\"\r\n\r\nShe smiled, \"So don't worry about us. We're stronger than that\"\r\n\r\n\"I'm fine if Rubes is fine.\", Yang said.\r\n\r\nWeiss and Blake shared a look, and nodded.\r\n\r\n\"We're good.\"\r\n\r\n\"You...are all...so precious!\", Nora said wiping away a stray tear. Ren handed her a handkerchief.\r\n\r\n\"Okay yeah, but seriously. Its fine. If anything we'll actually get a kick out of hearing about your parental issues, as opposed to wild mass guessing about the various states of dysfunction that no doubt plague our own family histories.\", Blake said.\r\n\r\nPhyrra gave his hand a reassuring squeeze.\r\n\r\n\"Okay\", he said. \"Where do I start.\"\r\n\r\n\"Hm, story time at breakfast?\", Ozpin made his presence known.\r\n\r\n\"P-Professor Ozpin?!\", Jaune said.\r\n\r\nSure enough the man stood there, dressed in his usual emerald garments, and the ever present cup of coffee in his hand.\r\n\r\n\"Good morning, sir!\", Jaune resisted the urge to stand at attention.\r\n\r\n\"Do you mean to wish me a good morning? Or are you perhaps saying that it is a good morning, or perhaps you mean to say that this is a morning to be good on?\"\r\n\r\n\"A-...what?\"\r\n\r\n\"It's a joke.\", Ozpin said, smiling weakly.\r\n\r\n\"So what brings you here, this early Professor?\", Weiss said.\r\n\r\n\"A rather cross Goodwitch, flew by my office this morning. I can't quite remember what she said, but something about exploding hammers...\", he trailed off.\r\n\r\n\"Aha- sorry about that Sir.\", Jaune said.\r\n\r\n\"Well, seeing as no one was harmed, barring some grievously brutalized plaster and a few feet of carpet, I suppose I can let it slide.\", he said, brushing his fingernails against a lapel, and pretending to inspect them\r\n\r\n\"T-thanks sir!\"\r\n\r\n\"Rather than thanking me, how about repaying me with an explanation?\", he smiled.\r\n\r\n\"Ah...well that's a funny story.\", Jaune.\r\n\r\n\"I'm certain it is.\", the illustrious headmaster began to take a sip of coffee-\r\n\r\n\"My parents are coming to visit\", and immediately spat it back out.\r\n\r\nSpraying caffeinated drink all over the opposing table-setting it on fire-promptly causing the wards in Beacon to activate, accelerating the flame, and all but burning the poor defenseless oak cafeteria table, seats and all, to a fine gray ash.\r\n\r\nAll while both teams looked on in mute horror, and fascination. Mostly horror.\r\n\r\n\"Professor are you okay?\",Ruby asked.\r\n\r\nHe look like he'd been impaled by an invisible sword. Ozpin's eyes were wide, and it wasn't from the coffee. Collecting himself, he wiped his mouth on a sleeve.\r\n\r\nThen he burst out laughing, \"Ha hah hahahah\"\r\n\r\nThe bitter tone it held was almost as dark as his coffee.\r\n\r\n\"That is a good one Mr. Arc. Haha. Far better than my obscure misquote of JRR.\", He said between heaves. \"I almost took you seriously there when you said your parents were coming to inspect the institution.\", Ozpin motioned as if wiping a tear.\r\n\r\nThe Patriarch and Matriarch of the Arc line, coming to his institution. Preposterous. They'd never survive such a thing. The notion itself was like waking up to a zombie apocalypse. That sort of thing only happens in cheesy movies produced in Atlas. Ha.\r\n\r\n\"...\", Jaune smiled awkwardly. \"Ah, sir. I'm not joking.\"\r\n\r\nThe headmaster's face went one, perhaps two shades paler, as the blood drained from his face. The mug quivered as his hand began to shake and promptly hit the floor. Spilling all of its contents on the cold, hard, unforgiving marble tiles of the cafeteria\r\n\r\n\"Head mas-\", he didn't allow Ruby to finish that question. Their lives were at stake.\r\n\r\n\"Excuse me, I need to find Glynda.\", he began to walk.\r\n\r\nSure enough he was out of ear shot Weiss spoke. \"See the headmaster isn't wor-\"\r\n\r\n\"Glynda!\", he yelled, as he quickened his pace towards the door. Earning turning the attention of the few cafeteria patrons towards him. Truly a slow day in Beacon when there aren't enough students at breakfast. Sadder still when the reasons for such are that they'd much prefer to be on class on time, rather than waste a few minutes at breakfast.\r\n\r\n\"-and he's jogging...\", Yang said.\r\n\r\n\"GLYNDA!\"\r\n\r\n\"Now sprinting\", noted Blake\r\n\r\n\"His age really doesn't slow him down.\", Yang said.\r\n\r\nOzpin reached the double doors of the cafeteria, and flung them open. He turned to the left, and started running. \"GGYYYYNNNNDAAAAAAA!\", slowly trailing off into silence as he went.\r\n\r\n\"That was weir-\", Then Ozpin ran past the doors again in the other direction.\r\n\r\n\"GGYYYYNNNNDAAAAAAA!\", and the doors shut, silencing any further yelling.\r\n\r\n\"-d\", Weiss finished.\r\n\r\n\"What was weird?\", Professor Bartholomew Oobleck, disheveled hair, opaque glasses, and all stood in the space that Professor Ozpin had just vacated. He looked rather well rested, despite looking like he'd slept in what he was wearing last night.\r\n\r\n\"Good morning.\", he said.\r\n\r\n\"Good morning.\" they replied collectively.\r\n\r\n\"I wonder what has Oz all worked up.\", he adjusted his glasses.\r\n\r\n\"Someone's parents are visiting to inspect the institution.\", said Weiss, giving Jaune a look.\r\n\r\n\"Oh, who's?\". he asked.\r\n\r\nJaune raised his hand sheepishly.\r\n\r\n\"Oh I see.\", he said plainly.\r\n\r\n\"Are you going to panic too?\", Nora said expectantly.\r\n\r\n\"Panic? What a preposterous thing to do, silly girl. Why would I panic about the parents of Jaune Arc coming to vis-\"\r\n\r\nTo his credit, and the many years of expertise and fine service to this teaching establishment, Bartholomew Oobleck did not panic. \"One moment please.\"\r\n\r\nIn a blur he took out his scroll and dialed a number and the extension, and turned to try and have his conversation in private.\r\n\r\n\"Hello Port, yes sorry to interrupt. It's Bart. Yes. Listen carefully, I need you to grab Edgar and meet me at the south side airship terminal now. Don't question it. The Arc boy's parents are coming. NOT THIS IS NOT A DRILL\", he closed the scroll and placed it in his back pocket.\r\n\r\n\"Ah, excuse me, ladies and gentlemen. It seems that Professor Port and I have an expedition to go on. To...an unexplored region, Notanywherenearhere.\", he said, in hurried pauses.\r\n\r\n\"As conveniently timed as it would seem, I assure you, that it was planned and paid for well in advance. You have just been notified\"\r\n\r\n\"That's unfortunate.\", Jaune said giving meaningful glances around the table. \"Do you know when you'll be back?\"\r\n\r\nWhen we're certain that the smoking crater that was once Beacon is well and truly-, \"unfortunately we aren't certain at this time. I pray your substitutes are competent Goodbye.\", with that he zoomed out of the cafeteria, a white, green blur.\r\n\r\n\"Okay, this is getting out of hand.\", Weiss said. \"Jaune, what about your parents has the staff running for the hills?\"\r\n\r\n\"Well it all started...\"\r\n\r\n[=]\r\n\r\nGlynda Goodwitch had a lot of things. Skill, power, position, and to more than a few people, delicious legs, patience however, was not something she had an abundance of.\r\n\r\n\"Port, put the cow down.\", she said.\r\n\r\n\"Never!\", he replied.\r\n\r\nDodging another bolt of lightning, as he carried Edgar's black and white form above his head.\r\n\r\n\"Edgar and I will escape this prison and find FREEEEDOOMMM\", He set Edgar down, the domesticated Grimm-Bovine mooing as he met sweet sweet solid earth again.\r\n\r\nPort stepped forward, and with a heave, the threads of his finely tailored jacket, dress shirt, and caveat, shredded, revealing row upon row of glorious reverberating muscle.\r\n\r\nHis mustache wigled.\r\n\r\n\"I didn't realize I would have to one day use my skills against you Glynda. However, seeing as now you stand between me, and salvation, I shall not hesitate in using all the techniques passed down my family line- to best you, and escape this doomed place.\", he flexed. \"Now then, Have at thee.\"\r\n\r\nThen the door to the lecture hall exploded.\r\n\r\n\"GLYYYYNNNDDDDDAAAA!\", Ozpin wailed tearfully, as he knelt and hugged her leg.\r\n\r\nThen, from the opposite door, Oobleck rolled in, all manner of blackboards, and papers exploding in his wake, some of which were on fire- the papers and the boards.\r\n\r\n\"Port what are you doing?! This is no time to dilly dally, the airship is departing in 5 minu- Hello Glynda\", he dropped the globe of Remnant he was holding. \"What a coincidence, I was just about to call you.\"\r\n\r\nGlynda inhaled deeply, her free index and forefinger massaging the space between her fine eyebrows,\r\n\r\n\"I'm surrounded by idiots.\"\r\n\r\nA/N:\r\n\r\nIts hard to please you readers. Wanting me to update one day later.\r\n\r\nI'll update this in snippets as new humor comes to mind. This chapter felt a bit dry though."
    },
    {
      "title": "Chapter 3",
      "text": "Like a King\r\n\r\n\"Glynda, I understand you're...annoyed\"\r\n\r\n\"Angry.\", she corrected.\r\n\r\n\"Alright, angry.\", he shot her a winning smile. \"However I assure you I have calmed down, and these-\", gesturing to the chains that bound his wrists behind the chair, \"-are unnecessary.\"\r\n\r\n\"I see.\", she said.\r\n\r\n\"You see?\", he said.\r\n\r\nSeeing as she was making no motions to undo the bindings, \"So are you going to take them off?\"\r\n\r\n\"No.\", she said plainly.\r\n\r\n\"BE REASONABLE WO-\", a meaty TWHACK, echoed around the room, silencing Port.\r\n\r\n\"Port don't agitate her! You'll only mak-\", TWHACK, and Oobleck choose not to finish that sentence.\r\n\r\n\"You're getting some perverted satisfaction from this are-\", another meaty TWHACK, and subsequent death glare, and Ozpin Headmaster of Beacon, wasn't uttering any further comments.\r\n\r\n\"Now then, before my hand actually starts blistering from having to use it as a gavel, I'm going to say this once, and I do hope you pay close attention because I will not be repeating myself.\", she gave a moment of pause. Not for dramatic effect mind you.\r\n\r\n\"Jaune Arc's familial units are coming to inspect the institution.\", expressions of barely contained fear passed through those present.\r\n\r\n\"You are all employees of this institution. Hunters.\", she turned to Port, leaning across his desk in the lecture hall. \"We are not prey.\"\r\n\r\nPort's expression remained unreadable.\r\n\r\n\"What's more, this is no way for us to greet esteemed guests. We do not entertain guests, by our absence. Only by our esteemed presence and force of will shall we woo these patro-\"DING-DONG- DOOO-DING.\r\n\r\nThe loud speaker for the room chimed, \"Hello, Glynda?\"\r\n\r\nShe paused mid rant, her fist hanging just at eye level. She was about to pound into the desk for emphasis. Sighing she straightened, \"Yes Jane?\"\r\n\r\n\"Ah, am I interrupting something?\", sensing the slight annoyance in the usually subdued Goodwitch's tone.\r\n\r\n\"Nothing. of. Import.\", she said through grit teeth.\r\n\r\n\"Wonderful, I just wanted to inform you that an unidentified craft has entered Beacon Airspace.\", she said, a little too cheerily.\r\n\r\n\"Have you hailed them?\", said Glynda.\r\n\r\n\"Ah, yes. I have.\", Silence.\r\n\r\n\"And?\"\r\n\r\n\"They keep replying in a series of wedge shaped symbols. I can't read any of this\", she her pitch raised a little. \"I was wondering if Oobleck was available.\"\r\n\r\n\"Send it to my scroll!\", Oobleck demanded.\r\n\r\n\"Right away Barty Buddy!\"\r\n\r\nThe scroll vibrated audibly, sending Oobleck into a frenzy, trying to wiggle the device out of his trousers. He finally managed to swing his index and forefinger, around one corner, only to pull the device out, and have it fall onto the carpet.\r\n\r\nSoon followed by him, disappearing over the edge of the desk as his seat tumbled onto the floor.\r\n\r\nLike a green headed caterpillar he wiggled to the fallen device, and pressed the button on the face, urging it to expand.\r\n\r\nA series of lines, arranged in various patterns and wedges passed along the screen.\r\n\r\n\"Ah, yes I see.\", he said to no one in particular.\r\n\r\n\"We're doomed.\", he said gravely.\r\n\r\nA moment passed...\r\n\r\nThen the lecture hall erupted into an amalgamated mess of screaming and pained whimpering followed by the wailing in anguish.\r\n\r\nCRACK!\r\n\r\nThe desk caved and parted as Goodwitch's dust reinforced palm made sweet, sweet love to its solid oak dark wood finish.\r\n\r\n\"Pull yourselves together! We are not going to die here. We are not going to panic, desert or flee.\", She said, emphasizing each word with a tap of her riding crop against her palm.\r\n\r\n\"We are going to roll out the welcome wagon for these foreign dignitaries, and then we will display to them the finest teaching establishment in the business of training hunters on the face of Remnant.\", she turned to them.\r\n\r\n\"We will not cower in the presence of the Arcs.\"\r\n\r\n\"Arcs as in Jaune Arc?\", shit.\r\n\r\n\"Peach. Don't.\", Glynda warned.\r\n\r\n\"Calm down Glynda, I'm not as easily shaken up as these men.\", Glynda sighed in relief. Finally an ally amongst deserting cowards. She silently forgave all those past times Peach had interrupted her speeches during their schooling years.\r\n\r\n\"-but\", shit. \"I may have left the automatic defense systems online before I called you...and the overwrite isn't working...\"\r\n\r\n\"Just thought you should know, ta!\", and the PA clicked off.\r\n\r\n\"Arrrggghhh\", She resisted the urge to rip hair, out as she made a B-line for the door. The manual overwrite was in her office.\r\n\r\nShe flung the doors open, and made it 2 meters down the hall-\r\n\r\n\"Glynda wait! Don't leave me!\", Ozpin called after her.\r\n\r\n\"Shit.\", she swore.\r\n\r\n[=]\r\n\r\nIt began in the 41st age. The wastelands left behind by the devastation 80 years prior to this day, stretched into the farthest reaches of Remnant. Truly a world now, as its name implied, a shadow of what it once was. Scars left by weapons of man turned against man, marred the landscape. The very footsteps of humanity were feared-\r\n\r\n\"Hold up, please.\", Yang raised her hand. \"why exactly are you starting this out like some prologue out of a cheesy 'end of the world as we know it' movie.\"\r\n\r\n\"I went through the trouble of getting the flashlight. Humor me, for two more paragraphs?\", Jaune said, clicking the flashlight off.\r\n\r\n\"Or...rather than listening to your sub par attempts at reciting verse, we could talk about your parents.\", said Blake.\r\n\r\n\"I was trying to lay some world building, thank you very much.\", he huffed.\r\n\r\n\"Just, get on with it.\", said Blake. \"What's your mother like?\"\r\n\r\n\"Ah...lets see...\", he held up a hand, folding fingers as he began to recite her qualities. \"Dignified, graceful, eats a lot, loving and kind.\"\r\n\r\n\"Very descriptive.\", said Weiss.\r\n\r\n\"She's also a knight.\"\r\n\r\n\"A knight?\", Ruby raised an eyebrow. \"Like the ones in fairy tales?\"\r\n\r\n\"Haha, sometimes I think she really is straight out of some fairytale legend.\", he laughed. \"Really doesn't help that she's a king.-Kinda just reinforces the idea.\"\r\n\r\nIt took them a moment, \"Your mom is a KING?!\"\r\n\r\n\"Your mother is female, correct?\", asked Blake.\r\n\r\nJaune nodded.\r\n\r\n\"But she's a King?\",he nodded again.\r\n\r\n\"How does that work?\", her brow furrowed.\r\n\r\nHe raised his hands defensively, \"Well so's my dad-\"\r\n\r\n\"Your father's a female?\", said Yang, earning a love tap from Ruby.\r\n\r\n\"He means a King.\", she corrected.\r\n\r\n\"Wait, Jaune, doesn't this make you technically Royalty?\", Pyrrha said.\r\n\r\n\"I...suppose...\", he said.\r\n\r\n\"Wait, just playing devils advocate here. How do we know what you're telling us is genuine?\", Weiss said. \"I'm not saying I don't want to believe you, I just want a little proof is all.\"\r\n\r\n\"The teachers panicking because Royalty is hopping over for a visit isn't convincing enough?\", Said Blake.\r\n\r\n\"Jaune's a prince!\", she gasped. \"Which means- if I marry him I'll be queen of the castle!\"\r\n\r\n\"Only if his parents give up on the throne.\", said Ren.\r\n\r\n\"-and he belongs to Pyrrha...\", the two warriors shared a look.\r\n\r\n\"Can I bor-\", she tried.\r\n\r\n\"No.\", the spartan said.\r\n\r\n\"Okay.\", she slumped in dejection, Ren patting her on the back in understanding.\r\n\r\n\"You guys ever heard of Arcadia?\", Jaune continued.\r\n\r\n\"You mean the one settlement out pasted the deserts of Vacuo?\", said Blake. \"It's almost mythical. The sheer amount of wealth and territory that is being developed there is outstanding. Vacuo actually had to start putting immigration restrictions up, because so many citizens were crossing the desert into Arcadia.\", Weiss said. Switching to lecture mode.\r\n\r\n\"I've heard this. My father is an expeditionary force member. He's helping to survey the lands bordering Mistral for expansion. More than a few times, he's met the Arcadian survey corps.\", Pyrrha said. \"He says, now its a contest to see who can conquer more land faster between the Kingdom and settlement.\"\r\n\r\n\"Isn't that a prelude to war?\", asked Weiss.\r\n\r\n\"Normally it would be, but Mistral and Arcadia love each other, Vacuo is pretty neutral on the subject., its Atlas that doesn't like either. Moreover Grimm are a real problem for Vacuo, and having Arcadia and Mistral covering one of their boarders as buffer zones is beneficial to them\", Said Pyrrha.\r\n\r\n\"Politics!\", exclaimed Ruby, pumping a fist into the air.\r\n\r\n\"Not our thing.\", agreed Yang.\r\n\r\n\"I'm surprised it isn't its own Kingdom yet.\", said Weiss.\r\n\r\n\"Well it is, but...not in the traditional sense of Kingdom.\", Said Jaune.\r\n\r\n\"What do you mean?\", Weiss had a sinking feeling she knew where this was going.\r\n\r\n\"Ever wonder why Arc is my last name.\", then she connected the dots.\r\n\r\n\"...\", she stared at him dumfounded. \"You're joking.\"\r\n\r\nHe just twiddled his thumbs sheepishly, and she, lost the ability to articulate speech.\r\n\r\n\"Missed out on your chance to be a real princess there Ice Queen.\", said Yang.\r\n\r\n\"SILENCE XIAO-LONG!\", she got up, resisting the urge to pounce on the brawler.\r\n\r\n\"And as for you!\", she pointed to Jaune. \"I don't quite believe you yet...but it fits...\", she sat back down and leaned back.\r\n\r\n\"Next thing you know you'll be telling us your father runs Golden Rule, or some other nonsense.\", she crossed her arms.\r\n\r\n\"...\", he shot her a reluctant smile. \"..he...sorta is.\"\r\n\r\nWith a hollow thud, Weiss' head became very good friends with the table.\r\n\r\n\"Jaune.\", Ruby said plainly. An unreadable expression on her face. \"Why didn't you tell us you were more stacked than Weiss?\"\r\n\r\n\"You...never asked.\", he said.\r\n\r\nRuby nodded, then reached under the table, and brought Manghild out; chucking it at Nora.\r\n\r\n\"Nora, I need you to hit me with this so hard, I end up at the first step of initiation.\", she said evenly.\r\n\r\nNora hopped up onto the table, and reared up.\r\n\r\nSensing imminent harm to her true significant other and her more import- What?! No! It's not like that... or anything!\r\n\r\nBlushing profusely Weiss willed her semblance into being, a large barrier glyph came to be as the hammer swung down hard., utterly no-selling the explosion and subsequent property damage that Manghild would have no doubt caused.\r\n\r\n\"You...you...\", she picked up a cookie from Ruby' breakfast tray, and shoved it into the redhead's mouth. \"Shut up, and be satisfied I'm your partner!\"\r\n\r\nRuby nodded, accepting the graceful chocolate chip goodness that the heiress had delivered onto her. As well she should have.\r\n\r\n\"I guess that's how the cookie crumbles?\", Yang smiled shamelessly. \"Amirite guys?\"\r\n\r\nSilence.\r\n\r\nDING-DONG- DOOO-DING.\r\n\r\n\"Attention all students, this is Professor Jane Peach. I am sorry to interrupt your activities on this fine, soon to be very chaotic morning. However, due to some unforeseen circumstances, well outside our control, all classes are canceled until further notice.\"\r\n\r\nchirp-chirp.\r\n\r\nThis...was not happening. The fact that it was happening only served to confirm that in in fact was not happening. There was no definitive proof, but she was certain it had something to do with this fiasco Jaune's parents were causing. She was willing to tolerate it. At least for the day. It was one day. She could expend one day on this ridiculous shenanigans. However far left, or far right, she could follow. She was a Schnee after all. She knew how to play both sides against the middle.\r\n\r\nHowever, now they had gone too far.\r\n\r\nThey had cost her classes.\r\n\r\n\"I, am saddened as well my dear students. However I am certain that you will learn to live it it...hopefully.\", and it clicked off.\r\n\r\nWeiss stood up and shook her fist at the announcement that had the cafeteria patrons cheering like idiots. \"WHAT THE DUST IS THIS SHIT! I AM ABOUT TO GO -SCHNEE- ON ALL YOUR ASSES!\"\r\n\r\nAN:\r\n\r\nIt's missing something, I swear it is. I might take a break from this soon, because classes N life.\r\n\r\nI wish I could reply to all the reviews, but in the end all my replies would amount to thank you. It's all your support and words that encourage me to write.\r\n\r\nTherefore, thank you readers. You are awesome!\r\n\r\nOn a more subdued note, do you all think I should just consolidate these three chapters into one? It feels a waste to spend one chapter for something that's little under 2k words.\r\n\r\n- Omake -\r\n\r\nOmake: Rin Tohsaka Summons a Servant That Fits Her Perfectly\r\n\r\n...ish...mostly...maybe better than Archer...Eh...\r\n\r\n\"For the elements silver and iron\", she began, liquified mana dripped onto the magic circle beneath her. Its lines flaring to life in a brilliant cyan hue.\r\n\r\n\"For the foundation, stone, and the archduke of contracts. For the ancestor, my great master Schwinorg. Close the gates of the cardinal directions.\", she continued.\r\n\r\nFill. Fill. Fill. Fill. Fill.\r\n\r\nRepeat five times but when each is filled, destroy it, set.\r\n\r\nThe circle shifted huges, green, then orange. The clock continued to tick...\r\n\r\nHeed my words. My will creates your body and your sword creates my destiny.\r\n\r\nNow red.\r\n\r\nIf you heed the Grail's call and obey my will and reason, then answer me.\r\n\r\nI hereby swear- That I shall be all that is good in the world. That I shall defeat all the evil in the world.\r\n\r\n\"You seven heavens, clad in the three great words of power, come forth from the circle of binding\", her circuits were hot, there was no doubt now. \"Guardian of the scales!\"\r\n\r\nA red light sprang forth, tendrils of its energy spiraled about, exploding outward, the air thickened, kicking dust about the room.\r\n\r\nBreathe deeply.\r\n\r\nShe knelt upon the used circle, her knees haven given out from the strain. She exhaled in short breaths.\r\n\r\n\"That was perfect!\", she exclaimed, inspecting her command seals. \"I know I drew the most powerful card!...Oi?\"\r\n\r\nShe looked about the old,dusty study, a few over turned books, a basket she chucked full of old scrolls. Some books on the holy grail from the 15th century...Servant? She tried the other side of the room. Ser-\r\n\r\nCRASH. THUMP.\r\n\r\nshe picked herself, up and ran up the stairs, \"WHY?\"\r\n\r\nPast the stairs, past the galley, past the kitchen, is that a sandwich?- past the Master bath. Liv- annnd the door is stuck.\r\n\r\n\"The door's broken\", she shoved a shoulder into it, and the door gave in. Hinges poped, and it fell forward into the living room with a crash.\r\n\r\nCalling it a disaster zone would be an understatement. Plaster was everywhere, the celing had a hole in it, she counted at least five pieces of furniture that were missing legs, some more than one. And every curtain in the room was ripped or covering some other damaged piece of furniture...how?\r\n\r\nYet despite all of this, her attention was far more focused on the only other...Person?- in the room.\r\n\r\nThey sat, almost immaculately upon a fallen drawer draped by a curtain, the fine silk cushioning them against the otherwise uncomfortable oak finish. The fine white of her servants pea coat, contrasting greatly with the satin of the curtain. A fine layer of frost spread thinly along the floor from where they sat.\r\n\r\nTheir eyes finally met, the blues of a clear sky meeting those of dense ice, a faint expression passed through the servant's features. Then she spotted the clock.\r\n\r\n\"Ah...\" a feeling of dread crept up her spine. \"All the clocks in the house were set an hour fast today...Which means its now 1AM. Not 2 AM?\"\r\n\r\nPanic...no no...don't panic.\r\n\r\n\"I've done it again!\", she said, her hands finding refuge, clutching at her twin tails.\r\n\r\n\"What's done is done.\", she lamented, crouching down. \"Why did you give me that task, father?\"\r\n\r\nShe spied her servant looking at her queerly.\r\n\r\n\"Well?\", she said. \"What are you supposed to be?\"\r\n\r\n\"That's rude.\", the servant said.\r\n\r\n\"What?\", Rin stood.\r\n\r\n\"A proper lady is supposed to introduce herself. Were you raised in a cave?\", her tone was sharp.\r\n\r\n\"Ak, I...\", Rin could feel her cheeks burning. Then the many years of Tohsaka family etiquette. Kicked into high gear.\r\n\r\nWell, in truth it was only one class...with that 12 inch rul- and she chose not to recall that memory further...or ever.\r\n\r\n\"I am Rin Tohsaka, good to meet you.\", she bowed her head.\r\n\r\n\"Curtsey.\", Rin's head shot up.\r\n\r\n\"Wha...what?\", she was not having any of this. \"No. Just who do you think you are here?!\", she pointed accusingly.\r\n\r\n\"Hm, it seems I've been summoned by an unruly gorilla like person. I may have drawn the short straw this time...\", her servant looked about the room.\r\n\r\n\"You have a rather poor taste in interior decorating.\", her tone was almost pretentious, condescending even.\r\n\r\nRin made a face, it was rather undignified.\r\n\r\n\"I suppose that's a bit of my fault. Still-I disagree with all the shades of red however. It's so gaudy.\"\r\n\r\nThe servant ran some of the curtain that she sat on beneath her dainty fingers.\r\n\r\n\"It could use a bit more white, and perhaps a flower or two would brighten the mood. An elegant mansion, but not a vase to be seen. I might have fallen on that...Roses would be a nice touch don't you think?\", she sat cross legged, a hand cupped her cheek as she inspected the damage around her. Their eyes met again.\r\n\r\nHer servant's features were like porcelain-even her hair was the hue of freshly fallen snow. Were it not for the fine line of discoloration that ran down the woman's left eye, she would not look out of place as one of the marble statues in the garden.\r\n\r\nThen her servant shot her a warm smile, her lips were only the lightest shade of pink, despite her cold appearance, they looked quite war- what are you thinking!\r\n\r\n\"Please sit.\", she gestured with a hand, and a white magic circle sprang to life. The six branched snow flake spun as it rose, and a table and chair of an entirely different make materialized in its wake.\r\n\r\nShe hesitated a little, but finally gave in. Slumping, she took the seat offered.\r\n\r\n\"Don't slouch.\", the servant said.\r\n\r\nRin, tried to resist, but that smile and her words were compelling her...the servant's voice was like flowing water-stop...\r\n\r\nShe gave a tired sigh, \"Just so we're clear you are the servant I summoned, right? Saber correct?\"\r\n\r\n\"Yes, I am the servant you summoned.\", Rin's face brightened a little.\r\n\r\nPlease be Saber, please be Saber...PLEASE. BE. SABER.\r\n\r\n\"However.\", damn. \"I'm of the caster class.\"...more damn.\r\n\r\nWith a hollow thud, Rin's head became friends with the futuristic table. How in the world was this glass generating its own light...what science is this...\r\n\r\n\"Hm\", the servant looked over her master carefully. \"Not who you expected?\"\r\n\r\n\"I've messed up.\", Rin said dejectedly. \"If only I had been an hour earlier...damn that fake priest...\"\r\n\r\n\"Oh, giving up already?\", Caster raised an eyebrow.\r\n\r\n\"NEVER!\",Rin smacked her palms into the table. \"I trained ten years for this! It's too late to back down now!\"\r\n\r\nPeople who like red are all the same.\r\n\r\n\"Did you say something?\", Rin asked.\r\n\r\n\"Not at all.\", Caster. \"It seems you are dedicated.\"\r\n\r\nShe looked like she was pondering something, the struck a fist against her palm.\r\n\r\n\"Alright!\", she declared. \"I've decided.\"\r\n\r\n\"You've decided?\", Rin said.\r\n\r\n\"Yes.\", Caster said.\r\n\r\n\"What exactly?\"\r\n\r\n\"That you aren't an uncultured gorilla.\", she smiled shamelessly.\r\n\r\n\"Wha-WHAT?!\", Rin had just about had enough of this. \"GANDR\"\r\n\r\nThe explosion kicked up more debris. Blanketing the room in a fine haze.\r\n\r\nYet a single magic circle shined through. It's gleaming white glyphs shimmering as they spun. \"It was a joke.\"\r\n\r\n\"Still its good to see you won't let me go too far.\", Caster said, willing away the glyph.\r\n\r\nNot a single incantation uttered. Rin couldn't even recognize the glyph magic that this caster used.\r\n\r\n\"So your spells are in that language. I suppose that makes this easier then.\", Caster said.\r\n\r\n\"Ich werde Ihnen helfen, den heiligen Gral zu gewinnen.\", she smiled.\r\n\r\n\"You will...\", Rin looked a bit disbelieving.\r\n\r\nFirst she wrecks her home, and her living room. Then she insulted her father's interior decorator. She wasn't exactly sure why she felt insulted by that, but still... Had the nerve to call her a gorilla!\r\n\r\n\"Hmm...caster seems so informal, and seeing as you've given me your name, it seems only right that I give you mine.\", she made a tounge in cheeck expression. \"For now just call me Weiss.\"\r\n\r\n\"Snow?\", Rin asked.\r\n\r\n\"No, Weiss.\", the servant corrected. \"I'm more used to that.\"\r\n\r\nShe let it set in. Okay, I am now chummy with my servant. This...is good. She wants to help me win the grail-even better. Next step!\r\n\r\n\"Ah..then tonight we can plan how-\"\r\n\r\n\"Nope.\", Caster silenced her with a finger.\r\n\r\n\"Nope?!\", she was about to protest, when caster silenced her again.\r\n\r\n\"It is too early in the morning to plot the inevitable demises of our foes. Furthermore you are utterly spent.\" She began to shove the protesting magus on her heels into the hall.\r\n\r\n\"I beg your pardon!\", she wasn't that low on mana.\r\n\r\n\"You have it. Now off to bed with you.\", the white servant ushered the protesting teen out the door. \"I'll take care of the mess, It will be as though I never crashed through your living room in the first place.\"\r\n\r\nShe gave the young magus a reassuring pat on the back.\r\n\r\n\"I ah...Alright...\", she massaged her temple. This has been a long night. I might actually be relieved if this was just some terrible nightmare.\r\n\r\n\"Just one more thing.\", she heard caster say. \"You do have school, right?\"\r\n\r\n\"Ah, yes.\", she replied. Why would a servant ask that?\r\n\r\n\"You should already be in bed then.\", she said sternly. \"Oh, and do bundle up tomorrow.\"\r\n\r\nThe servant retreated back into the ruined living room-\r\n\r\n\"Winter is coming.\"\r\n\r\nA.N: There's your omake chapter for you.\r\n\r\nI can say with certainty that chapter 4 for this story is approximately two thousand words in. That's actually not a lot at all, and there isn't much humor yet. I may have spent all the humor on my last three chapters.\r\n\r\nFor some odd reason, or some twist of fate, an old friend of mine from middle school just so happen to be attending my college. Fancy that.\r\n\r\nIn short she's actually my reality equivalent of the trope : Manic Pixie Dream Wife. She brought me out of my shell in middle school, and treated me to some of the most fun and enjoyable moments I have ever had-and is probably one of the reasons I actually got into Anime/Manga proper.\r\n\r\nI, of course, have no idea whatsoever why I feel like I should share this with any of you, but seeing as I've already typed it out-I don't see any reason to spam the backspace key or Ctrl+X this paragraph.\r\n\r\nNow to an actually serious topic:\r\n\r\nI am not the most well read fan of the Nasuverse. I am a member of BL, but I really just lurk and barely post, so I do in fact read enough to at least understand how most of it works. This is in part a fair warning to all of you readers.\r\n\r\nI will at some point or another, utterly butcher some cannon, and the worst part is I probably won't even know I'm doing it.\r\n\r\nWith that said, please look forward to more of Jaune's pain...or rather every other character's pain at Jaune's expense."
    },
    {
      "title": "Chapter 4",
      "text": "We Meet Again-My Old Foe\r\n\r\nCLAK\r\n\r\n…\r\n\r\nKLACK.\r\n\r\nSLIDE SLIDE\r\n\r\nKLACK\r\n\r\n…\r\n\r\nCLAK\r\n\r\n\"Glynda...is this-\"\r\n\r\nCLACK\r\n\r\n\"Nessessary?\"\r\n\r\nCLACK.\r\n\r\n\"But of course.\", she grabbed the chair by the backrest again, sliding it across a long step. \"How else would we get to my office?\"\r\n\r\nThe restrained headmaster gave her a very stern look. \"The elevator is right there!\"\r\n\r\n\"Ohhhhh.\", she said not stopping as she slid the chair all the way to the edge of the step.\r\n\r\n\"Are we going to use-\"\r\n\r\n\"Nope.\", she said popping the P.\r\n\r\n\"You're enjoying this aren't you.\", the chair suddenly stopped.\r\n\r\n\"Professor Ozpin, in my many years teaching at this establishment, I have always had the utmost trust and respect in both you, and your station.\", Ozpin looked relieved, she could see a small smile creeping onto the elder gentleman's face.\r\n\r\n\"-Just not today.\", she smiled, poking him in the chest with her riding crop.\r\n\r\nIt was only half way through the tilt that he realized there were quite a number of steps between him and the next landing. Quite a lot of steps...un-carpeted...solid marble...steps...\r\n\r\n\"Glynda you won't da-!\"\r\n\r\nMuch clattering was heard in the halls of beacon that day. Such that it would later become known as the day they shall all remember, as the day to remember never to remind Goodwich or Ozpin of-EVER.\r\n\r\nHowever that date event naming would have to wait, as a second contender for the annual event holiday naming was coming to pass not too far away. A day of hypocrisy...and romance...and...general...derping, if that can be accepted as a word.\r\n\r\n\"GET BACK HERE JAUNE ARC!\", Jaune, the genius that he is, choose not to heed her demands, and instead opted for a brisk sprint in the opposite direction. Seeing as she was waving Myrtenaster around like bat, chucking freeze dust everywhere like it was no one's business. Well, lets be real here, it was her business.\r\n\r\n\"Weiss- Snow Angel we can talk about this!\", a jagged shard of ice sliced through the air impaling a defenseless cactus, nailing it to the far wall. And the running continues.\r\n\r\n\"Weiss! Jaune! Running in the halls is against the rules!\", Ruby shook her fist as she dashed after them.\r\n\r\n\"We really don't need to hear that coming from you Rubes.\", following Ruby as they dashed after the White Knight and Ice Queen.\r\n\r\n\"Dang, Loverboy seems to be pretty good at this.\", Yang was honestly impressed, in a strange, horrified way- seeing Jaune avoiding likely very lethal shards intended on skewering him alive.\r\n\r\n\"Where's Blake and everyone else?\", Ruby said.\r\n\r\n\"Uhhh\", she glanced back at the empty silent hallway. A tumbleweed casually strolling across the isle. \"No idea.\"\r\n\r\n\"Weiss I know your upset-!\", an icicle shot up from the floor just missed his groin.\r\n\r\n\"Keep talking Arc. It will make it all more satisfying when I use your frozen corpse for a coffee table!\"\r\n\r\n\"That would be weird...wouldn't it? I mean, if we had a coffee table, and it was Jaune, where would we put it?\", Ruby mused.\r\n\r\n\"Ruby. No.\", she shuddered at the thought, on top of things, if it were in the dorm, they'd have to change in front of it...and the train of thought stopped there. There will be no furniture of Jaune, or any other person, allowed in their room. Thus spoketh Xiao- Long. \"Just...No.\"\r\n\r\nShiiinggggggg\r\n\r\n\"Okay. This may be bad.\" they skidded to a halt. Jaune had almost made it too, she had caught him right at the double doors into the courtyard.\r\n\r\nJaune lay a single leg encased in ice, the frozen queen looming over her catch like some demented velociraptor.\r\n\r\n\"AHAHAHAHA\", she cackled, running her palms over her hands villainously. \"In me power\"\r\n\r\nOoooolalalalalalala\r\n\r\n\"We have to-\",The door to the courtyard, exploded open, the hinges screeching in protest as they were forced apart by strong hooves.\r\n\r\nA war horse barged forwared., it kneigh'd as it reared up, a mighty display of its strength, and astride it were two riders.\r\n\r\nWeiss froze, a look of befuddlement crossed her features, as if in askance of why, as she stared onto the black beauty that-\r\n\r\n\"-Llalalalala-\", came the war cry and the thundering of hooves.\r\n\r\nPlink.\r\n\r\n-and she promptly flew into Ruby's arms.\r\n\r\n\"-and to Weiss we bequeath a skillet to the head!\", said the queen of the castle.\r\n\r\n\"Is that Phyrra? Nora?\", cradling the unconscious Weiss that had fallen into her arms.\r\n\r\n\"That's a pony!\", Yang noted, walking over to pet the steed.\r\n\r\nThey dismounted, stroking the mighty war-steed's mane.\r\n\r\n\"My thanks friend, we shall remember your well!\", Phyrra stroked his mane. As if in understanding, the war horse reared up with a mighty kneeigh, and galloped back beyond the large wooden doors. Much to Yang's displeasure..\r\n\r\n\"Awh...he got away...\", she slumped in mock defeat.\r\n\r\n\"I'm sure you can find him in the stables later.\", Phyrra said.\r\n\r\n\"We have...stables?!\", Yang brightened.\r\n\r\n\"Little help, please.\"\r\n\r\nJaune looked rather miffed. Being stuck on the floor, one leg encased in ice from the knee down. Of course, this gave him the optimal view angle to peer into the delights which house themselves beneath the satin fold of both Phyrra, Weiss and Ruby's combat equipment-Not that Phyrra minded-but being the gentleman that he was was turning his attention to the far end of the hall... She of course could not speak for Ruby, who was backing off rather slowly along with a snoozing Weiss.\r\n\r\nThen the light began to dim, and a low rumble steadily grew louder.\r\n\r\n[=]\r\n\r\nThe duty of a King is to one's people. Therefore the King stands alone.\r\n\r\nWhether it is a dispute between nobles, or the slaughter of an entire village to purge infection from the lands. The mantle of responsibility shouldered by those who are worthy of the distinction of King do not allow them the luxury of human feelings.\r\n\r\n\"You are worried.\",the words of a King is akin to truth.\r\n\r\nDainty fingers traced the line of his cheek, trailing down across his collarbone, and to the collar of the gleaming appendage that had taken the place of his lost arm.\r\n\r\nThen a loud groaning emanated from her innards, prompting them both to look down at her stomach.\r\n\r\n\"and you require sustenance\", she nodded, a light reddening tinging her cheeks.\r\n\r\nHe lifted her into a bridal carry, the fabric of her unarmored battledress pressed flush to his chiseled physique; as they rose from the golden throne.\r\n\r\nHe had never needed another friend. Enkidu had brought him joy beyond imagining, and his passing had brought him grief beyond despair. He would never again need another friend. He only needed Enkidu, the one that had tried to stop him, from bedding another's bride. Equals, he could not say for sure. Not now, not anymore. He began to walk with every intention to satisfy his bride, the one treasure he could not posses, and for that reason amongst others, was his most prized acquisition.\r\n\r\nHer fingertips were cool. A testament to the efficiency of the Vimmana's new Arcadian construction. She traced the lines of red that arranged themselves over his chest-his divine heritage- and then the long scar that streaked across his torso-proof of his mortality- the rough scar tissue grating against the pads of her fingers. Shirou.\r\n\r\n\"Laid low, have been the warriors of old.\", she said wistfully. Letting her hand linger over his heart.\r\n\r\n\"Humbled by mere mortals...\", he frowned.\r\n\r\nHe was certain there was nothing \"mere\" about the mortal that had bested him. However, he was certain that it was the will of the world that the boy carried with him. In all his hypocrisy and all of his faults. The flagrant excess that had filled the garden. The filth that had accumulated in his absence. The purposeless masses that dotted the globe. He could lament all he liked, but the world had irrevocably changed, and he, and the heroes that came after him, no longer had a place in it. Saddening still was that this world was little different.\r\n\r\n\"This world has no shortage of Heroes.\", he said. \"and has little need of Kings.\"\r\n\r\nShe nodded but said nothing.\r\n\r\nThe peoples of this world had purpose, potential, and willingness- but these admirable traits came at the cost of their civilizations, past, and lives present.\r\n\r\nMagecraft, had died.\r\n\r\nTo be more precise. It had never lived here as it had in the other worlds. The power to create mysteries, phantasms of the highest caliber existed within each individual. This aura fueled the internalized world's of each individual's semblance. Granting them the power to impose their will upon the world-this Remnant. The specifics were alien to him. Even he dared not to understand further the workings of this new system, lest he lament the old and scorn the new further.\r\n\r\nIt was as though the Age of Gods had never ended, but he knew, that if such a time had ever passed in this world whatever divinities lived and carved their etchings into this land, they had long been forgotten. He could not hear them, nor did he feel his prayers reach them, yet the essence of divinity saturated the very air they breathed.\r\n\r\nThis was an Age of Heroes.\r\n\r\nIt is no wonder that the throne is so empty.\r\n\r\nA low table rose from the golden floor to meet them. It was not made of gold-rather, it was made from a fine ebony wood found in the deserts native to their new lands. The skirt it wore was a deep burgundy- a kotatsu befitting kings.\r\n\r\nHe set her down upon a cushion.\r\n\r\n\"So, what troubles the King?\", Arturia said.\r\n\r\n\"It troubles me that you must ask.\", he said, giving her a small smile.\r\n\r\n\"Then the boy...\", she said.\r\n\r\n\"Ye wayward son.\", the air hummed. Gold shimmered as glorious treasures emerged forth from the vault.\r\n\r\n\"Do not ridicule the way my people spoke.\", she pouted. \"I felt it would sound more...kingly.\"\r\n\r\n\"The letter was engraved onto solid gold tablets cast in the original casting clay of Babylon.\", he raised a brow. \"How much more 'kingly' did you intend to make it?\"\r\n\r\n\"Just because it is made of gold does not immediately make it kingly!\", she protested.\r\n\r\n\"Your holy blade, is laden with gold, and glows in a brilliant gold as it annihilates those foolish enough to incur your wrath.\", he countered. \"You are also a king. Therefore. Gold is Kingly.\"\r\n\r\nThe words of a King are Law.\r\n\r\nShe flicked his forehead.\r\n\r\nHis head lolled back into its usual position, a light red mark between his eyes.\r\n\r\n\"There are many 'kingly' colors, of which gold is but one.\", she liked her blues too.\r\n\r\nRubbing his injury, the former King of Heroes, current CEO of Golden Rule, willed forth the contents of his treasury.\r\n\r\nWith practiced grace the Original Golden Teapot of Babylon descended forth onto a small decorative mat, steam wafting forth from its spout.\r\n\r\nWithout uttering a word she passed him a pair of chopsticks, and he poured a generous amount of water into the golden containers-up until the fill line.\r\n\r\nThe sealed the lids, leaving the chopsticks at the edge of the golden cups to hold down the tab.\r\n\r\n\"Thank you for the meal.\", they spoke aloud.\r\n\r\nThey broke their chopsticks, opened the instant noodles, and then everything faded to white as the Vimmana exploded.\r\n\r\n[=]\r\n\r\nOzpin continued to stare at the ceiling with a blank expression. He considered changing the lamps that hung over the archways once, and now regretted not going through with it sooner. He had lost count of how many flights of stairs he had slid down. The novel fear it had initially elicited having lost its effect.\r\n\r\nSuddenly the chair slid to a halt. He craned his head to the side to note that they were before the single door of Glynda's office- a small nameplate with her name and title in imposing font were present at eye level. The windows that cradled the doorway a were simple rectangles, with the opaque plastic blinds drawn up.\r\n\r\n\"Finally!\", Glynda sounded relieved. \"Now to end this madness. Honestly, headmaster, all of our problems would be solved, if we just calmly go about our business with a cool head and clear goals.\r\n\r\nShe fumbled about, sheathing her riding crop on her boot. Left pocket, right pocket, nope. Right boot strap...Cleavage...nope.\r\n\r\n\"Where did I put those blasted keys?\", amidst her fumbling, Ozpin noted something peculiar. Namely the dimming of the room. A shadow began to creep up the blind left of the door. He noted that the opposite blind was also assailed by a growing shadow.\r\n\r\n\"Ah, Glynda…, he shook his binds, noting that, despite being rearranged for his rather unsavory transport, were now slightly tighter than he remembered.\r\n\r\n\"Good thing I keep a spare key in one of the potted plants.\", she reached over to the potted plant just beneath the window.\r\n\r\n\"Glynda I really think you should untie me\", before he could say more, she had retrieved the key.\r\n\r\n\"There's no rush professor, after all this is punishment as well.\", she paid him no heed. \"Honestly I don't understand how you manage without me. I know we've been friends since our academy days, but...you could have at least asked me out to a cup of coffee.\"\r\n\r\n\"You hate coffee! And where is this coming from all of a sudden?!\", he could hear the soft rumble of burning wreckage.\r\n\r\n\"All I'm saying is that I wouldn't have been opposed to some 'fostering of workplace relations' coming from you.\", Ozpin would later swear it was a hallucination, but at that precise moment he could barely make out a slightest tinge of pink of the otherwise placid goodwitch's features. Were it not for the loud pops in the distance he probably could have committed more of that image to memory.\r\n\r\n\"Honestly, one coffee soaked blouse later and I end up as the headmistress.\", she finally put the key into the door.\r\n\r\nPlaster and drywall exploded everywhere, the windows shattered, and all manner of priceless vials flew through the now empty window frames.\r\n\r\n\"Glynda.\", before he could say another word, she opened the door. Shut the door, found an upturned, serviceable chair, set it by the potted plant, and plopped down into the seat-sending more dust into the room.\r\n\r\nShe reached into the potted plant and brought out a bottle of strawberry brandy. Plunging her office key into the cork, she opened the bottle.\r\n\r\n\"I don-\", she shushed him with her riding crop.\r\n\r\n\"No words. I need this now.\", without a word, she dumped the coffee out of his mug, and sloshed a generous portion of the red liquid into the container- much to his dismay.\r\n\r\nWith a flick of her magical riding crop, the liquids chilled. Ozpin could feel ice crystals forming in his mug, While it could be enjoyed deiced, Glynda much preferred it better this way.\r\n\r\n\"This is going to be a long day.\", Glynda didn't reply to that, she merely took longer sips.\r\n\r\n[=]\r\n\r\nAmongst the fire and golden wreckage they stood...befuddled. In the face of Beacon tower, from the looks of things roughly around the area of Goodwitch's office, a burning GOLDEN airship was nose deep into the tower's innards.\r\n\r\n\"Well...that's a thing.\", Yang noted.\r\n\r\nThen anguished wails echoed through the halls of Beacon.\r\n\r\nA/N: I'ts been a while. I'm sorry."
    }
  ]
}