{
  "title": "Pragmatism, Thy Name is Jaune",
  "author": "Vendetta543",
  "synopsis": "Huntsmen were the best fighters in Remnant. They fought with power, speed, and an undeniable grace. Jaune Arc fought with none of those things. As far as he was concerned, honor and fairness weren't important. So what if it was mean or 'dishonorable? In a fight, the only thing that mattered was winning. No matter how much Weiss complained.",
  "chapters": [
    {
      "title": "Chapter 1",
      "text": "Request done for a friend who's dealing with some real life stuff. Jaune was trained by his dad to be a pragmatic survivalist who fights dirty. This clashes hard with the Huntsmen, especially Weiss.\r\n\r\nAlso, thanks to Titanmaster's review of 'Fake It Till You Make It', I'm thinking of doing a Chapter 2 for that fic from the perspective of the people in awe of Jaune. This is the review in question. The chapter will look like this as well:\r\n\r\n\"I remember when I first met Jaune Arc. We were standing face to face with a horde of Grimm that numbered in the hundreds. I turned to face him, but then I saw that he was galloping away, letting out a high-pitched cry to draw the Grimm towards him. At first, in my young naivety, I had thought him to be deserting us like a coward. Then, as he crossed over a bridge overlooking a valley, the structure collapsed under the weight of the Grimm, sending them all plummeting to their demise as the cliffs around them crumbled and buried the entire horde in rubble!\r\n\r\nJaune Arc had intentionally led the entire horde over the old bridge, intending for it to crumble and destroy the entire swarm!\r\n\r\nIt was then, on that day, that I realised that I would follow Jaune Arc to the bitter end!\"\r\n(Excerpt from Records of a Harem Matriarch, by Pyrrha Nikos)\r\n\r\n--------------------------------------------------------------------------------------------------------------------\r\n\r\nThe sparring arena at Beacon Academy was alive with chatter as Jaune Arc and Cardin Winchester stepped into the circle for their combat match. Most students were used to the theatrical, almost choreographed style of Huntsman combat, full of flashy maneuvers and elegant weapon techniques. But with Jaune, there was an air of unpredictability. Everyone knew he fought...differently. Effective, but different.\r\n\r\nRuby sat at the sidelines, flanked by Weiss and Blake. As the team leader and Jaune's partner, she clenched her fists in a show of solidarity, \"You got this, Jaune! Just...uh...don't overdo it!\" Her voice carried a nervous energy. She wanted to be a good leader and partner, but it was hard not to feel weird having someone so...unconventional watching her back. Huntsmen all fought differently, but there was a certain flair and style to it that every Huntsman had.\r\n\r\nEvery Huntsman except Jaune.\r\n\r\nWeiss crossed her arms, an unimpressed look on her face, \"Overdo it? He always overdoes it. Honestly, I don't understand how he's allowed to get away with this nonsense.\" She shook her head. Weiss wasn't a fan of her partner's tactics. Dishonorable, she said.\r\n\r\nBlake scoffed, her golden eyes flicking to the arena, \"It's not nonsense if it works.\"\r\n\r\nRuby bit her lip, \"I mean...yeah, but it's still a little weird.\"\r\n\r\nStanding in the corner, Professor Goodwitch raised her hand, \"Begin!\"\r\n\r\nCardin charged immediately, his mace raised high. The ground trembled slightly with each thunderous step. Cardin was a big brute, using strength and momentum to overpower his opponents. He was kinda like Yang that way, except he didn't have her agility. Jaune didn't flinch. Instead, he casually dipped his hand into his jacket and withdrew a small pouch. When Cardin swung his mace down with a grunt, Jaune sidestepped nimbly, the weapon slamming into the ground with a resounding CLANG. With Cardin briefly off balance, Jaune threw the pouch directly into his face,\r\n\r\n\"Pocket sand!\"\r\n\r\nCardin staggered back, flailing as glowing fire Dust particles clung to his skin, \"What the- ARGH! My eyes! Fuck!\" he roared, shaking his head to clear the stinging grit.\r\n\r\nRuby winced, \"Ooooh, that's...uh...effective?\" She'd never seen Dust used like that before. Unless you counted her sneezing and blowing up Weiss' stash during the first day.\r\n\r\nCardin didn't stay down. Blinking through the pain, he swung his mace in a wide arc, forcing Jaune to backpedal quickly. The air whooshed with the force of the attack, but Jaune ducked just in time, letting the weapon sail overhead, \"Not bad,\" Jaune said, grinning as he reached into another pocket, \"But let's see how you handle this!\"\r\n\r\nHe slipped past Cardin and flung a small, cylindrical device at the broader Huntsman's back. It stuck to his armor with a sharp clink. Cardin's eyes widened, \"What the hell did you just-\"\r\n\r\nBOOM!\r\n\r\nThe Dust charge exploded in a burst of smoke and concussive force, throwing Cardin forward. He skidded across the arena floor, metal scraping against metal, smoke curling from the scorched surface of his chest plate. The students watching gasped, some whispering excitedly while others looked shocked. Ruby waved her arms frantically, \"Jaune! Was that...was that even allowed?!\" She looked to Professor Goodwitch. The strict Professor didn't say anything and just kept watching the proceedings.\r\n\r\n\"It's fine!\" Jaune called over his shoulder, reloading something Ruby really hoped wasn't a shotgun, \"He's fine! Right, Cardin?\"\r\n\r\nCardin rose slowly to his feet, his face twisted in fury. His chest plate was blackened but intact, and the blast didn't seem to have done much more than knock the wind out of him, \"You think that's gonna stop me?!\" he growled, hefting his mace again, \"You're dead, Arc!\"\r\n\r\n\"Well, you're still standing, so...nope,\" Jaune replied with a shrug.\r\n\r\n\"I don't know why you're acting so shocked. Cardin's got an explosive on the tip of his mace,\" Blake rolled her eyes.\r\n\r\n\"Yeah, but...\"\r\n\r\nCardin roared and charged again, swinging with brutal force. This time, Jaune was forced to play defense, using his shield to deflect the heavy blows. Each hit rang out like a bell, and the sheer power of Cardin's attacks made Jaune's arm tremble. Ruby herself never saw the point of tanking hits. No one on Team RJWB (Rhubarb) did. Weiss skated around fights with her Semblance and Blake was like a ninja. Taking hits was just a waste of Aura.\r\n\r\n\"Alright,\" Jaune muttered under his breath, sidestepping the next wind-up swing. He reached into his jacket again, this time pulling out a small flashbang. With a flick of his wrist, he tossed it to the ground. A blinding light and deafening bang erupted, forcing everyone to shield their eyes - except Jaune, who wore tinted goggles he'd slipped on mid-motion.\r\n\r\n\"Flashbang?!\" Ruby yelped, covering her eyes, \"Where does he even get this stuff?\"\r\n\r\nCardin stumbled, disoriented, but still upright. He shook his head, his senses quickly returning as he swung his mace wildly, \"You're gonna pay for that!\" he bellowed, managing to clip Jaune's shield with enough force to send him skidding back.\r\n\r\nJaune grunted as he steadied himself, rubbing his arm, \"Dang, you hit like a bull. Guess I'll have to stop holding back.\"\r\n\r\n\"Stop holding back?!\" Weiss hissed from the sidelines, \"What does that even mean? He's already blowing the arena apart!\"\r\n\r\nBlake hummed, \"It means he's going to win..\"\r\n\r\nJaune pivoted suddenly, pulling something from his belt. Ruby's stomach dropped as she recognized it: a sawn-off shotgun. And not just any sawn-off. She could tell even it a glance that it was modified to shoot more than regular shells. The frame was reinforced and she could practically feel the heat from the Fire Dust in the buckshot from where she was sitting. She was used to big calibers - Crescent Rose says hello - but still...\r\n\r\n\"Uh-oh...\" Ruby gasped, her hands flying to her mouth.\r\n\r\n\"Oh yes,\" Jaune said, almost cheerfully, as he pointed the weapon. Cardin, who had finally recovered from the flashbang, started to charge again, but Jaune didn't give him the chance to close the distance.\r\n\r\nBANG!\r\n\r\nThe shot hit Cardin square in the chest, stopping him mid-charge. The force knocked him off his feet, sending him flying back several feet. He hit the ground with a loud thud but somehow managed to roll back onto his knees, his armor dented and smoking. His face was twisted in a mix of rage and disbelief, \"That's it!\" Cardin shouted, pounding the ground with his fist as he got back to his feet, \"You're a dead man, Arc!\"\r\n\r\n\"Still breathing, bird man!\" Jaune quipped, reloading calmly.\r\n\r\nCardin lunged forward, his mace swinging with reckless abandon. This time, Jaune wasn't fast enough to dodge entirely, and the mace caught the edge of his shield, the impact sending him spinning. He was flung back but managed to recover, though his shield now sported a noticeable dent, \"Not bad,\" Jaune admitted, shaking his arm to loosen it up, \"But let's see how you handle this.\"\r\n\r\nBefore Cardin could react, Jaune dropped low, his hand darting to his shotgun. With one smooth motion, he fired again - this time aiming lower.\r\n\r\nBANG!\r\n\r\nCardin froze mid-charge. For a moment, the entire room was silent. Then he dropped his mace, his face turning an alarming shade of purple as he let out a high-pitched, strangled groan. His hands clutched his groin as he sank to his knees.\r\n\r\nRuby's face turned bright red, \"Oh. My. Gosh. Jaune, what are you doing?!\"\r\n\r\n\"It's called strategy, Ruby!\" Jaune replied, stepping back and preparing his next move, \"You take out the legs, you take out the fight! See!\" He gestured to Cardin, who let out a whine so high-pitched that Zwei would've thought it was a dog whistle.\r\n\r\nWeiss looked like she was about to faint, \"He...he shot him in the- \"\r\n\r\n\"I know!\" Ruby wailed, covering her face, \"I'm trying to support him, but...I don't even know how to feel about this!\"\r\n\r\nCardin, despite the devastating shot, managed to push himself back to his feet, his breathing ragged. His mace dragged on the ground as he glared daggers at Jaune, \"You're gonna regret that, Arc. I swear-\"\r\n\r\n\"Come on, then!\" Jaune called, grinning, \"I'm just getting started! He who stands last wins!\"\r\n\r\nThe fight continued, both combatants battered but far from done, as the rest of the class watched in stunned silence.\r\n\r\nBack at the side of the arena, Weiss sighed, her arms crossed tightly as she watched Arc and Winchester clash in the sparring arena. The combat class had devolved, as far as Weiss was concerned, into a spectacle of impropriety. Jaune's so-called 'fighting style' was little more than a patchwork of cheap tricks and dirty tactics, and it was grating on her nerves. It was an embarassment to think she was on the same team as him.\r\n\r\nShe huffed as Arc rolled under another wild swing from Winchester's mace, dusting himself off as if the maneuver was the most natural thing in the world, \"I can't believe Professor Goodwitch is letting this continue,\" Weiss muttered, her voice low but sharp, \"This isn't combat. This is an embarrassment.\" The Professor said nothing as the travesty continued, simply looking on at the fight and the Aura bars on the screen above.\r\n\r\nBeside her, Blake sat with one leg crossed over the other, her golden eyes fixed on the fight, \"It's not pretty,\" Blake admitted, her tone calm as always, \"But it's effective.\"\r\n\r\nWeiss scoffed, her lips curling into a thin line, \"Effective? This isn't how a Huntsman should fight! There's no discipline, no grace, no- \" she gestured toward the arena as Jaune flung a handful of what she could only describe as glittering fire Dust straight into Cardin's face again, \"-honor!\"\r\n\r\nBlake's mouth twitched slightly, but her expression remained neutral, \"Honor doesn't keep you alive in a real fight,\" she replied evenly, \"Effectiveness does.\"\r\n\r\nWeiss rounded on her teammate, her icy blue eyes narrowing, \"Are you seriously defending this? Huntsmen are supposed to be paragons of strength and skill. We're supposed to inspire people, Blake! Be beacons of hope! How are we supposed to do that if Arc's idea of inspiration is...is...pocket sand?!\"\r\n\r\nBlake tilted her head, her gaze flicking briefly to Weiss before returning to the arena, \"We're supposed to protect people, Weiss,\" she said, her tone pointed but still calm, \"That's the job. If you're fighting a Beowolf, do you think it cares if you fight honorably? Or a bandit? They'll do whatever it takes to win, and so should we. The people you're saving will care a lot more that you're successful than 'honorable', whatever that means to you.\"\r\n\r\nWeiss threw up her hands, \"So you think fighting like a common criminal is acceptable?\"\r\n\r\nBlake's golden eyes met hers, steady and unyielding, \"If it works, yes.\"\r\n\r\nWeiss opened her mouth to retort, but her words were drowned out by a loud BANG! from the arena. Both women turned just in time to see Winchester, now with his entire chestplate covered in a thick blanket of soot, roaring with rage as he launched himself at Arc, his mace swinging like a wrecking ball. Arc blocked with his dented shield, but the impact sent him staggering.\r\n\r\n\"See?\" Weiss gestured to Winchester's sheer brute force, \"That is real combat. Strength, precision, power!\"\r\n\r\nBlake raised an eyebrow, \"You mean blindly swinging a mace around until someone gets hit while screaming like a stuck pig?\"\r\n\r\n\"He's not- \" Weiss began, but she was interrupted by Jaune pulling something small and cylindrical from his belt. Her stomach sank.\r\n\r\n\"Not again...\" Ruby's voice came from Weiss' other side, quiet and nervous.\r\n\r\nArc tossed the device underhanded, and Weiss instinctively knew what was coming, \"Oh, for heaven's sake,\" she muttered as another flashbang detonated, flooding the room with light and sound. She shielded her eyes with one hand, gritting her teeth. When the brightness faded, she could already hear the murmurs and gasps from the other students.\r\n\r\nBlake's lips twitched into the faintest of smirks, \"Looks like he's winning.\"\r\n\r\nWeiss lowered her hand, her face a mix of exasperation and disbelief, \"Winning? He's making a mockery of combat! A Huntsman should fight with honor and dignity, not...whatever that was!\"\r\n\r\nBlake tilted her head, \"And if his 'mockery' keeps him alive when a bandit takes a cheap shot or a Grimm corners him, what then? Will honor protect him? Or will practicality? What about the people we're supposed to protect? Practicality lets you defend others, not honor rules.\"\r\n\r\nWeiss didn't answer immediately, her eyes narrowing as she watched Arc dodge yet another swing from Winchester. He moved quickly, planting a Dust charge on Winchester's leg with a practiced ease that Weiss hated to admit was impressive. The device beeped twice before detonating, sending the taller man sprawling back with a frustrated grunt.\r\n\r\n\"That's not the point,\" Weiss finally said, her voice tight, \"We have standards, Blake. Standards that separate us from...from barbarians.\"\r\n\r\nBlake gave her a sidelong glance, \"You're from Atlas. Standards don't matter much when you're fighting to survive. Maybe you should think about that.\"\r\n\r\nWeiss bristled, her cheeks flushing slightly, \"Atlas has nothing to do with this! It's about being a Huntsman. Arc's just- he's just- \"\r\n\r\n\"Winning,\" Blake finished for her, her tone leaving no room for argument\r\n\r\nWeiss sputtered, gesturing at the arena as Jaune reloaded his sawed-off shotgun with practiced efficiency, \"You can't seriously call this winning! Look at him!\"\r\n\r\nBlake's eyes flicked back to the match, her expression unreadable, \"And now Cardin's on his knees.\"\r\n\r\n\"Because he's a brute, not because Jaune's doing anything remotely admirable!\" Before Blake could respond, another BANG! echoed through the room. Weiss's face paled as she realized where Arc had aimed once more.\r\n\r\n\"Oh. My. Gods,\" Ruby whispered, her hands flying to her mouth, \"He shot him there again! I-Is he- Can he still have kids?\"\r\n\r\nWeiss turned sharply to Blake, her voice rising, \"You cannot defend this anymore!\"\r\n\r\nBlake's calm demeanor didn't falter, \"Cardin's still moving.\"\r\n\r\nAs if on cue, Cardin rose shakily to his feet, his breathing ragged and his face twisted in fury. His mace dragged behind him as he glared daggers at Jaune, who grinned and gestured for him to come closer.\r\n\r\n\"Ready to give up?\" Jaune called out cheerfully, his voice carrying across the arena.\r\n\r\nWeiss pinched the bridge of her nose, her voice strained, \"This is an absolute travesty.\"\r\n\r\nBlake shrugged lightly, \"This is survival.\"\r\n\r\n--------------------------------------------------------------------------------------------------------------------\r\n\r\nThe Beacon cafeteria was a bustling hub of activity, with students chatting and laughing as they unwound from the day's classes. At one table, Team RJWB (which Ruby still hated meant Rhubarb) was seated with trays of food, though the atmosphere was far from relaxed. Weiss sat ramrod straight, delicately slicing into a modest salad, her lips pressed into a thin line, \"I still cannot believe the barbarity I witnessed today,\" she muttered, shaking her head, \"That wasn't combat. That was...that was thuggery!\"\r\n\r\nAcross from her, Jaune grinned as he leaned back in his chair, a drumstick in hand, \"Hey, Weiss, you're welcome to step in the ring with Cardin next time. I'll even lend you my shotgun if you want.\"\r\n\r\nWeiss shot him a glare, her blue eyes icy, \"I would rather lose with dignity than win using such disgraceful methods!\"\r\n\r\nRuby, seated next to Jaune, poked at her mashed potatoes with her fork, \"I don't know, Weiss. Dignity doesn't sound that great when you're eating dirt.\" She glanced nervously at Jaune, \"Not that I'm saying you're wrong! It's just...um...well, he did win.\" Cardin spent the whole rest of the class with murder in his eyes, but Jaune didn't care. He said he dealt with worse than 'butthurt bullies' back home.\r\n\r\n\"Exactly!\" Jaune said, taking a triumphant bite of his drumstick, \"It's all about results!\"\r\n\r\nBlake, seated next to Weiss, quietly sipped her tea before setting the cup down and turning to Jaune, \"I've been meaning to ask,\" she said, \"Where did you learn to fight like that? It's...unconventional.\"\r\n\r\nJaune smiled proudly, leaning back in his chair and folding his arms, \"My dad taught me. Started me off young. Said if you're ever in a fight for your life, you do whatever it takes to make sure you walk away. Honor's nice and all, but it won't stop a bandit from stabbing you in the back.\" He chuckled, \"'Course, sometimes it was just fun. He once told me, 'Jaune, nothing's funnier than a bandit who thinks they've got the upper hand right before you set off the fireworks.'\"\r\n\r\nRuby giggled despite herself, her imagination conjuring a vision of a mini-Jaune setting off some kind of Dust-powered explosion while a bandit scrambled to escape, \"Okay, that's kinda funny,\" she admitted.\r\n\r\nWeiss sniffed, her chin lifting slightly, \"Then I'm afraid your father failed you in teaching proper combat etiquette. He should've taught you to fight with honor.\"\r\n\r\nJaune shrugged, unbothered, \"Honor's great and all, but last I checked, bandits don't really care about it. You think they're gonna bow and wait for me to finish a fancy move? Nah, they'll stab me in the back soon as they get the chance.\"\r\n\r\nWeiss bristled, stabbing her fork into her salad with unnecessary force, \"That doesn't mean you have to stoop to their level. Huntsmen are supposed to be better than that.\"\r\n\r\nBlake tilted her head, her golden eyes flicking between Weiss and Jaune. Then, with her usual deadpan, she asked, \"So, Weiss, how many bandits did you fight from your mansion in Atlas?\"\r\n\r\nThe fork in Weiss's hand froze midair. She turned to Blake, her cheeks coloring slightly, \"That's completely irrelevant!\"\r\n\r\n\"Is it?\" Blake asked, raising an eyebrow, \"I mean, you're not exactly speaking from experience. Have you ever even seen a bandit? Cause you're sure judging a lot. Almost sounds like you're an expert on fighting Grimm and other criminals outside the walls.\"\r\n\r\n\"I don't need to have personally fought them to know that dignity and honor are core principles of being a Huntsman!\" Weiss huffed, crossing her arms, \"My combat instructors taught me that.\"\r\n\r\n\"Sounds like they taught you how to fight other people who follow the rules,\" Jaune said, \"Not much help when someone throws sand in your face.\"\r\n\r\n\"Exactly,\" Blake said, nodding, \"Adaptability matters more than honor when you're fighting to survive. Bandits, Grimm...neither of them play fair.\"\r\n\r\nWeiss's cheeks puffed in indignation, and she turned to Ruby for support, \"Ruby, surely you agree with me! You were raised in a Huntsman family, were you not? They must've taught you the proper etiquette!\"\r\n\r\nRuby froze mid-bite, her mouth full of mashed potatoes. She glanced between Weiss's expectant stare and Jaune's raised eyebrow. Swallowing hurriedly, she laughed nervously, \"Uh...I think you both make good points?\" she offered, her voice pitched higher than usual. She hated fights. It wasn't like she didn't get why Weiss was peeved, but it wasn't like Jaune was bugging Weiss about the way she fought. Why didn't she just let bygones be bygones?\r\n\r\nJaune chuckled, \"Nice save, Ruby.\"\r\n\r\n\"Don't encourage him, Ruby!\" Weiss snapped before fixing Jaune with a stern glare, \"The point is, as Huntsmen, we should be setting an example. How are we supposed to inspire people if we resort to dirty tricks and crude ploys?\"\r\n\r\nJaune leaned forward, resting his elbows on the table, \"We inspire them by surviving. Nothing says 'hope' like someone who makes it back alive to tell the tale.\"\r\n\r\nBlake hummed, \"Practicality wins again.\"\r\n\r\nWeiss groaned, slumping back in her chair, \"I give up. You're all impossible.\"\r\n\r\nRuby giggled nervously, trying to lighten the mood, \"Come on, Weiss, don't be mad. At least Jaune's your teammate now. Imagine if he were on Cardin's team.\"\r\n\r\nWeiss shuddered at the thought, \"I don't even want to imagine the chaos that would bring.\"\r\n\r\nJaune grinned, \"See? You've got it good, Weiss.\"\r\n\r\nWeiss muttered something under her breath about uncouth behavior and barbarism, and Ruby couldn't help but laugh awkwardly. The tension at the table was thick enough to cut with Weiss's precision-forged steak knife (seriously, she brought that from Atlas). Ruby nervously glanced between Weiss, who was clearly still fuming about their earlier argument, and Jaune, who seemed oblivious as he tore into a drumstick with the appetite of someone who'd spent years on rations. Blake sat quietly, sipping her tea, her expression unreadable as always.\r\n\r\nDesperate to steer the conversation into safer waters, Ruby's eyes landed on Jaune's shotgun, which rested on the table like some war trophy. Her face lit up with an idea, \"Hey, Jaune!\" she piped up, forcing some cheer into her voice, \"Your shotgun's...uh...really cool! I noticed it's not like most standard ones. Did you do all the modifications yourself?\"\r\n\r\nJaune paused, glancing at the weapon, \"Oh, yeah,\" he said, perking up slightly, \"That's Betsy. Put her together back home. My dad always said if you want something done right, you do it yourself.\" He placed the drumstick down and picked up the weapon with the same kind of care she treated Crescent Rose, \"Swapped out the stock, reinforced the frame for heavier Dust rounds, and tuned the chamber to handle explosive slugs. It's not pretty, but it works.\"\r\n\r\nRuby's silver eyes gleamed as she leaned forward, resting her chin on her hands, \"Wait, you can fire explosive slugs?!\" she gasped, the tension in the air momentarily forgotten. She saw him shooting Fire Dust rounds earlier, but not explosive shot, \"What kind of explosive? Fire? Electric? Oh! Do you have to reinforce the barrel to handle the extra combustion? And what about recoil dampeners? How do you keep the kickback from knocking it out of your hands?\" Ember Celica might've been stupid hard to use (in Ruby's humble opinion), but at least it was hard to disarm from Yang. Well, unless you literally disarmed her, but what were the chances of that?\r\n\r\nJaune blinked at her barrage of questions but managed a small smile, \"Uh, mostly Fire Dust rounds. They're good for close-range bursts. The recoil's heavy, sure, but I just brace for it. As for the barrel...I guess I reinforced it a little?\" He scratched his head, clearly unused to Ruby's level of enthusiasm. A lot of people were, sadly, \"Honestly, I wasn't thinking about all that when I built it. I just made it tough enough not to explode in my hands.\"\r\n\r\nRuby leaned back, a dreamy smile spreading across her face as her mind conjured images of modified weapons, \"That's so cool,\" she murmured, her previous nerves all but forgotten, \"I mean, yeah, it's no Crescent Rose, but still, that kind of power must be-\"\r\n\r\n\"Mechashift weapons are impractical,\" Jaune said suddenly, as if it were the most obvious thing in the world. He was still inspecting Betsy, his tone matter-of-fact, \"I mean, they're cool, sure, but in a real fight? Too many moving parts. One jam, and you're toast.\"\r\n\r\nThe table went silent. Weiss, who had been slicing into her salad with clinical precision, paused mid-motion. Blake glanced briefly at Jaune but said nothing. And Ruby? Ruby froze, her fork hovering above her mashed potatoes as her eyes widened in disbelief. Did he just...did he really...?\r\n\r\n\"What did you just say?\" Ruby's voice was soft but carried a dangerous edge.\r\n\r\nJaune looked up, blinking at her, \"Huh? Oh, mechashift weapons,\" he repeated, clearly not realizing he had touched a nerve. A vein bulged on her forehead, \"I mean, don't get me wrong, Crescent Rose is impressive, but where I'm from, simple and reliable gets the job done. Mechashift's got a lot of room for things to go wrong.\"\r\n\r\nRuby's mouth fell open slightly, her expression a mix of shock and horror, \"Room to- things to- Jaune, mechashift isn't just cool! It's...It's revolutionary! It's adaptable, versatile, and...and beautiful!\" Her voice rose with each word as her emotions spilled over. Usually, she hated speaking up like this, but she refused to back down when weapons were at stake!\r\n\r\nJaune blinked, looking genuinely confused by her reaction, \"I'm not saying it's not impressive, Ruby. I just think it's...well, kinda overcomplicated. Like, why have a scythe and a sniper rifle in one weapon? Why not just have one good weapon that does what it's supposed to do?\"\r\n\r\nRuby gasped like he'd just committed a mortal sin, \"Because mechashift is the future! Crescent Rose can do everything! It's not just a weapon; it's an extension of me! How could you even think it's impractical?!\"\r\n\r\nWeiss, sensing an opportunity to jump in, straightened her posture and nodded firmly, \"I couldn't agree more, Ruby. A Huntsman's weapon reflects their skill and refinement. Jaune's...shotgun, while functional, lacks any sense of elegance or sophistication.\" Ruby nodded, not caring that Weiss was trying to hop on the bandwagon.\r\n\r\nJaune frowned, scratching the back of his head, \"I mean...it's not supposed to be elegant. It's just supposed to work.\"\r\n\r\n\"Exactly my point,\" Weiss said, her tone triumphant, \"It's functional, yes, but Huntsmen are meant to inspire. How are you supposed to inspire anyone with that...thing?\"\r\n\r\nBlake finally set down her teacup, \"So, what inspires you more, Weiss?\" she asked, her tone level, \"A weapon that looks nice or one that saves your life?\"\r\n\r\nWeiss turned to Blake, her cheeks reddening slightly, \"It's not about looks, Blake! It's about skill, precision, and refinement.\"\r\n\r\n\"And how many battles have you fought where Grimm or bandits cared about your precision or refinement?\" Blake asked evenly, her golden eyes steady, \"Weapons are tools. What matters is that they work. Gambol Shroud is mechashift too, but it's not really a big deal. And I've got a backup. There's a reason the sheath can double as a weapon. That way, if the mechashift jams I still have something to fall back on. What happens to you or Ruby if a mechanism fails?\"\r\n\r\nWeiss bristled, crossing her arms tightly, \"That's not the point! Huntsmen should aspire to more than just brute efficiency.\"\r\n\r\nRuby, still fuming, leaned forward to face Jaune, \"Crescent Rose is not brute efficiency! She's perfect!\"\r\n\r\n\"Hey, I wasn't the one who said that!\" Jaune yelped, \"And I didn't say she wasn't perfect for you. I just think for someone like me, mechashift's more trouble than it's worth. Betsy's reliable. I know what she can do, and I know she won't fail me when it counts.\"\r\n\r\nRuby groaned, burying her face in her hands, \"You just don't get it!\"\r\n\r\nJaune looked helplessly at Blake, who gave him a small shrug as if to say, You walked into this.\r\n\r\nWeiss huffed and resumed picking at her salad, muttering something under her breath again. Ruby sat back with a pout, shooting Jaune occasional glares. The quiet returned to the table, though the mood remained tense. Blake sipped her tea and glanced between her teammates, \"You know,\" she said lightly, \"this is exactly why I don't bring up the merits of dual-wielding. Everyone's got an opinion.\"\r\n\r\nRuby's pout deepened as the silence stretched across the table, her mashed potatoes growing colder with every second she glared at Jaune. Weiss was stabbing at her salad like it had personally offended her, while Blake continued sipping her tea, her expression as calm as ever. But Ruby wasn't ready to let this go. Oh no. Not when the very honor of mechashift weaponry was on the line! How dare he imply it was anything but the pinnacle of weapons engineering?!\r\n\r\nShe leaned forward, her silver eyes blazing with determination, \"Jaune, you don't understand. Mechashift isn't just about function - it's about art! About taking something practical and turning it into something beautiful. Crescent Rose isn't just a weapon; she's a masterpiece!\"\r\n\r\nJaune, still looking a little lost, offered her a sheepish smile, \"I mean, yeah, I can see how you'd think that,\" he said, scratching the back of his head, \"And Crescent Rose is cool, Ruby, don't get me wrong. But...it's just...\" He hesitated, clearly trying to find the right words.\r\n\r\nRuby narrowed her eyes, \"It's just what, Jaune?\"\r\n\r\nHe winced slightly but pressed on, \"It's just...the last time I saw a scythe, it was, uh, with the farmers back home? So, you know, it's kinda weird seeing one used as a weapon. Scythes are for cutting wheat in the fields, not Grimm.\"\r\n\r\nThe silence that followed was deafening. Weiss froze, her fork held in a vice-grip. Blake's teacup paused on its way to her lips. And Ruby? Ruby's entire body twitched as if she'd just been shot, \"Excuse me?!\" she screeched, her voice cracking. Her hands slammed down on the table, rattling the trays. A few students turned to look at her, but they quickly looked away when she glared at them. That's right! Don't mess with this Rose! \"Weird?! Did you just call Crescent Rose weird?!\"\r\n\r\nJaune flinched, holding up his hands defensively, \"No, no, no! That's not what I meant! I meant...well, okay, yeah, it's kind of weird to me, but - \"\r\n\r\n\"Weird?!\" Ruby interrupted, her voice rising to a near-hysterical pitch, \"Crescent Rose is not weird! She's iconic! She's revolutionary! She's- She's- \"\r\n\r\n\"Cuts through Grimm like they're wheat?\" Jaune offered hesitantly, instantly regretting the words as soon as they left his mouth.\r\n\r\nRuby let out a sound that was somewhere between a gasp and a growl, her fists trembling at her sides, \"A wheat cutter?!\" she repeated, her face turning as red as her cloak, \"Crescent Rose is a scythe! A Huntsman weapon of unparalleled brilliance! She's sleek, powerful, and- \" She paused, her voice dropping to a dangerous whisper, \" - not a wheat cutter.\"\r\n\r\nWeiss, seeing that Ruby was one misplaced comment away from combusting, pretended to be deeply engrossed in her salad. Blake, meanwhile, leaned back in her chair, her expression unreadable as she started eating her tuna sandwich. It was clear neither of them intended to get involved in this particular disaster.\r\n\r\nJaune, still trying to defuse the situation, laughed nervously, \"I mean, hey, I'm not saying it's bad, Ruby. It's just...you know, different? Unique! Yeah, that's the word. Unique!\" He grinned, clearly hoping the compliment would calm her down.\r\n\r\nIt did not.\r\n\r\n\"Different?!\" Ruby exploded, throwing her hands in the air, \"Do you know what else is different, Jaune? A chainsaw! Or...Or a grappling hook! But you don't see anyone calling those weird!\"\r\n\r\n\"Uh...\" Jaune glanced at Blake, hoping for backup, but she ignored him. Weiss, for her part, pointedly avoided his gaze, as if pretending he didn't exist.\r\n\r\nRuby leaned across the table, jabbing a finger in Jaune's direction, \"You take that back right now!\" she demanded, her voice trembling with righteous indignation.\r\n\r\n\"Take what back?!\" Jaune yelped, leaning away from her as far as his chair would allow.\r\n\r\n\"That Crescent Rose is weird!\" Ruby snapped, \"Say it! Say, 'Crescent Rose is a brilliant, amazing, totally-not-weird weapon!'\"\r\n\r\nJaune opened his mouth to reply but hesitated, clearly struggling to navigate the minefield he'd stumbled into, \"Uh...Crescent Rose is...definitely not for wheat?\" he tried.\r\n\r\nRuby let out an anguished groan, slumping back into her seat and burying her face in her hands, \"You don't get it, Jaune,\" she moaned, her voice muffled, \"You just don't get it!\"\r\n\r\nWeiss sighed, finally breaking her silence, \"Ruby, you can't expect someone like Jaune to appreciate the artistry of mechashift. He clearly lacks the refinement to understand true craftsmanship.\"\r\n\r\nJaune frowned, \"Hey, that's not fair! I just think simpler is better.\"\r\n\r\nRuby peeked out from behind her hands, her expression somewhere between exasperation and heartbreak, \"Simple doesn't mean better, Jaune. Crescent Rose is more than a weapon. She's a work of art. A symphony of engineering! How could anyone look at her and think she's weird?!\"\r\n\r\n\"Sure,\" Jaune said quickly, eager to end the argument, \"She's a symphony. Got it.\"\r\n\r\n\"Good.\" Ruby crossed her arms, still sulking, \"And she's not weird.\"\r\n\r\n\"Definitely not weird,\" Jaune agreed, though he still looked mildly confused.\r\n\r\nBlake, finally deciding to speak, set her sandwich down and glanced between them, \"Well, that was something.\"\r\n\r\nWeiss shot her a withering look, \"You could have intervened.\"\r\n\r\nBlake shrugged, \"I wasn't about to get between Ruby and Crescent Rose. I like my head where it is.\"\r\n\r\nWeiss muttered something about 'useless teammates' while Ruby returned to sulking, her pride in Crescent Rose bruised but not broken. She'd prove him wrong in the end. When Crescent Rose took down a goliath with one swing, then he'd see!\r\n\r\n--------------------------------------------------------------------------------------------------------------------\r\n\r\nPoor Jaune. Just wants to be a pragmatic dirty fighter and gets ragged on by the Huntsmen using anime logic. Thankfully, Blake is Best Girl in this fic and gets that fairness and honor are bullshit in real fights."
    }
  ]
}