{
  "title": "In Her Sights",
  "author": "Vendetta543",
  "chapters": [
    {
      "title": "Chapter 1",
      "text": "A twoshot that I got inspired to make after some chatting in my discord. A comedic Jaune Arc x May Zedong story where May is Jaune's childhood friend and guardian sniper. Whether he wants it or not.\r\n\r\n[line break]\r\n\r\nJaune stared out the airship window at the approaching silhouette of Beacon Academy, trying desperately to ignore the churning in his stomach. He clutched his family heirloom - Crocea Mors - a bit tighter, wondering for the thousandth time how he'd ended up here.\r\n\r\n\"Blonde Shield, this is Beanie One. Visual confirmation of target location acquired. ETA fifteen minutes to deployment zone. Over.\"\r\n\r\nJaune sighed and pulled the walkie-talkie from his belt, \"May, we're on an airship. Everyone can see we're fifteen minutes from Beacon. Also, I'm the only one who can hear you. Over.\"\r\n\r\n\"Maintain proper radio protocol, Blonde Shield. Security could be compromised. Over.\"\r\n\r\nThis was his life now- well, his life for the past two years anyway. May Zedong, childhood friend turned invisible guardian sniper, had decided somewhere around their fifteenth birthdays that protecting Jaune required absolute stealth. She'd gone up to his house one day, handed them the beat-up old walkie talkies they stopped using when they were ten, and told him that she was going to be looking out for him as an unseen partner. He thought it was a phase she'd grow out of in a couple of weeks, but no. May Zedong didn't do half-measures.\r\n\r\nHe hadn't actually seen May since then, despite knowing with absolute certainty that she was never more than a few hundred feet away. Even visiting her house wasn't any help. She was always conveniently 'out' whenever he came over.\r\n\r\n\"Do you remember when we used to just... hang out?\" Jaune murmured into the walkie-talkie, \"Like, in the same room? Visible to each other? Over.\"\r\n\r\nThe static crackled for a moment before May's response came through, \"Negative, Blonde Shield. Current protection protocols maximize efficiency. Your shield and Aura make you an optimal target while I maintain overwatch. You protect me; I protect you. Symbiotic relationship. Over.\"\r\n\r\nJaune leaned back against the wall of the airship. Symbiotic. Right. He couldn't count how many times he'd been walking home from school only to have some would-be bully suddenly collapse with a BB pellet to the kneecap (and that's if they were lucky). When they were both kids, May was deadly accurate with a slingshot. When they turned into teenagers, she'd graduated to BB guns and hunting rifles. And now? Well, he didn't actually know what she was using these days cause she always used a silencer. Probably something terrifying.\r\n\r\n\"You know,\" Jaune said, \"Normal friends go to movies together. They don't communicate exclusively through walkie-talkies and dead drops. Over.\"\r\n\r\n\"Normal isn't mission-optimal, Blonde Shield. Besides, I left you popcorn last Tuesday during your home viewing of The X-Ray and Vav: Mission Possible. Psychological and nutritional support provided. Over.\" That was true. He'd found a perfectly timed delivery of buttered popcorn at his windowsill precisely eleven minutes into the film. He still had no idea how she'd known when he'd started watching. She claimed she watched the movie with him. That is, through a scope and a directional microphone aimed through his window.\r\n\r\nHe probably should've been worried that he had someone with a gun to his head 24/7...\r\n\r\nThe most surreal part was that they were both somehow enrolled at Beacon now. May had simply left an envelope containing fake transcripts at their usual dead drop - the hollow tree in Ansel's central park - along with a note that said: \"Infiltration documents acquired. Mission parameters updated: Huntsman training imminent.\" They'd always talked about becoming Huntsmen together, but after she almost literally disappeared two years back, he kinda assumed she forgot about it.\r\n\r\nWhere she'd even gotten the forgeries, he had no idea. When he asked over their nightly check-in that day, she only responded with, \"Sources secure. Need-to-know basis. Over and out.\"\r\n\r\nSo here he was, fraudulently enrolled in the most prestigious Huntsman academy in Vale, armed with a hand-me-down sword, a collapsible shield, and an invisible sniper friend who refused to meet face-to-face, \"May, don't you think it's weird that we're going to be at the same school and still not-\" The airship banked suddenly, and Jaune's stomach lurched ominously. Oh Brothers, here it comes!\r\n\r\n\"Blonde Shield, biometric monitoring indicates motion sickness imminent. Deploying countermeasures in T-minus five. Over.\"\r\n\r\nJaune clutched his stomach, feeling cold sweat break out on his forehead.\r\n\r\n\"Four... three...\" May's voice continued the countdown in his ear.\r\n\r\n\"May, what are you-\"\r\n\r\n\"Two... one...\"\r\n\r\nJaune's cheeks puffed out as he desperately tried to hold it in.\r\n\r\n\"Zero. Countermeasure deployed.\"\r\n\r\nA paper bag slid perfectly across the floor, stopping against his foot at the exact moment May said 'zero'. Jaune snatched it up and promptly emptied his breakfast into it, right on cue. Everyone in a ten feet radius gave him a wide berth. What? Motion sickness is a common issue!\r\n\r\nAfter a miserable moment spent hunched over the bag, he keyed the walkie-talkie again, \"Thanks, May. But how did you even time that so perfectly? Over.\"\r\n\r\n\"Beanie One has maintained surveillance of Blonde Shield's airsickness patterns since Mission: Protect Jaune began. Your vomit trajectory is predictable to within 2.3 seconds. Preparation prevents poor performance. Over.\"\r\n\r\nJaune looked around the cabin, searching the faces of his fellow students. Was she disguised among them? Hiding in some maintenance compartment? He'd given up trying to spot her years ago, but sometimes he couldn't help wondering. It was weird not seeing your best friend for two years. He'd tried all sorts of ways to get her to expose herself, but none worked. Even going into the middle of literal nowhere failed. She'd somehow remained hidden even when sniping Grimm on a barren clearing.\r\n\r\n\"Beginning reconnaissance report on potential teammates. Over.\" May's voice crackled through the walkie-talkie without prompting.\r\n\r\nJaune blinked in surprise, \"What? Over.\"\r\n\r\n\"Subject one: Red-hooded female, five o'clock position. Ruby Rose, age fifteen. Admitted two years early by Headmaster Ozpin himself. Weapon: High-impact customizable sniper rifle that transforms into a scythe combined with speed Semblance. Combat effectiveness: High. Teammate potential: Moderate to high. Appears friendly but socially awkward. Over.\"\r\n\r\nJaune turned discreetly to see a small girl in a red hood looking nervously around the cabin, \"How do you - \"\r\n\r\n\"Subject two: Blonde female, seven o'clock. Yang Xiao Long. Subject one's half-sister. Weapon: Dual ranged shotgun gauntlets combined with damage boost Semblance. Combat effectiveness: Extremely high. Teammate potential: High if you don't touch her hair. Repeat: Do not touch the hair. Over.\"\r\n\r\nJaune spotted the tall blonde girl standing protectively near Ruby.\r\n\r\n\"Subject three: White-haired female, approaching your three o'clock. Weiss Schnee, heiress to the Schnee Dust Company. Weapon: Multi-action Dust rapier combined with Glyphs. Hereditary Semblance. Combat effectiveness: High. Teammate potential: Low. High maintenance. Severe attitude issues. Likely to look down on your credentials. Racist. Avoid interaction. Over.\"\r\n\r\n\"May-\"\r\n\r\n\"And finally, subject four: Red-haired female by the window. Pyrrha Nikos. Four-time Mistral Regional Tournament champion. Weapon: Rifle-javelin-xiphos combination with Polarity Semblance. Combat effectiveness: Extremely high. Best among the first years. Teammate potential: Optimal. Recommend immediate alliance formation. Over.\"\r\n\r\nJaune gaped at the athletic-looking redhead standing quietly by herself, \"May, how the heck do you know all this information about random people? Did you research everyone coming to Beacon? Over.\"\r\n\r\nThere was a pause before May responded, \"Information is ammunition, Blonde Shield. Knowledge of battlefield assets critical to mission success. Over.\"\r\n\r\n\"No, seriously, May. This is beyond your usual... whatever this is. How do you know their weapons, their histories, their... everything? Over.\"\r\n\r\n\"Blonde Shield, that information is classified. Operational security protocols in effect. Over.\"\r\n\r\n\"May...\"\r\n\r\n\"Don't worry about it. Over.\"\r\n\r\nJaune sighed, \"You know, at some point we're going to be assigned to teams,\" he said, \"Four-person teams. Living together in dorms. Kind of hard to maintain your whole 'invisible guardian' thing when we might be roommates. Over.\"\r\n\r\nThe silence lasted longer this time. Finally, \"I have contingencies for all scenarios. Roommate protocols already established. Over.\" Jaune didn't even want to know what that meant. He was about to ask when the airship's intercom crackled to life, announcing their arrival at Beacon Academy, \"Blonde Shield, prepare for deployment. First mission objective: Infiltrate academy grounds without detection of fraudulent credentials. Secondary objective: Avoid the Schnee heiress approaching your six. Tertiary objective: Do not vomit on anyone's shoes. Over.\"\r\n\r\nJaune spun around to see a white-haired girl in an expensive-looking outfit striding purposefully in his direction. Not to him specifically, though. He was just near the exit ramp.\r\n\r\n\"May, where the hell are you even watching from? Over.\"\r\n\r\n\"Beanie One is always in position. Good luck. Over and out.\" As the airship doors began to open, Jaune pocketed the walkie-talkie and took a deep breath. Somehow, he had a feeling Beacon Academy wasn't ready for whatever bizarre adventure he and his never-seen guardian were about to bring to its hallowed halls.\r\n\r\nNeither was he, for that matter.\r\n\r\nHours later, Jaune stared up at the auditorium ceiling, surrounded by dozens of sleeping bags and the soft murmurs of his fellow incoming first-years. Beacon's initiation was set for tomorrow morning, and despite the exhaustion of the day, sleep eluded him. His thoughts kept circling back to May. Even in this enclosed space, a single room packed with all the new students, he hadn't caught a single glimpse of her. And trust him, he looked.\r\n\r\nThen again, would he even recognize her if he saw her? The last time he'd actually laid eyes on May was two years ago. More than enough time for her to completely change from the girl he knew. He tried to picture her now. Back then, she'd had a round face, faded red hair almost always tucked under her trademark beanie, and a smile that appeared whenever she landed a perfect shot. Was she taller? Had her hair grown out? Did she still wear that beanie?\r\n\r\nThe walkie-talkie beside his sleeping bag crackled softly, \"Blonde Shield, you're not sleeping. Biorhythm indicators show heightened awareness. Over.\"\r\n\r\nJaune rolled his eyes and grabbed the device, \"Neither are you,\" he whispered as quietly as possible, mindful of the students trying to sleep nearby, \"Over.\"\r\n\r\n\"I'm on overwatch. Can't compromise the mission for sleep. Will maintain surveillance until you're secure. Over.\"\r\n\r\nJaune pinched the bridge of his nose, \"May, are you seriously planning to keep this up for the next FOUR YEARS? Over.\"\r\n\r\nThere was a pause, and when May's voice returned, she sounded genuinely confused, \"Of course I will. Why wouldn't I? It's the mission. Over.\"\r\n\r\n\"Because it's insane? Because we're at a school now, not in some combat zone? Because at some point you'll have to actually attend classes? Over.\"\r\n\r\n\"Don't worry about it. I've already arranged everything with the professors. Over.\"\r\n\r\nJaune sat bolt upright, \"You WHAT? What professors? How? When did you-\"\r\n\r\n\"Blonde Shield, keep your voice down. Security breach imminent. Over.\"\r\n\r\nHe glanced around, noticing a few annoyed looks from nearby students. One blonde girl with an eye mask pushed up on her forehead was glaring daggers at him, her eyes blazing red, \"Sorry,\" he muttered to her, then flopped back down and pressed the walkie-talkie close to his mouth, \"What do you mean you 'arranged' things with the professors? Over.\"\r\n\r\n\"Operational details classified. Just know that Beanie One has secured permissions for special tactics training. It's all covered. Don't worry. Over.\"\r\n\r\nJaune sighed deeply, staring back up at the ceiling. Somehow, he couldn't shake the mental image of May lurking in the rafters above them all, night-vision goggles trained on his sleeping bag, a sniper rifle at the ready in case any nightmares tried to attack him in his sleep.\r\n\r\n\"Y'know, at some point you're gonna have to let me see you again. Over.\"\r\n\r\nThe silence stretched so long he thought she might have finally gone to sleep. When she spoke next, her words were oddly soft, \"That's... not mission-optimal, Blonde Shield. Over.\"\r\n\r\n\"May, we're friends. We've been friends since we were kids. This whole 'mission' thing is-\"\r\n\r\n\"Mission parameters were established for your protection. Don't worry, I've got your six. Always. Over.\"\r\n\r\n\"But-\"\r\n\r\n\"Sleep protocol engaged. Beanie One will maintain watch. Rest now, Jaune.\"\r\n\r\nIt was the first time she'd used his actual name over the walkie-talkie in two years. Somehow, that felt more significant than anything else, \"Fine,\" he whispered, \"Goodnight May. Over and out.\" As he closed his eyes, he could have sworn he heard the faintest rustle from somewhere up in the shadowy ceiling. But when he opened them again to look, there was nothing to see but darkness.\r\n\r\n[line break]\r\n\r\n\"Aaaaaaaaaaaaahhhhhhhhhhh!\"\r\n\r\nJaune was flying - no, plummeting - through the air above the Emerald Forest, arms and legs flailing wildly. The wind whipped past his face as gravity did its inevitable work. How had this happened? One minute he was standing on a platform listening to Headmaster Ozpin's cryptic instructions about finding \"relics\" in the forest, making eye contact with the first person they saw to determine partners for the next four years, and the next minute...\r\n\r\nHe'd been literally catapulted into the sky. No warning. No parachute. No flight plan. Just whoosh and suddenly airborne.\r\n\r\n\"Blonde Shield, trajectory analysis indicates imminent tree collision. Tuck and roll on impact. Over.\"\r\n\r\nEven in his panic, Jaune fumbled for the walkie-talkie strapped to his belt, \"NOT HELPING, MAY! OVER!\" He crashed through the upper canopy of the Emerald Forest, bouncing painfully from branch to branch before slamming into the ground with a pitiful groan. He lay spread-eagle on the forest floor, staring up at the bits of blue sky visible through the leaves, seriously questioning every life choice that had led him to this moment.\r\n\r\nThe walkie-talkie crackled again, \"Blonde Shield, I see you've achieved landing. Status report. Over.\"\r\n\r\n\"I hate everything,\" Jaune moaned, \"Especially you right now. Over.\"\r\n\r\n\"Medical assessment indicates bruised ego only. Aura is at 73%. Turn around. Over.\"\r\n\r\n\"What?\" Jaune groaned and pushed himself to his feet, brushing twigs and leaves from his hair, \"Why? Over.\"\r\n\r\n\"Just turn around. Over.\"\r\n\r\nSighing, Jaune did as instructed, scanning the forest behind him. At first, he saw nothing but trees and underbrush. Then, barely visible through the foliage, he caught a flash of light - the unmistakable glint of sunlight on glass. A sniper scope, he realized, nearly a hundred feet away.\r\n\r\nHis scroll beeped loudly. Jaune pulled it from his pocket and stared at the notification:\r\n\r\n[PARTNERSHIP CONFIRMED: Jaune Arc & May Zedong]\r\n\r\nBelow the text were their profile pictures side by side - his caught mid-sneeze, eyes half-closed and face contorted, while May's was literally just a close-up of her beanie. No face. No identifying features. Just a pink and black beanie.\r\n\r\n\"You've gotta be kidding me!\" Jaune shouted, throwing his hands up in exasperation, \"How does THAT count as eye contact?! I can't even see you! Your profile picture is a HAT!\"\r\n\r\nThe walkie-talkie crackled with what sounded suspiciously like a snicker before May's voice returned to its usual professional tone, \"Official partnership established. Mission parameters updated. We're partners now, Blonde Shield.\" There was the briefest pause before she added, \"Oh, and Beowolfs incoming at six o'clock. Over.\"\r\n\r\n\"What?!\" Jaune spun around just in time to see a massive black shape lunging at him from the shadows. He screamed - a high-pitched, undignified sound that was a far cry from the manly battle cries he always imagined - and barely managed to get his shield up in time. Claws scraped against metal with a horrible shriek as the Beowolf's momentum pushed him backward.\r\n\r\nCRACK!\r\n\r\nThe Grimm's head exploded in a puff of black mist, the shot so perfectly placed it had gone right between its eyes.\r\n\r\nTwo more Beowolfs emerged from the bushes, red eyes gleaming. Jaune steadied his shield, heart pounding. Before the creatures could pounce, one jerked violently as another shot tore through its throat. The remaining Beowolf charged, and Jaune braced himself, shield forward.\r\n\r\n\"Hold position, Blonde Shield. Three... two...\"\r\n\r\nHe stood his ground as the monster barreled toward him.\r\n\r\n\"One...\"\r\n\r\nThe Beowolf leaped, jaws open wide.\r\n\r\nCRACK!\r\n\r\nAnother perfect shot. The creature disintegrated in midair, its ashes raining down on Jaune's upraised shield.\r\n\r\n\"Symbiotic relationship,\" May's voice came through the walkie-talkie, sounding almost cheerful, \"You draw them in, I take them out. Just like we practiced. Over.\"\r\n\r\n\"I'm not a fan of a being a meat shield, May!\" Jaune yelled, spinning in a circle, trying to spot where the shots had come from. The scope glint was gone now, May having already changed positions, \"And I didn't draw them in! They just attacked me!\"\r\n\r\n\"You make an excellent target, Blonde Shield. It's a compliment. Over.\"\r\n\r\nJaune slumped against a tree, trying to calm his racing heart, \"Four years,\" he muttered, \"Four years of this.\"\r\n\r\n\"Actually,\" May's voice chirped, \"Statistically speaking, most first-year teams lose at least one member due to injury, expulsion, or death, so-\"\r\n\r\n\"Not helping, May!\"\r\n\r\n\"Heading toward objective now. Follow the markers.\" There was a brief pause, \"Also? Nice scream. Very high-pitched. Probably attracted every Grimm within a mile radius. Over and out.\"\r\n\r\n\"What markers?\" Jaune looked around in confusion before spotting a small pink ribbon tied to a nearby branch. As he approached it, he noticed another one about fifty feet ahead. He sighed, sheathed his sword, and started walking. He wasn't even going to question how she'd tied those up considering the Initiation started maybe five minutes ago.\r\n\r\nFour years of being invisible bait for a sniper he couldn't see. Perfect. Just perfect.\r\n\r\n[line break]\r\n\r\n\"Weiss Schnee, May Zedong, Jaune Arc, and Pyrrha Nikos,\" Headmaster Ozpin announced on the stage, his voice echoing through the packed auditorium, \"The four of you retrieved the white rook pieces. Congratulations.\"\r\n\r\nJaune stood on stage next to Pyrrha and Weiss, acutely aware of the empty space where May should have been standing. Not a single person in the audience or on stage seemed to find this strange. Pyrrha smiled politely, while Weiss stood ramrod straight, practically vibrating with anticipation.\r\n\r\n\"From this day forward, you will work together as Team WMJP led by...\" Ozpin paused, taking a sip from his ever-present mug, \"Weiss Schnee.\" The white-haired heiress's face lit up with a smile so bright it was almost blinding. Polite applause filled the hall as a graphic displayed their faces on the giant screen above. Well, three faces and one beanie.\r\n\r\n\"Congratulations, young lady,\" Ozpin said to Weiss before his eyes drifted to the empty spot beside Jaune. He gave the slightest nod in that direction, as if acknowledging someone invisible, before moving on to announce the next team.\r\n\r\n\"Did he not notice May isn't here?\" Jaune whispered to Pyrrha. The redhead just shrugged.\r\n\r\nThe walkie-talkie at Jaune's hip crackled as soon as they were off the stage, \"Mission accomplished, Blonde Shield. Team designation achieved. Headmaster briefed on special tactics training. Ice Queen as commander will require adjustment. Over.\"\r\n\r\n\"What did she just call me?\" Weiss snapped, whipping her head toward the walkie-talkie in Jaune's hand.\r\n\r\nJaune winced, \"Uh...\"\r\n\r\n\"I heard that! Give me that device immediately!\" Weiss demanded, holding out her hand imperiously. Jaune could already tell that she was someone used to getting what she wanted. Reluctantly, Jaune handed over the walkie-talkie. Weiss snatched it and pressed the button forcefully, \"Listen here, May Zedong, or whatever your real name is. I am your team leader, and I will be addressed as Weiss or Miss Schnee. Is that clear? Over.\" She added the last word with dripping sarcasm.\r\n\r\nThe walkie-talkie crackled in response, \"Negative, Ice Queen. Codenames establish operational security. Your designation is Ice Queen. Mine is Beanie One. Blonde Shield is Jaune. Red Warrior is Pyrrha. Over.\"\r\n\r\nWeiss's face flushed crimson, \"That is NOT my designation! I am the heiress to the Schnee Dust Company and your LEADER! You will show proper respect! ...Over!\"\r\n\r\n\"Respect is earned, not given. Also, your left boot has a scuff. Over.\"\r\n\r\nWeiss immediately looked down at her pristine white boots, \"What? Where? I don't see-\" She stopped, realizing she'd been tricked, and glared at the walkie-talkie, \"Very mature! And where exactly are you anyway? You're supposed to be part of this team! Over!\"\r\n\r\n\"I'm exactly where I need to be. Perimeter secure. Over.\"\r\n\r\nThe awkwardness only intensified that night as the newly-formed Team JWPM settled into their dorm room. Four beds, four desks, four sets of drawers.\r\n\r\nThree students.\r\n\r\nThe team dorm room was spacious enough, with four beds arranged neatly along the walls, four desks, and a door leading to their shared bathroom. Jaune dropped his meager belongings onto the bed farthest from the door while Pyrrha gracefully claimed the one beside it.\r\n\r\nAlmost an hour later, Weiss paced the center of the room, clipboard in hand, \"Now then, Team Winter-\"\r\n\r\n\"Winter?\" Jaune interrupted, \"I thought we were Team WMJP?\"\r\n\r\nWeiss rolled her eyes dramatically, \"WMJP is pronounced 'Winter,' Arc. Do try to keep up.\" Was it? He sure as hell didn't get that from that combo of letters, but what did he know? \"As I was saying, as Team Winter's leader, I've already prepared a schedule for us.\" She brandished the clipboard, \"Wake-up call is at 5 AM sharp, followed by morning training exercises, breakfast at precisely 7:15, and then classes. I've color-coded study periods and-\"\r\n\r\nThe walkie-talkie, now back in Jaune's possession, crackled loudly, \"Negative on 5 AM, Ice Queen. Optimal sleep cycle for combat readiness requires minimum six hours. Night surveillance concludes at 2 AM. Over.\"\r\n\r\nWeiss stomped her foot, \"Stop calling me that! And how dare you contradict your team leader!? If I say wake-up is at 5 AM, then wake-up is at 5 AM! Over!\" She snatched the walkie-talkie from Jaune again.\r\n\r\n\"Your leadership extends to combat and academics, not my sleep cycle. Also, your color-coding system is inefficient. Red should be for combat classes, not history. Over.\"\r\n\r\n\"How do you know my color-coding system?!\" Weiss spluttered, frantically flipping through her clipboard pages.\r\n\r\n\"I can see your clipboard from here. Handwriting analysis suggests high-strung personality. Over.\"\r\n\r\n\"WHERE ARE YOU?!\" Weiss spun around wildly, searching every corner of the room.\r\n\r\nPyrrha cleared her throat gently, \"Perhaps we could discuss the schedule as a team?\"\r\n\r\n\"That's what I'm trying to do!\" Weiss shouted, gesturing at the empty fourth bed, \"But one of our so-called teammates refuses to even be present!\"\r\n\r\n\"I'm present. Just not visible. Operational security. Over.\"\r\n\r\n\"That doesn't make any sense!\" Weiss fumed, \"How are we supposed to function as a team if you're not physically here? Where will you sleep? How will you attend classes?\"\r\n\r\n\"Don't worry about it. Class attendance records will show full participation. Sleep arrangements classified. Over.\"\r\n\r\n\"Classified?! We're in the same team! There are no classified arrangements in a team!\"\r\n\r\n\"Tell that to the Headmaster. Check your scroll, Ice Queen. Special dispensation filed and approved. Over.\"\r\n\r\nWeiss angrily pulled out her scroll, tapping and swiping with vicious precision. Her eyes widened, then narrowed dangerously, \"How did you get access to my academic email? And how did you get Headmaster Ozpin to approve this... this farce?!\"\r\n\r\n\"I've got my ways. Also, your toothbrush is upside down in the holder. Over.\"\r\n\r\nWeiss's head snapped toward the bathroom door, which was firmly closed, \"You've been through my personal cabinet?! How? We've been here for the past hour and we didn't see or hear you!\"\r\n\r\n\"Perimeter check includes all entry points. Over.\"\r\n\r\n\"This is an invasion of privacy!\" Weiss was practically shouting now, \"When did you even- I didn't see anyone- Jaune, make her stop this nonsense!\"\r\n\r\nJaune, who'd been watching the exchange with a mixture of amusement and resignation, shrugged, \"Trust me, I've been trying for two years. You'll get used to it.\" He lay down on the bed. A part of him hoped he'd see May in their room once they got to Beacon. After all, she always talked about how they'd be partners. He should've known better.\r\n\r\n\"I most certainly will not! I refuse to 'get used to' an invisible teammate who calls me Ice Queen and spies on me!\"\r\n\r\nThe walkie-talkie crackled again, \"Not spying. Surveillance. Different objective. Primarily watching Blonde Shield. You're collateral observation. Over.\"\r\n\r\n\"COLLATERAL?!\" Weiss' voice rose to a pitch that threatened to shatter glass. Jaune didn't know what she was more offended by: the fact that she was being spied on or the fact that she was considered secondary in said spying.\r\n\r\nPyrrha stepped forward with her hands raised, \"I think what May means is that her primary focus is on team security, not personal observation.\" She smiled at the empty space near the ceiling corner. Was that where May was or was Pyrrha just guessing? \"Isn't that right, May?\"\r\n\r\nThere was a pause before the walkie-talkie responded, \"Red Warrior understands. Ice Queen should take notes. Over.\"\r\n\r\nWeiss looked ready to explode. She thrust the walkie-talkie back at Jaune and stomped to her bed, \"I'm going to file a formal complaint tomorrow. This arrangement is completely unacceptable for a proper Huntsman team!\"\r\n\r\n\"Already filed counterpoint documentation. Precedent established with Atlas Academy special ops training. Over.\"\r\n\r\n\"How do you-\" Weiss started, then threw her hands up in defeat, \"Fine! Hide wherever you want! But I expect you to participate in all team activities and training sessions, visible or not!\"\r\n\r\n\"Affirmative, Ice Queen. Already participated in more training sessions than you. Marksmanship scores available upon request. Over.\" As Weiss fumed silently on her bed, Jaune caught Pyrrha's eye. The champion fighter raised an eyebrow, and Jaune just shrugged. Another day, another bizarre May interaction.\r\n\r\nLater, as the lights were turned out and everyone settled into their beds - three occupied, one conspicuously empty - the walkie-talkie buzzed one last time.\r\n\r\n\"Goodnight, Blonde Shield. Goodnight, Red Warrior.\" There was a slight pause, \"Goodnight, Ice Queen. Despite operational friction, looking forward to successful mission parameters with Team Winner. Over and out.\"\r\n\r\n\"It's Team Winter!\" Weiss hissed into the darkness.\r\n\r\nFrom somewhere - maybe the vents, maybe the hallway, maybe even outside the window - came a sound suspiciously like a snicker.\r\n\r\n[line break]\r\n\r\nOne week into their time at Beacon, and Jaune was starting to develop a routine. Wake up to May's voice over the walkie-talkie (\"Perimeter secure, rise and shine, Blonde Shield. Over.\"), attend classes where professors mysteriously marked May as present despite her obvious absence, and try to survive Weiss's increasingly vocal complaints about their phantom teammate.\r\n\r\n\"I've filed THREE formal complaints this week alone,\" Weiss had fumed that morning, furiously brushing her hair as Jaune tried to eat his breakfast, \"And every single one has been returned with 'special dispensation already granted' stamped on it. In RED!\"\r\n\r\nToday they were having lunch in the cafeteria with their sister team, Team RYBR (Rhubarb), led by by Ruby. It was their usual table arrangement. Weiss sat ramrod straight beside Pyrrha at the right edge of the bench, complaining to anyone who listened. Pyrrha did her best to keep the peace and smiled politely at everyone, though he could tell she was flagging. Across from them sat Ruby, her partner (and sister) Yang, Blake, and Ren. Jaune sat on Pyrrha's other side and to his left was... well, nothing. Just an empty space where a teammate should be.\r\n\r\n\"So, I haven't said anything,\" Yang started, pointing her fork at Jaune, \"But are we seriously gonna pretend this May person is real? Cuz I've been here a week and haven't seen her once.\"\r\n\r\nWeiss snorted derisively, \"Join the club. I LIVE with her - supposedly - and haven't caught so much as a glimpse.\"\r\n\r\n\"She's real,\" Jaune sighed, pushing his potatoes around his plate, \"She just... doesn't do the whole 'being seen' thing.\"\r\n\r\n\"Affirmative. Beanie One exists. Over,\" May's voice crackled from the walkie-talkie at his hip.\r\n\r\nYang rolled her eyes, \"Right. So you just walk around talking to a walkie-talkie and we're all supposed to buy it? That's kinda sad, Jaune.\"\r\n\r\n\"She's not made up,\" Jaune said, feeling like he'd had this conversation a thousand times before. Even people back home, people who definitely saw May with him growing up, started wondering if she was a collectivel hallucination. May seemed oddly proud of that fact, \"We've been friends since we were kids. She just... got weird about the whole visibility thing.\"\r\n\r\n\"Uh-huh,\" Yang said, clearly unconvinced, \"And this totally real partner of yours never comes to class, never eats lunch, and never sleeps in your dorm. Sure, totally checks out.\"\r\n\r\n\"The professors do mark her present,\" Pyrrha offered gently, \"And she does respond when we need her.\"\r\n\r\n\"Which is exactly why I'm so frustrated!\" Weiss cut in, \"If she can get away with skipping everything while still getting full credit, why can't I? Do you know how much more efficiently I could be using my time?\"\r\n\r\nInstead of responding, the walkie-talkie stayed quiet. Jaune felt that familiar prickle at the back of his neck - the one he always got right before May did something drastic, \"Uh, Yang, maybe don't - \"\r\n\r\n\"What?\" Yang laughed, \"Is your fake friend gonna get mad at me or something? Ooooh, I'm sooo scared.\"\r\n\r\n\"Seriously, Yang, I wouldn't-\" Jaune shut up when he saw it: a small red dot appearing on Yang's chest, right over her heart. Everyone at the table went dead silent. Ruby's eyes went huge. Ren stopped mid-bite. Even Weiss held her breath, \"Um, Yang,\" Jaune whispered, \"Don't move.\"\r\n\r\n\"Huh?\" Yang glanced down and spotted the laser sight. The red dot inched its way up her chest, over her neck, and stopped right between her eyes, \"Oh, come on!\"\r\n\r\n\"Yang,\" Ruby squeaked, \"I think May is real.\"\r\n\r\n\"Yeah, right,\" Yang scoffed, though she didn't sound as confident anymore, \"Like someone's actually got a gun on me in the middle of the cafeteria. This has gotta be some stupid trick.\"\r\n\r\nThe walkie-talkie crackled, \"Permission to fire warning shot? Over.\"\r\n\r\nJaune groaned, \"May, seriously, don't - \"\r\n\r\n\"Oh, sure!\" Yang leaned toward the walkie-talkie with a smirk, \"Go ahead, 'May'. Take your best shot.\" She made air quotes around the name.\r\n\r\nA second of silence. Then - from somewhere Jaune couldn't pinpoint - came a soft pop.\r\n\r\nYang's head jerked back as something small hit her right between the eyes. Her Aura flashed, absorbing the impact, but her face was pure shock, \"What the HELL?!\" Yang shouted, jumping to her feet, eyes flashing red as her hair started to burn, \"Did someone just shoot me?!\"\r\n\r\n\"Warning shot delivered,\" May's voice announced through the walkie-talkie, \"BB pellet, non-lethal. Could've been worse. Consider yourself lucky, Firecracker. Over.\"\r\n\r\nThe cafeteria went quiet, everyone staring at their table as Yang spun around, searching, \"Where are you?!\" Yang demanded, spinning in a circle, \"Get out here!\"\r\n\r\n\"Yang, seriously, you're not going to find her,\" Jaune said, \"Nobody ever does.\"\r\n\r\n\"Oh yeah? Watch me!\" Yang started stalking between the cafeteria tables, checking under them, behind pillars, in corners, \"Come out, come out, wherever you are! I just wanna talk!\" She threw open a trash lid.\"\r\n\r\nThe red dot reappeared, once again placing itself squarely between Yang's eyes, despite her constant movement.\r\n\r\nPop!\r\n\r\nAnother BB pellet struck her in the exact same spot.\r\n\r\n\"AGH!\" Yang clutched her forehead, more surprised than hurt. With her Aura, it must've been like being flicked. Annoying, but not actually painful, \"Stop that!\"\r\n\r\n\"Surrender advised,\" May's voice came through the walkie-talkie, calm as ever, \"You are outmatched. Over.\"\r\n\r\n\"Like hell I am!\" Yang spun around, facing the opposite direction, \"You just got lucky twice!\"\r\n\r\nThe red dot appeared between her eyes again, somehow, despite her facing a completely different direction.\r\n\r\nPop!\r\n\r\n\"HOW?!\" Yang bellowed. She ducked behind a pillar and stayed there before peering out cautiously ten seconds later.\r\n\r\nThe red dot appeared on her forehead the instant she looked out.\r\n\r\nPop!\r\n\r\n\"THAT'S IMPOSSIBLE!\" Yang shouted, now using a lunch tray as a shield as she ran in a zigzag pattern between tables.\r\n\r\nThe dot appeared on her forehead the second she lowered the tray to see where she was going.\r\n\r\nPop!\r\n\r\n\"WOULD YOU STOP THAT?!\"\r\n\r\nBy now, the entire cafeteria was watching Yang's frantic search, many students laughing as she was repeatedly pegged with perfect accuracy no matter where she moved, \"FINE!\" Yang finally shouted, throwing her hands up in surrender and stomping back to their table, \"Your creepy invisible partner exists! Happy now?\"\r\n\r\n\"Firecracker neutralized,\" May announced, sounding just a little smug, \"Target practice complete. Over.\"\r\n\r\nYang slumped into her seat, rubbing the spot between her eyes, \"Your partner's a weirdo, Jaune.\" She growled.\r\n\r\n\"Yeah, I know,\" Jaune shrugged.\r\n\r\n\"But also AMAZING!\" Ruby squealed, practically vibrating with excitement, \"Those shots were perfect! No matter where Yang moved! Pop!\" Yang scowled at her little sister, but she paid her no mind, \"May, what kind of rifle do you use? Is it a custom build? What's your effective range? Is it a bolt action or semi-automatic? Does it transform like Crescent Rose? How many rounds per minute can you fire? What's your preferred ammunition?\"\r\n\r\nThe walkie-talkie crackled with what almost sounded like a soft chuckle.\r\n\r\n\"Modified M24A2. Custom barrel. Effective range two miles with standard loads. Bolt action. Transforms into compact form for urban deployment. No melee form. Seventy-six confirmed Grimm kills at one mile plus. And no, not as cool as Crescent Rose, but more practical for extended surveillance. Over.\"\r\n\r\nRuby looked like she might faint from pure joy, \"Can I SEE it? Please? PLEASE?!\"\r\n\r\n\"Negative on visual inspection,\" May replied, \"But willing to discuss specifications. Weapon talk is acceptable mission parameter. Over.\"\r\n\r\n\"YES!\" Ruby pumped her fist in the air, \"Jaune, can I borrow your walkie-talkie after lunch? May and I need to have a serious talk about optimal scope magnification for urban versus woodland environments!\"\r\n\r\n\"Go for it,\" Jaune said, honestly relieved that someone was excited about his partner's weirdness. He wasn't much of a weapon junkie. He knew how to fire a gun - living outside the walls means you needed to know how to shoot a rifle in case of sudden Grimm attacks - but all he really knew was how to insert the magazine and aim down the sights. He was only marginally better with a sword and shield. Thank the Brothers he was a sack of Aura who knew how to take a hit.\r\n\r\n\"This is ridiculous,\" Weiss huffed, stabbing at her salad with unnecessary force, \"We have a teammate who shoots people in the cafeteria, never attends classes, never sleeps in her assigned bed, and somehow has the school administration wrapped around her finger. Am I the only one who sees how absurd this is?\"\r\n\r\n\"I dunno,\" Blake said quietly, eyeing the walkie-talkie with interest, \"Having someone watching your back that nobody can see... it seems kinda cool, actually. Knowing someone's always watching over you.\"\r\n\r\n\"It's WEIRD,\" Weiss insisted, \"How am I supposed to coordinate team attacks with someone I can't even locate? How are we supposed to train together? The Vytal Festival Tournament is only months away, and I refuse to be embarrassed because one-fourth of our team is a disembodied voice!\"\r\n\r\n...\r\n\r\nThe red dot reappeared, this time landing right on the tiara on Weiss' perfect ponytail.\r\n\r\n\"Don't you dare!\" Weiss yelped, diving under the table.\r\n\r\n\"May,\" Jaune said into the walkie-talkie, \"We talked about this. No shooting the team leader.\"\r\n\r\nA disappointed sigh crackled through, \"Fine, Blonde Shield. Ice Queen remains un-pelleted. For now. Over.\"\r\n\r\n\"STOP CALLING ME THAT!\" Weiss shrieked from under the table.\r\n\r\nJaune looked around at his friends - Yang rubbing her forehead and glaring at empty air, Ruby bouncing excitedly, Blake hiding a smile behind her book, Ren calmly eating, Pyrrha looking politely confused, and Weiss refusing to come out from under the table. This was his life now. And somehow, despite all the craziness, he found himself smiling.\r\n\r\n\"Hey, May?\" he said quietly into the walkie-talkie.\r\n\r\n\"Yeah, Blonde Shield? Over.\"\r\n\r\n\"Nice shooting. Over.\"\r\n\r\nThere was a pause. Then, \"Thanks, Jaune. Over and out.\"\r\n\r\n[line break]\r\n\r\nPoor Weiss. Good thing Jaune doesn't flirt with her in this version of the story or you just know May would've eben constantly pelting her ass with BBs. Next chapter will switch the POV to Weiss and should be the last one."
    },
    {
      "title": "Chapter 2",
      "text": "Next chapter. This is now a threeshot. Yeah, sorry, I figured Jaune and May's date deserves its own chapter to shine.\r\n\r\n[line break]\r\n\r\nWeiss believed in order. She believed in discipline, in protocol, in the proper way of doing things. That's how she was raised, how she was trained, and how she'd always approached life. As the heiress to the Schnee Dust Company, she understood better than most that presentation and conduct were everything. People were vicious and merciless, and she learned at a young age to put on a perfect mask of control. Of efficiency.\r\n\r\nWhich was precisely why she was currently contemplating the most efficient way to disappear into the floor of Professor Goodwitch's combat arena.\r\n\r\n\"For our next match,\" Professor Goodwitch announced, tapping her scroll with practiced precision, \"Ruby Rose versus May Zedong.\"\r\n\r\nThe combat class arena fell into an awkward silence as Ruby enthusiastically bounded onto the stage, her red cape fluttering behind her. She took her position, unfolded Crescent Rose with a dramatic flourish, and then... stood there. Looking around. Waiting for an opponent who - as Weiss knew all too well - would never appear.\r\n\r\n\"This is a nightmare,\" Weiss hissed, sinking lower in her seat, \"An absolute nightmare.\"\r\n\r\nBeside her, Jaune shifted uncomfortably, his ever-present walkie-talkie clutched in his hand. Pyrrha, ever the diplomat, patted Weiss's shoulder sympathetically, \"Perhaps May has a... plan?\" Pyrrha said, though her tone suggested even she didn't believe it.\r\n\r\n\"A plan?\" Weiss whispered furiously, \"A plan? The plan is clearly to humiliate us all! Again!\"\r\n\r\nDown in the arena, Professor Goodwitch was looking increasingly irritated, her riding crop tapping against her palm, \"Miss Zedong? Please take your position.\"\r\n\r\nThe seconds ticked by. Ruby shifted awkwardly from foot to foot, looking around with a mixture of confusion and anticipation. Some students started whispering. Someone in the back row snickered. Jaune's walkie-talkie crackled to life, \"Beanie One in position. Ready for combat simulation. Over.\" Everyone's heads swiveled toward the sound. Weiss felt her face burning with mortification. This was her team. Her responsibility as leader. And it was a circus.\r\n\r\nProfessor Goodwitch strode over and held out her hand. Jaune, looking like he'd rather be anywhere else, reluctantly handed over the walkie-talkie, \"Miss Zedong,\" Professor Goodwitch said, her voice cold as ice, \"While I understand that Headmaster Ozpin has granted you certain... accommodations for your training methodology, I cannot in good conscience conduct a match where one participant has no opportunity to engage with their opponent.\"\r\n\r\nThe walkie-talkie crackled again, \"With respect, Professor, I'm a sniper. If I'm in a position where my opponent can engage me in close quarters, I've already failed. This is tactically sound training. Over.\"\r\n\r\nWeiss thought her teeth might crack from how hard she was clenching her jaw. She had made it her personal mission to be the perfect student, the perfect team leader, and somehow ended up with... whatever this was. A ghost she was halfway convinced was a mass hallucination and her partner who made excuses about how 'that's just how she is'. The only bright spot was Pyrrha, and she couldn't even enjoy the privelege of being partners with the Invincible Girl with this hanging over head.\r\n\r\nProfessor Goodwitch's expression suggested she was contemplating throwing the walkie-talkie across the room, \"Miss Zedong, in a tournament setting-\"\r\n\r\n\"I'm fine with it!\" Ruby chirped from the arena, her voice echoing slightly. She twirled Crescent Rose and grinned, \"I'll just have to find her!\"\r\n\r\nWeiss couldn't believe what she was hearing. Ruby was actually going along with this farce? \"Don't encourage her!\" she muttered, though of course Ruby couldn't hear.\r\n\r\n\"I mean, she's got to be somewhere in here, right?\" Ruby continued, scanning the rafters, the corners, the stands, \"I'll just use my speed and-\"\r\n\r\nPOP!\r\n\r\nA small projectile hit Ruby square in the forehead, causing her to stumble back a step. Her Aura meter on the display screen dropped by precisely 10%.\r\n\r\nRuby blinked, then rubbed her forehead, \"Wow! That was... fast.\" Weiss didn't know whether to be relieved or infuriated that the reaper didn't even seem annoyed.\r\n\r\nGoodwitch's face could have frozen fire Dust. She raised the walkie-talkie, \"Miss Zedong! This is not an appropriate demonstration of combat skills. One more unsanctioned attack and you will be disqualified and sent to the Headmaster's office!\"\r\n\r\nWeiss buried her face in her hands. Not again. Not another incident. Not another meeting where she had to explain why one-fourth of her team was an invisible menace with apparently no respect for authority, decorum, or basic social norms.\r\n\r\n\"No it's fine!\" Ruby started, \"I can find-\"\r\n\r\nPOP!\r\n\r\nAnother perfect shot to the forehead. Ruby's Aura dropped another 10%.\r\n\r\n\"-her.\" Ruby finished weakly, the red mark on her forehead matching her cape. The classroom erupted in a mix of laughter and shocked gasps. Yang was already on her feet, eyes flashing red. Blake was unsuccessfully trying to hold her back.\r\n\r\n\"Miss Zedong!\" Professor Goodwitch's voice cut through the chaos like a blade, \"You are disqualified! Report to Headmaster Ozpin's office immediately!\"\r\n\r\nThe walkie-talkie emitted what sounded suspiciously like a sigh, \"Mission parameters acknowledged. Withdrawing from combat simulation. Over and out.\"\r\n\r\nA hush fell over the classroom as everyone seemed to collectively wonder if May would actually follow the order. Or if she was even capable of being \"sent\" anywhere. Goodwitch handed the walkie-talkie back to Jaune with such force he nearly fell out of his seat, \"Mr. Arc, please ensure your... partner receives this message.\" She turned to address the class, \"For our next match, Yang Xiao Long versus Cardin Winchester.\"\r\n\r\nAs Yang practically vaulted into the arena, her hair already glowing with anticipation (or perhaps leftover anger from Ruby's treatment), Weiss turned to Jaune with murder in her eyes, \"This,\" she said, her voice a quiet tremor of rage, \"Is absolutely unacceptable.\"\r\n\r\nJaune winced, \"Yeah, I know, but-\"\r\n\r\n\"No! No 'buts'!\" Weiss jabbed a finger at him, \"I have worked too hard, sacrificed too much, to have my academic record tarnished by this... this mess! Do you know what my sister will say when he hears about this?! Do you have ANY idea how this reflects on me as your leader?!\"\r\n\r\n\"Ice Queen's blood pressure reaching critical levels,\" said May's voice from the walkie-talkie, somehow still audible even over the sounds of Yang now thoroughly destroying Cardin in the arena, \"Recommend deep breathing exercises. Over.\"\r\n\r\n\"I will END you!\" Weiss hissed at the device, grabbing for it. Jaune held it out of reach, looking genuinely concerned she might smash it, \"When I find you - and I WILL find you - I will freeze you solid and ship you back to whatever hole you crawled out of! Do you hear me?!\" Professor Goodwitch looked at her red face then deliberately looked away without a reprimand.\r\n\r\nPyrrha placed a calming hand on Weiss's arm, \"Perhaps we should discuss this back in our room? As a team?\"\r\n\r\n\"What team?\" Weiss threw up her hands, \"We're not a team! We're a collection of misfits with a ghost!\"\r\n\r\nThe walkie-talkie crackled, \"Not a ghost. Just highly specialized in covert operations. Also, your left sleeve has a loose thread. Over.\"\r\n\r\nWeiss looked down at her pristine white sleeve automatically, then cursed herself for falling for it again, \"That's it! Team meeting. Now.\" She stood up so forcefully her chair screeched against the floor, \"And May WILL be there, physically present, or I'm going straight to the school board!\"\r\n\r\n\"Now, Weiss,\" Pyrrha started, \"Perhaps we should-\"\r\n\r\n\"No! I've had enough!\" Weiss was past caring who heard her at this point. Professor Goodwitch kept dutifully pretending she didn't notice, \"I'm tired of being embarrassed! I'm tired of wondering where one-fourth of my team is at any given moment! An I'm tired of being called 'Ice Queen'!\"\r\n\r\nThe entire class was now staring at her, even Yang and the barely-conscious Cardin. Professor Goodwitch stared ahead and blankly announced Yang's victory even though no one was paying attention. The walkie-talkie crackled one more time, \"Team meeting acknowledged. Will comply with visibility request. Just this once. Blonde Shield, Red Warrior, Ice Queen - meet at dorm in twenty minutes. Over and out.\"\r\n\r\nWeiss froze. Wait. Did May just agree to show herself? After all this time? Jaune's shocked expression suggested this was a shock to him too. Even Pyrrha looked stunned. The heiress straightened her skirt, lifted her chin, and tried to regain her composure, \"Well. Good. Twenty minutes. We'll... see you there.\"\r\n\r\nAs she marched out of the classroom with as much dignity as she could muster, Weiss couldn't shake the feeling that she had somehow walked right into May's crosshairs. Again.\r\n\r\nMinutes later, Weiss paced the length of their dorm room, checking her scroll every thirty seconds. Eighteen minutes had passed since May's unexpected agreement to show herself. Her heart raced with anticipation. Finally, she would confront the source of her mounting frustration face-to-face. No more hiding behind radios and stupid code names!\r\n\r\n\"Do you really think she'll show up?\" Pyrrha asked, sitting primly on the edge of her bed. She looked simultaneously hopeful and doubtful.\r\n\r\n\"She better,\" Weiss snapped, \"I've had enough of this... this farce! We're supposed to be a prestigious Huntsman team, not some circus act!\"\r\n\r\nJaune sat on his bed, fidgeting nervously with the walkie-talkie. The device had been suspiciously silent since they'd left the combat classroom, \"Um, Weiss? I think she - \"\r\n\r\n\"No!\" Weiss pointed an accusatory finger at him, \"No excuses, no warnings, no 'that's just how May is' nonsense. I demand a proper teammate!\" The door to their dorm room remained firmly closed. Nineteen minutes, \"If she's not here in the next sixty seconds,\" Weiss said, voice vibrating with tension, \"I'm going straight to Ozpin and demanding a team reassignment.\"\r\n\r\nJaune winced, \"About that-\"\r\n\r\nThe walkie-talkie crackled to life, \"Beanie One approaching rendezvous point. Prepare for visual contact. Over.\"\r\n\r\nWeiss spun toward the door, straightening her posture and composing her face into what she hoped was an intimidating yet professional expression. This was it. She would finally see the face of the person who'd been driving her to the brink of insanity.\r\n\r\nTwenty minutes. On the dot. The door didn't open.\r\n\r\n\"Where is she?\" Weiss demanded, checking her scroll again, \"It's been twenty minutes!\" Jaune sighed deeply, stood up, and walked to the empty bed that was supposedly May's. He placed the walkie-talkie on the pillow, \"What are you doing?\" she asked, narrowing her eyes.\r\n\r\n\"Just... wait,\" Jaune muttered, retreating to his own bed with a resigned expression. Ten seconds later, the window slid open a fraction. A slender arm in a pink and brown sleeve reached through the gap, threw something on the empty bed, then disappeared as quickly as it had appeared.\r\n\r\nWeiss stared in disbelief at what had been left behind.\r\n\r\nA pink and black beanie, the walkie-talkie now propped neatly against it.\r\n\r\n\"What,\" Weiss managed through clenched teeth, \"Is that?!\"\r\n\r\nThe walkie-talkie crackled, \"Visual confirmation achieved. This is Beanie One, reporting for team meeting as requested. Over.\"\r\n\r\nPyrrha's hand flew to her mouth, either hiding a gasp or a laugh - Weiss couldn't tell and didn't care. She marched over to the bed, snatched up the beanie, and shook it in the air, \"THIS IS NOT COMPLIANCE! THIS IS A HAT!\" If the rooms weren't soundproof, she was sure her voice would've echoed throughout the entire academy.\r\n\r\n\"Correction: This is tactical headgear. Essential component of Beanie One. Over.\"\r\n\r\nWeiss could feel her eye twitching. Her grip on the beanie was so tight her knuckles turned even whiter than usual, \"Where. Are. You?\"\r\n\r\n\"Present and accounted for. Mission parameters fulfilled. Visual element provided. Over.\"\r\n\r\nJaune groaned, flopping back on his bed, \"Yeah, that's what I figured.\"\r\n\r\n\"A HAT IS NOT A PERSON!\" Weiss screeched, her composure finally shattering completely. She threw the beanie across the room where it landed perfectly on Jaune's face, \"This is beyond unacceptable! This is... this is...\"\r\n\r\n\"Efficient use of resources,\" May's voice said 'helpfully' through the walkie-talkie, \"Full physical presence unnecessary for effective communication. Over.\"\r\n\r\nPyrrha, ever the peacemaker, stood and retrieved the beanie, \"Perhaps May has... reasons for maintaining her distance? We could try to understand-\"\r\n\r\n\"No!\" Weiss cut her off, \"No more understanding! No more accommodations! This ends now!\" She marched to the window and flung it wide open, leaning out to scan the grounds below, the rooftop above, the trees nearby, \"I don't care what it takes. I don't care how long it takes. I am going to find you, May Zedong, if it's the last thing I do!\"\r\n\r\nThe walkie-talkie emitted a sound that might have been a chuckle, \"Good luck with that, Ice Queen. Over.\"\r\n\r\nMay took the beanie back that night when they went to sleep. Weiss regretted not planting a bomb on it when she had the chance.\r\n\r\n[line break]\r\n\r\nThree days. Three full days of what could only be described as the most sophisticated manhunt Beacon Academy had ever seen, and Weiss had exactly nothing to show for it.\r\n\r\nShe'd tried everything. Motion sensors hidden in the dorm room (mysteriously disabled within hours). Dust-infused tripwires in all the hallways leading to their room (somehow bypassed without a trace). She'd even attempted to bribe other students to keep watch (they'd all reported seeing absolutely nothing unusual, despite the occasional snack or personal item going mysteriously missing from their stations).\r\n\r\nNothing. Absolutely nothing.\r\n\r\n\"This is insanity,\" Weiss muttered, crossing another failed attempt off her increasingly desperate list. She'd been running on minimal sleep, using every spare minute between classes to set traps and monitor surveillance. She slumped at her desk, staring at the empty bed that was supposedly May's. The beanie sat there mockingly, positioned at a jaunty angle atop the perfectly made sheets. The walkie-talkie beside it had been suspiciously quiet whenever Weiss was alone in the room. Jaune had already gotten an extra one from a dead drop. This one was the 'team walkie talkie'\r\n\r\nEven her complaints to the administration had hit a wall. She'd marched straight to Headmaster Ozpin's office the morning after the \"team meeting\" incident, prepared to demand action.\r\n\r\n\"Ah, Miss Schnee,\" Ozpin had greeted her, somehow looking both surprised and as if he'd been expecting her all along, \"How is Team WMJP settling in?\"\r\n\r\n\"It's not,\" Weiss had said, standing ramrod straight before his desk, \"Sir, I need to formally request a team reassignment. The current situation is untenable.\"\r\n\r\nOzpin had merely sipped his drink, regarding her over the rim of his mug with those unnervingly calm eyes, \"I assume this is about Miss Zedong's... unique training methodology?\"\r\n\r\n\"Unique?\" Weiss practically choked on the word, \"It's not 'unique,' it's disruptive! It's unprofessional! It's-\"\r\n\r\n\"Special training circumstances,\" Ozpin had interrupted, setting down his mug, \"Miss Zedong was admitted to Beacon with a very particular skill set that we value greatly. Her methods, while unconventional, have proven highly effective in the field.\"\r\n\r\n\"But she doesn't even attend classes!\"\r\n\r\n\"Doesn't she?\" Ozpin had raised an eyebrow, bringing up his scroll to display perfect attendance records for May Zedong across all courses, \"Her academic performance has been exemplary.\"\r\n\r\n\"That's impossible! She's never there!\"\r\n\r\n\"Perception and presence are not always the same thing, Miss Schnee.\" Ozpin had smiled that infuriating smile of his, \"If Miss Zedong doesn't wish to be found, then that is her right as a developing Huntress with a specialized combat style.\"\r\n\r\nWeiss had left his office seething, the words \"specialized combat style\" burning in her mind like an insult.\r\n\r\nNow, three days later, she'd nearly reached her breaking point. She couldn't concentrate in class and her combat performance was suffering. She'd even snapped at Klein during their weekly scroll call, which had left her feeling guilty on top of everything else.\r\n\r\nShe was brushing her hair before bed - one hundred strokes, no more, no less, a ritual that usually calmed her - when the realization hit her so suddenly she dropped her brush, \"Polarity,\" she whispered. Pyrrha's Semblance. The ability to control magnetism - to manipulate metal objects with her mind. Pyrrha never made a big show of it (she only told them for the sake of team synergy), concerned that people would think her tournament victories weren't earned through skill. But Weiss knew the Semblance worked because Pyrrha could sense metal, could feel its presence even without seeing it.\r\n\r\nA sniper rifle had metal parts. A lot of them.\r\n\r\nWeiss's reflection smiled back at her, sharp and predatory. It wasn't over yet.\r\n\r\nThe next day after combat training, Weiss watched like a hawk as Jaune left the locker room. She'd timed this perfectly. He'd mentioned at breakfast that he had to meet with Professor Port about an assignment. That meant he'd be alone, which meant...\r\n\r\n\"May will follow him,\" Weiss whispered to herself, satisfaction coiling through her chest. The invisible guardian never let Jaune out of her sight when he was alone; she and Pyrrha were just collateral. Which meant that for the next hour, Pyrrha would be safely away from May's surveillance.\r\n\r\nWeiss waited exactly five minutes after Jaune left, then approached Pyrrha as she was organizing her locker, \"Pyrrha,\" Weiss said, keeping her voice low even though they were alone, \"I need your help with something... confidential.\"\r\n\r\nPyrrha turned, her ever-present polite smile in place, \"Of course, Weiss. What can I do for you?\"\r\n\r\nWeiss glanced around once more before leaning in, \"It's about May.\"\r\n\r\nThe smile on Pyrrha's face faltered slightly, \"Oh? What about her?\"\r\n\r\n\"I need your help to find her.\"\r\n\r\n\"Find her? But Weiss, if she doesn't want to be seen-\"\r\n\r\n\"That's exactly it,\" Weiss said, stepping closer to her partner, \"This situation isn't working. We're supposed to be a team, but how can we function properly with a member who refuses to even show her face? The tournament is coming up, we need to coordinate attacks, develop strategies - \"\r\n\r\n\"I understand your frustration,\" Pyrrha said, closing her locker gently, \"But shouldn't we respect her privacy? She must have her reasons.\"\r\n\r\nWeiss took a deep breath. She'd anticipated this response. Pyrrha was always so accomodating, \"I've thought about that, but this isn't sustainable. What happens when we're in a real combat situation? What if one of us gets hurt because we couldn't properly coordinate? What if she gets hurt and we can't find her to help?\"\r\n\r\nPyrrha's brow furrowed, \"I hadn't considered that.\"\r\n\r\n\"Besides,\" Weiss continued, pressing her advantage, \"Don't you think it's a little odd that Jaune hasn't seen his childhood friend in two years? Even though they're partners? Even though she's supposedly protecting him?\" That struck a nerve. Weiss could see it in the way Pyrrha's eyes darkened slightly. Like her, Pyrrha had to deal with sycophants and false friends who only cared for her because of her position. Strained friendships resonated with her.\r\n\r\n\"What exactly did you have in mind?\" Pyrrha asked cautiously.\r\n\r\nWeiss leaned in closer, \"Your Semblance. You can sense metal, can't you? Even when you can't see it?\"\r\n\r\nUnderstanding dawned on Pyrrha's face, \"You want me to locate May's weapon.\"\r\n\r\n\"It's a large sniper rifle,\" Weiss confirmed, \"Plenty of metal components. If we can pinpoint its location when it's not actively being used against someone's forehead...\"\r\n\r\nPyrrha bit her lip, clearly conflicted, \"I don't know, Weiss. Using my Semblance to essentially spy on a teammate feels... wrong.\"\r\n\r\n\"More wrong than having a teammate who spies on us constantly?\" Weiss countered, \"Who shoots other students? Who embarrasses our team in front of the entire school? Who refuses to participate in basic team functions?\" Silence stretched between them, Pyrrha's internal conflict plain on her face, \"Look,\" Weiss said, softening her tone slightly, \"I'm not suggesting we expose her to the whole school or anything drastic. I just want to have one honest conversation, face-to-face. Team leader to team member. Don't we deserve that much?\"\r\n\r\nPyrrha sighed, her shoulders slumping slightly, \"I suppose when you put it that way... it does make sense to at least try to resolve this tension.\"\r\n\r\n\"So you'll help?\" Weiss couldn't keep the eagerness from her voice.\r\n\r\nAfter a long moment, Pyrrha nodded, \"Yes, I'll help. But Weiss-\" her green eyes fixed on Weiss with unexpected intensity, \"-promise me this isn't about humiliating May or forcing her into something she's truly uncomfortable with. The things you said back in combat class...\"\r\n\r\n\"Of course not,\" Weiss said, perhaps a little too quickly, \"This is about team cohesion. Nothing more. I was just frustrated back then, you understand.\" It wasn't a lie. She planned to have some choice words with the sniper, but she wasn't planning to drag her kicking and screaming in front of a crowd to humilate her. Weiss was a lot of things, but more than anything, she was a Schnee. And Schnees didn't get involved in petty revenge.\r\n\r\n...Most times.\r\n\r\nAs Pyrrha detailed how her Semblance worked and what she'd need to effectively track the rifle, Weiss couldn't help the sharp smile that spread across her face.\r\n\r\nSoon, she thought. Soon.\r\n\r\n[line break]\r\n\r\nWeiss's plan came together with the precision of a well-oiled Atlesian clock.\r\n\r\n\"Jaune,\" she'd said at breakfast, her voice syrupy sweet in a way that made him immediately suspicious, \"I need you to pick up our team's combat class evaluations from Professor Goodwitch and then deliver them to Professor Peach for the joint assessment project.\"\r\n\r\n\"Why can't you do it?\" Jaune had asked around a mouthful of pancakes. Rude.\r\n\r\n\"Because,\" Weiss had said with exaggerated patience, \"I'm your team leader and I'm delegating this important task to you. It needs to be done before noon, and I have a strategy session with Professor Port.\" She'd made up the strategy session, of course, but Jaune didn't need to know that. She'd watched with satisfaction as he trudged off across campus, muttering something about \"team errands\" under his breath.\r\n\r\nTen minutes. That's how long she waited, sitting primly on her bed, pretending to study while Pyrrha organized her notebooks at her desk.\r\n\r\n\"It's time,\" Weiss said, snapping her textbook shut, \"Can you sense her?\"\r\n\r\nPyrrha closed her eyes, her face scrunching slightly in concentration. Her Semblance was subtle - no glowing limbs or dramatic gestures - just a quiet hum of power as she extended her senses outward.\r\n\r\n\"There's...\" Pyrrha began, her voice soft with effort, \"Something large... metallic... with intricate components... consistent with a high-caliber rifle.\" Hm. Impressive. She knew the exact make and components.\r\n\r\n\"Where?\" Weiss was already on her feet.\r\n\r\nPyrrha walked to the window and pointed toward Beacon's central spire, \"The clocktower. Near the top.\"\r\n\r\nWeiss's lip curled into a satisfied smile, \"Perfect.\"\r\n\r\nShe didn't waste another second. With a flurry of white glyphs, Weiss launched herself from their dormitory window, using a technique she'd been perfecting for weeks. Time Dilation - a specialized glyph that altered her temporal perception, allowing her to move at speeds that would make even Ruby Rose envious. It cost some electricity Dust to use, but it was a price she was more than willing to pay.\r\n\r\nThe world blurred around her as she zipped across the campus grounds, a white streak that most students would mistake for a trick of the light. Her glyphs appeared in rapid succession - under her feet, along vertical surfaces, creating a pathway that defied gravity itself. Up the side of the clocktower she ran, her feet barely touching each glyph before she was propelled to the next. The familiar strain of using so much Aura at once burned through her limbs, but Weiss pushed through it. She hadn't spent years training as a Schnee to be stopped by a little exertion.\r\n\r\nWith a final leap, she twisted in mid-air and landed with a decisive thud on the uppermost platform of the clocktower, right where the enormous clock mechanism met the open air.\r\n\r\nA shriek greeted her arrival - high-pitched and startled, followed by a clatter of what sounded like surveillance equipment.\r\n\r\nAnd there she was.\r\n\r\nAfter weeks of mystery, frustration, and increasingly elaborate traps, Weiss was finally face-to-face with May Zedong.\r\n\r\nShe was... not what Weiss had expected. Somehow, in her mind, she'd constructed an image of a stone-cold military type, perhaps with scars and a permanent scowl. Instead, she found herself staring at a young woman with tan skin, rose-colored hair, and wide gray eyes - or rather, one wide gray eye, as the left side of her face was obscured by a beanie identical to the one currently sitting on the empty bed in their dorm room. Instead of the usual outfits of Huntsmen made to stand out, she wore a tracksuit patterned with white and magenta colors.\r\n\r\nMay was frozen in place, her hands still gripping a state-of-the-art sniper rifle that was half-assembled, various scopes and attachments spread out on a small tarp beside her. Several monitors displayed different camera feeds - including, Weiss noted with growing indignation, one showing the interior of their dorm room. The fact that their bathroom had been left out was the only reason she wasn't tempted to throw the sniper off the tower.\r\n\r\n\"May,\" Weiss smiled, the gesture all teeth and no warmth, \"So nice to finally meet face-to-face.\"\r\n\r\nFor several long seconds, May didn't respond. She just stared at Weiss like a cornered animal, her visible eye darting from Weiss to the rifle to the edge of the platform, clearly calculating escape routes, \"H-how did you-\" May finally stuttered, her voice lacking all of the military confidence it held over the walkie-talkie. She sounded younger, more uncertain.\r\n\r\n\"Find you?\" Weiss finished, crossing her arms, \"Did you really think you could hide forever? I'm a Schnee. We always get what we want.\"\r\n\r\nMay's hands twitched toward her rifle, but Weiss was faster. A glyph appeared beneath the weapon and slid it several feet away, \"No more of that,\" Weiss said firmly, \"We're going to have a conversation. A real one.\"\r\n\r\nMay shrank back, pulling her beanie lower over her face, \"I need to relocate,\" she mumbled, reaching for a small bag beside her, \"Position compromised.\"\r\n\r\n\"Absolutely not.\" Weiss stomped her foot, another glyph appearing to block May's reach, \"You're not disappearing again. You've been playing your little invisible guardian game for weeks, and it ends now.\"\r\n\r\nMay's visible eye widened, a flush creeping up her neck, \"It's not a game,\" she protested weakly, \"It's tactical... it's...\"\r\n\r\n\"It's ridiculous,\" Weiss said, \"And it's embarrassing our team.\"\r\n\r\nMay flinched at that, her gaze dropping to the platform beneath them, \"I'm not... good with people,\" she said so quietly Weiss almost missed it, \"Not like this.\" Weiss blinked, momentarily thrown by the vulnerability in May's voice. This was not the confident, almost cocky sniper who regularly harassed her through the walkie-talkie. This May seemed almost... shy.\r\n\r\n\"What do you mean, 'like this'?\" Weiss demanded, though some of the edge had left her voice.\r\n\r\nMay gestured vaguely at herself, still not meeting Weiss's eyes, \"Face-to-face. It's... complicated.\"\r\n\r\n\"Well, uncomplicate it,\" Weiss said, though she found herself taking a small step back to give May some space, \"You can't be a functioning member of this team if you're hiding in clocktowers and shooting people with BB pellets.\"\r\n\r\nMay's hand moved to her beanie again, adjusting it nervously, \"I function fine,\" she insisted, \"From a distance. That's how I operate. That's how I've always operated. Ask Jaune.\"\r\n\r\n\"Oh, I have,\" Weiss said dryly, \"He says you've been like this for two years, which, by the way, is not a normal friendship dynamic.\" Not that she had much experience on that front, but even she knew that this absolutely wasn't the standard.\r\n\r\n\"Nothing about being a Huntress is normal,\" May countered, some of her confidence seemingly returning as she focused on the topic, \"We all have our methods. Mine just happens to involve... distance.\"\r\n\r\nWeiss sighed, pinching the bridge of her nose, \"Look, I didn't track you down to psychoanalyze you. I tracked you down because we're supposed to be a team, and teams need to be able to coordinate. To train together. To develop strategies face-to-face.\"\r\n\r\nMay was silent for a long moment, her eye fixed on a point somewhere past Weiss's shoulder, \"I'm better at this than you think,\" she finally said, \"The distance thing. It works. I've kept Jaune alive for two years.\"\r\n\r\n\"From what? Schoolyard bullies?\" Weiss scoffed.\r\n\r\n\"From Grimm,\" May corrected, her voice hardening slightly, \"From people who'd hurt him for his transcripts. From a lot of things.\"\r\n\r\nWeiss' brows furrowed, \"Wait, what about his transcripts?\" May's eye widened again, and she clamped her mouth shut, looking horrified, \"Never mind that,\" Weiss said, filing the information away for later, \"The point is, this can't continue. I won't have my team be a laughingstock because one member refuses to show her face.\"\r\n\r\nMay fidgeted with the hem of her sleeve, looking increasingly uncomfortable the longer Weiss stared at her, \"I...\" she started, then stopped, \"It's not that simple.\"\r\n\r\n\"Then explain it to me,\" Weiss crossed her arms, \"Because from where I'm standing, you've been making my life needlessly difficult for weeks, and I want to know why.\"\r\n\r\n\"I'm not good with people,\" May repeated, more firmly this time, \"But I'm good at what I do. Really good. The distance thing... it's not just a preference. It's... it's how I function best.\" Weiss studied the strange girl before her. There was clearly more to this story than May was letting on, but the genuine distress in her posture was hard to ignore. May looked like she wanted nothing more than to disappear off the edge of the clocktower and never be seen again.\r\n\r\n\"Fine,\" Weiss said after a long moment, \"Let's say I accept that you have your... reasons. That still doesn't solve our team coordination problem.\"\r\n\r\nMay glanced longingly at her rifle, then at her surveillance equipment, \"I was managing fine,\" she muttered.\r\n\r\n\"You were shooting people in the cafeteria,\" Weiss corrected.\r\n\r\n\"Tactically.\"\r\n\r\n\"It was embarrassing!\"\r\n\r\nMay shrank further into herself, tugging her beanie even lower, \"Didn't mean to embarrass the team,\" she said quietly, \"Just proving a point.\"\r\n\r\nWeiss was struck by the contrast between this May and the one who confidently issued tactical assessments over the walkie-talkie. It was like looking at two different people. Then again, she thought, people acted differently when they thought they had the safety of anonymity. She'd experienced it more than once. People saying hurtful things from behind a screen only to shrink when they saw her face-to-face, they bravery suddenly forgotten in the face of consequences.\r\n\r\n\"Here's what's going to happen,\" Weiss said, adopting her best team-leader voice, \"We're going to talk. Right here, right now. No more hiding behind walkie-talkies or beanbags or whatever else you've been using to avoid actual human interaction.\"\r\n\r\nMay's visible eye widened in panic. Her breathing quickened as she scrambled backward, hands fumbling frantically at her belt, \"I can't- I don't-\"\r\n\r\n\"Oh yes, you can,\" Weiss pressed, taking a step forward, \"This has gone on long enough.\"\r\n\r\nWith trembling hands, May unclipped a spare walkie-talkie from her belt and dropped it on the ground. Then, she picked up another one that she held close to her chest, \"T-take this,\" she stuttered, her voice barely audible. She nudged the walkie talkie with her foot, \"We can talk this way. Just like normal. Please.\"\r\n\r\nWeiss stared at the offered device in disbelief, \"You can't be serious. I'm standing right in front of you!\"\r\n\r\n\"Please,\" May repeated, looking everywhere but at Weiss's face. Her hand shook as she held her walkie-talkie, \"It's... It's better this way.\"\r\n\r\n\"This is ridiculous!\" Weiss snapped, her patience finally evaporating completely. She reached out and snatched the walkie-talkie from May's hand, \"We are going to have a normal conversation like normal people, not through some childish-\"\r\n\r\nBig mistake.\r\n\r\nThe instant the walkie-talkie left her grip, May's entire demeanor transformed. Her eye went impossibly wide, her pupils contracted to pinpoints, and her mouth opened in what started as a gasp but rapidly escalated.\r\n\r\nThe shriek that erupted from May's throat didn't sound human. It was like a thousand nails on a chalkboard, like dying electronics shorting out, like static and feedback and digital distortion all compressed into a single, ear-splitting sound. It reminded her of when the screen in their home theater broke, yet somehow a hundred times worse.\r\n\r\n\"EEEEEEEEEEEEEYAAAAAAAA-A-A-A-A-AAAAAHHH!\"\r\n\r\nThe scream seemed to glitch and stutter, rising and falling in pitch like a corrupted audio file, echoing off the clocktower walls and reverberating through Weiss's skull. Weiss dropped the walkie-talkie in shock, clamping her hands over her ears as the unholy noise continued unabated, \"STOP IT!\" Weiss shouted, but her voice was completely drowned out by May's continuing banshee wail.\r\n\r\nWindows in the clocktower rattled. A nearby bird took flight in panic. Somewhere in the distance, an alarm started going off, though whether it was related or coincidental, Weiss couldn't tell.\r\n\r\nDesperate to make the sound stop, Weiss lunged forward, grabbed the fallen walkie-talkie, and shoved it forcefully back into May's hands. As soon as the walkie-talkie was back in May's possession, the unholy shrieking stopped. May clutched the device to her chest, hugging it like a security blanket, her visible eye closed as she took several deep breaths. Her hands were still trembling.\r\n\r\nWeiss winced, pressing a finger against her ear as if that might stop the persistent ringing, \"What. Was. That?\" she growled, her voice sounding muffled to her own ears.\r\n\r\nMay didn't answer. She just cradled the walkie-talkie closer, looking for all the world like a child with a beloved stuffed animal.\r\n\r\nWeiss watched in disbelief as the sniper - who'd been terrorizing her for weeks, who'd shot Yang between the eyes five times in a row without missing, who'd somehow convinced Beacon's administration to let her operate as a ghost - curled in on herself, shaking.\r\n\r\n\"Fine,\" Weiss sighed after an awkward minute had passed, \"Keep your stupid walkie-talkie.\"\r\n\r\nMay's eye cracked open, watching Weiss warily.\r\n\r\n\"But we're still going to talk,\" Weiss insisted, though with considerably less force than before. Her ears were still ringing, \"What... What do you need me to do?\"\r\n\r\nMay pointed to the opposite side of the clocktower platform, a good fifteen feet away.\r\n\r\n\"You can't be serious,\" Weiss said flatly.\r\n\r\nMay just stared at her, unmoving, then pointed at the other walkie talkie she'd dropped earlier. With a dramatic sigh that she hoped conveyed the full depths of her exasperation, Weiss picked it up, stalked over to the indicated spot and sat down cross-legged, facing May, \"Happy?\"\r\n\r\nMay raised the walkie-talkie to her mouth, pressed the button, and spoke, \"This is... better. Over.\"\r\n\r\n\"This is completely ridiculous,\" she said into the device, \"I can literally see you. Over.\"\r\n\r\n\"I know,\" May's voice came through, stronger now, more like the confident 'Beanie One' she was used to hearing, \"But it's easier this way. Over.\"\r\n\r\n\"Easier?\" Weiss snapped, \"What's easier about having to use communication devices when we're fifteen feet apart? What's your deal, May? Jaune said you were completely normal until you were both fifteen, and then you decided to become a ghost. Over.\" She added the last word with dripping sarcasm that could peel paint.\r\n\r\nMay was silent for so long that Weiss wondered if she'd broken some unspoken rule of walkie-talkie etiquette. Finally, the device crackled, \"I've always been shy,\" May's voice came through, quiet but steady, \"But after I turned fifteen...\" She trailed off, shaking her head, \"No. I just find it easier this way. I can focus on the mission. No distractions. Over.\"\r\n\r\n\"What mission?\" Weiss demanded, \"We're students at a Huntsman academy, not special operatives.\" Not yet, at least, \"And you haven't answered my question. What happened after you turned fifteen? Over.\"\r\n\r\nMay fidgeted with her beanie, adjusting it even though it hadn't moved. Her gaze was fixed on the platform floor between them, \"It's... personal. Over.\"\r\n\r\n\"We're going to be stuck on this clocktower until you give me something to work with.\" Weiss glared at her, \"Over.\"\r\n\r\nAnother long pause. May looked physically pained, as if each word was being extracted under torture. Finally, she spoke.\r\n\r\n\"I realized I liked Jaune,\" she admitted, the words coming in a rush, \"Like... really liked him. And then being around him became too hard. Too awkward. I kept saying stupid things, or laughing at inappropriate moments, or just... freezing up. So I decided it would be better to watch over him from a distance. Keep him safe. That's what I'm good at anyway. Over.\"\r\n\r\nWeiss stared at her. Then, very deliberately, she set the walkie-talkie down, covered her face with both hands, and counted silently to ten. When she picked up the walkie-talkie again, her voice was dangerously calm, \"Are you kidding me? All of this - the disappearing, the sniping, the walkie-talkies, the years of making Jaune talk to empty air - all of this because of a teenage crush? Over.\"\r\n\r\nMay's cheeks flushed a deep red that almost matched her hair, \"It's not just a crush,\" she protested weakly, \"It's... complicated. Over.\"\r\n\r\nWeiss bit down on the scream of frustration that threatened to escape. All this time, all the embarrassment, all the team dysfunction - because May Zedong couldn't handle having feelings for Jaune Arc. Jaune Arc, of all people! The boy who wore footie pajamas to the first night at Beacon! The boy who had bar none THE worst combat record in the entire school. Yang once beat him literally with both hands tied behind her back!\r\n\r\n\"Here's what's going to happen,\" Weiss said, her tone making it clear this was not up for debate, \"I'm going to help you fix your relationship with Jaune.\"\r\n\r\nMay's eye widened in alarm, \"W-what? No, that's not- I mean, this arrangement is working fine! Over.\"\r\n\r\n\"Is it?\" Weiss challenged, \"You honestly expect this to last? For four years? For your entire career as a Huntress? Over.\"\r\n\r\n\"Well... yeah,\" May said, sounding genuinely confused that Weiss didn't see the logic, \"It's worked for two years already. Over.\"\r\n\r\nWeiss ignored this, \"I'm going to fix you and Jaune,\" she continued, \"And then you're going to stop embarrassing our team. You're going to attend classes in person. You're going to participate in team training. And you're going to stop shooting people in public spaces. Are we clear? Over.\"\r\n\r\nMay looked like she wanted to argue. Her hand tightened around the walkie-talkie, and for a moment, Weiss worried she might be about to experience another ear-splitting shriek. But then May's shoulders slumped in defeat. She nodded once, the movement so small Weiss almost missed it.\r\n\r\n\"Good,\" Weiss said, standing up and brushing off her combat skirt, \"And from now on, I expect you to keep in contact. Actually in contact. I'm not going to fix this mess if I can't even see you. You will give me locations of where we'll meet whenever we need to talk. Out.\"\r\n\r\nAs she created a glyph to begin her descent from the clocktower, Weiss pinched the bridge of her nose and sighed deeply. This was NOT what she'd signed up for when she enrolled at Beacon. She was supposed to be training to become a Huntress, to restore honor to the Schnee name, to prove herself as a warrior. Instead, she was playing relationship counselor to a socially crippled sniper with an overactive trigger finger and her oblivious partner.\r\n\r\n\"If Winter could see me now,\" Weiss muttered as she stepped onto her glyph, \"She'd never let me hear the end of it.\"\r\n\r\n[line break]\r\n\r\nPoor Weiss. Just wants a normal team. Ends up having to play cupid for May and Jaune. Can't even enjoy having Pyrrha as a partner."
    },
    {
      "title": "Chapter 3",
      "text": "Last chapter for this oneshot-turned-threeshot. Poor Weiss.\r\n\r\nFor patrons - Maid Jaune coming soon-ish. Got distracted by this, but don't worry, we'll soon see Yang using Jaune to deal with her mommy issues!\r\n\r\n[line break]\r\n\r\nWeiss had spent exactly twenty-seven minutes making sure Jaune and Pyrrha would be gone for at least two hours. She'd mentioned something about a special combat training session with Professor Goodwitch that she'd arranged specifically for them. It didn't take much for the Professor to agree. Jaune's combat performance was... lackluster at best. The best thing she could say about him was that he was a good meat shield, but that was backhanded praise at best. Pyrrha, of course, chose to go with him out of misplaced pity.\r\n\r\n\"May,\" she announced to the apparently empty room, \"I know you're watching. It's time.\" Silence. Weiss tapped her foot impatiently, \"Don't make me find you again. You know I can.\" More silence. Weiss sighed dramatically, \"Fine. I'll just go get Jaune and tell him all about our little chat on the clocktower. I'm sure he'd be fascinated to hear-\"\r\n\r\nThe walkie-talkie on Jaune's desk crackled to life, \"That's blackmail. Over.\"\r\n\r\n\"I prefer to think of it as motivation,\" Weiss replied smoothly, \"Now, get over here. We had a deal.\"\r\n\r\n\"I'm busy. Surveillance. Very important. Can't leave my post. Over.\"\r\n\r\n\"Your 'post' is probably the tree outside our window, and the only thing you're surveilling is Jaune walking to a training session that he desperately needs.\" Weiss crossed her arms, \"Either you come to me, or I go find you and bring Jaune along for the adventure. Your choice.\"\r\n\r\nA high-pitched squeak came through the walkie-talkie, followed by what sounded suspiciously like someone hitting their head on a branch. Five minutes later, their dorm room window slid open from the outside. May slipped in with the silent grace of someone who'd done this many times before... despite the fact that they were on the third floor. Her beanie was (still) pulled low over her left eye, and she was clutching her walkie-talkie like a lifeline.\r\n\r\nWeiss just glared at her, \"We have a door, you know.\"\r\n\r\nMay shrugged, looking everywhere but at Weiss, \"Windows are more secure. Less witnesses. Over.\"\r\n\r\n\"You don't have to say 'over' when we're in the same room.\"\r\n\r\nMay's visible eye widened in panic, \"I... don't?\"\r\n\r\nWeiss sighed for what felt like the hundredth time that day. This was going to be harder than she thought, \"Let's get to the point. You and Jaune are going on a date.\"\r\n\r\n\"WHAT?!\" May squeaked, nearly dropping her walkie-talkie. She fumbled for it, clutching it to her chest, \"No, no, no! I can't- I don't- That's not- \"\r\n\r\n\"It's happening,\" Weiss said firmly, moving past May toward her immaculately organized closet, \"And I'm going to help you prepare.\"\r\n\r\nMay backed up until she hit the wall, her hand already reaching for the window, \"This isn't what we agreed to! I thought you'd just... I don't know, make me attend a class or something!\"\r\n\r\n\"That comes later,\" Weiss said, rifling through her clothes with a critical eye, \"But first, we need to address the root of the problem.\" She pulled out a pale blue dress, holding it up with a critical eye, \"And you're certainly not going on a date wearing... that.\" She made an offended gesture to the sniper's attire. May glanced down at her ensemble, a pink and brown tracksuit with multiple pockets and utility belts. Perfect for someone whose entire personality revolved around hiding in trees.\r\n\r\n\"What's wrong with-\"\r\n\r\n\"Everything,\" Weiss cut her off, \"Absolutely everything. Thankfully for you, I'm feeling generous enough to lend you one of my dresses.\" She held the blue garment out, \"Now take off that jacket so I can see what I'm working with.\"\r\n\r\nMay's hand went to her zipper, then froze, \"I... um...\"\r\n\r\n\"We don't have all day, May.\" Weiss tapped her foot\r\n\r\nGulping audibly, May slowly lowered the zipper of her jacket and shrugged it off her shoulders.\r\n\r\nWeiss' jaw dropped. Her eyes widened. The dress she'd been holding almost slipped from her suddenly limp fingers. Where Weiss had expected a slender, athletic build similar to her own, she instead found herself staring at what could only be described as two watermelons strapped to May's chest. The sniper's previously baggy tracksuit had been concealing a figure that would make even Yang Xiao Long look twice. Did that tracksuit have gravity Dust to hide those, she thought numbly.\r\n\r\n\"I... they... it's just...\" May stammered, crossing her arms over her chest defensively, \"It was puberty. Hit me all at once when I was fifteen. It's... It's another reason I got too shy to talk to Jaune face-to-face.\"\r\n\r\nWeiss continued to stare, her brain momentarily failing to process what she was seeing. Then, she looked down at the modest blue dress in her hands, back up at May's chest, and wordlessly tossed the garment aside, \"I'm not jealous,\" Weiss announced unprompted, her voice several octaves higher than usual for no reason whatsoever, \"Not at all. I certainly don't feel inadequate in any way.\"\r\n\r\nMay blinked in confusion, \"I didn't say - \"\r\n\r\n\"Breasts are just useless lumps of fat anyway,\" Weiss continued, her cheeks flushing pink, \"Completely impractical for combat. A hindrance, really. I'm sure you have all sorts of back problems.\"\r\n\r\n\"Well, sometimes-\"\r\n\r\n\"Exactly! And they'd just get in the way during complex glyph formations,\" Weiss barreled on, now pacing back and forth, \"Really, I should be thanking my genes for my perfect, streamlined physique. Optimal for a Huntress of my caliber. Yes.\" May stood frozen in place, clearly unsure how to respond to Weiss' unexpected (yet very justified) rant. Weiss finally stopped pacing, took a deep breath, and turned to face May with forced composure, \"Anyway. Clearly none of my clothes will... accommodate your... situation.\"\r\n\r\n\"I could just wear my normal-\"\r\n\r\n\"Absolutely not,\" Weiss cut her off again, \"We'll need to go shopping. But first-\" she gestured to the beanie covering half of May's face, \"-what's with that? Is there actually something under there, or is it just for your whole 'mysterious sniper' aesthetic?\"\r\n\r\nMay's hand flew protectively to her beanie, \"Don't touch it!\"\r\n\r\n\"I wasn't going to,\" Weiss said, taking a step back at May's sudden intensity, \"But if you're going on a date, you might want to, I don't know, show your entire face?\"\r\n\r\n\"The beanie stays,\" May said with surprising firmness, all shyness forgotten, \"Non-negotiable.\"\r\n\r\nWeiss threw up her hands, \"Fine! Keep your mysterious half-face! But the tracksuit goes, and so does the walkie-talkie.\"\r\n\r\nMay clutched the device closer, \"But - \"\r\n\r\n\"No buts! You can't go on a date and talk through a walkie-talkie! It's ridiculous!\"\r\n\r\n\"Then I can't go,\" May said, her voice small but resolute, \"The walkie-talkie stays, or I stay invisible.\"\r\n\r\nWeiss closed her eyes, silently counting to ten. When she opened them again, May was still there, still clutching the walkie-talkie, still partially hidden behind her beanie. But there was something in her stance - a vulnerability beneath the awkwardness - that made Weiss hesitate.\r\n\r\n\"Okay,\" she said finally, pincing the bridge of her nose,\"We'll... work up to that. Baby steps.\"\r\n\r\n[line break]\r\n\r\nWeiss tugged May through the streets of Vale, ignoring the sniper's constant stream of protests crackling through the walkie-talkie clutched in her hand. She'd confiscated it the moment they'd left campus, allowing May only periodic check-ins to prevent another ear-shattering shriek episode. The last thing she needed was a reputation for her team causing public disturbances down in Vale.\r\n\r\n\"This is completely unnecessary,\" May said, voice tinny and anxious even without the walkie talkie's distortion, \"I can just wear my usual gear. It's practical. Tactical. Over.\"\r\n\r\n\"You're not going on a date in a tracksuit,\" Weiss hissed, keeping her voice low as they navigated the busy sidewalk, \"And you're certainly not going invisible halfway through dinner, which I know is exactly what you're planning.\"\r\n\r\n\"There's nothing wrong with strategic withdrawals. Over.\"\r\n\r\nWeiss rolled her eyes. At least May had agreed to come along, even if she was constantly checking rooftops and alleyways like they were on some kind of covert mission instead of a shopping trip. Getting her on the airship to Vale had been a challenge in and of itself. May insisted on wearing sunglasses over her visible eye, in addition to her ever-present beanie, making her look less like a Huntress-in-training and more like a particularly suspicious bank robber.\r\n\r\n\"Here we are,\" Weiss announced, stopping in front of a gleaming storefront with tasteful window displays, \"Chandelier Rose. The most exclusive boutique in Vale.\" She sniffed slightly, \"It's no Snowpetal of Atlas, but it'll have to do.\"\r\n\r\nMay froze on the sidewalk, visible eye widening as she took in the elegant mannequins and crystal chandeliers visible through the windows, \"I can't go in there,\" she whispered, voice cracking, \"Everyone will stare at me. Over.\"\r\n\r\n\"They're already staring at you,\" Weiss pointed out. It was true - May's combination of tracksuit, beanie pulled low over half her face, and obvious discomfort was drawing more than a few curious glances from passersby, \"You stick out like a Beowolf at a tea party. Now come on.\" Before May could protest further, Weiss grabbed her by the arm and pulled her through the boutique's doors. A small bell tinkled pleasantly, announcing their arrival.\r\n\r\n\"Welcome to Chandelier Rose,\" a saleswoman greeted them, her practiced smile faltering slightly as she took in May's appearance, \"How may I... assist you today?\"\r\n\r\n\"We need a dress,\" Weiss stated firmly, \"Something elegant but not overly formal. And it needs to be...\" she glanced at May's chest with a brief flash of irritation, \"...accommodating.\"\r\n\r\nThe saleswoman's professional instincts kicked in as she saw Weiss' attire. An expensive customer, \"Of course. What's the occasion?\"\r\n\r\n\"A date,\" Weiss said just as May blurted, \"Tactical reconnaissance.\" The saleswoman blinked, \"A date,\" Weiss repeated more firmly, shooting May a warning glare.\r\n\r\n\"Wonderful! Please, feel free to browse. I'll be right here if you need any assistance.\"\r\n\r\nWeiss steered May toward a rack of dresses, keeping a firm grip on the walkie-talkie. May was squirming uncomfortably, visibly flinching whenever another customer walked past. Her hand kept twitching toward the walkie-talkie Weiss held hostage, \"Stop that,\" Weiss hissed, \"You look like you're about to rob the place.\"\r\n\r\n\"Too exposed,\" May muttered, \"No clear sight lines. Inadequate exit routes. Multiple civilian witnesses. Over.\"\r\n\r\n\"It's a clothing store, not a combat zone. Of coruse there are civilians\" Weiss sighed, flipping through the dresses with her free hand, \"Ah, this one might work.\" She pulled out a maroon dress with buttons down the front. The fabric looked sturdy, the cut modest enough for a first date but still flattering. Most importantly, it seemed to have room for May's... assets, \"Try this on,\" Weiss said, thrusting the dress at May.\r\n\r\nMay stared at it like Weiss was handing her a detonating Dust crystal, \"Here?\"\r\n\r\n\"In the dressing room,\" Weiss said, pointing to the back of the store where several elegant curtained booths stood, \"I'll wait right outside.\" May looked from the dress to the dressing room to the door, clearly calculating her chances of escape, \"Don't even think about it,\" Weiss warned, waving the walkie-talkie like a hostage, \"I'm keeping this until you're done. Any funny moves and we're going to see just how our little friend here takes a being flung off the CCT tower.\"\r\n\r\n\"G-Give it to me! I'll change after I have it!\" May reached for it.\r\n\r\n\"You'll get it back after you've tried on the dress. I know you, May Zedong. The moment I turn my back, you'll shimmy out through the air vent or something equally ridiculous.\"\r\n\r\nMay's expression suggested that was exactly what she'd been planning. With the reluctance of someone approaching the gallows, May took the dress and slunk toward the dressing room. Weiss followed close behind, positioning herself strategically outside the curtain. She had no doubt that May would try to slip away given half a chance.\r\n\r\n\"Everything okay in there?\" Weiss called after several minutes of suspicious rustling.\r\n\r\n\"This isn't going to work,\" May's muffled voice replied, \"The... proportions are all wrong. Over.\"\r\n\r\n\"You need to stop saying 'over' in normal conversation,\" Weiss muttered, \"And I specifically chose something with room for your... situation.\"\r\n\r\nMore rustling, followed by a string of muttered curses, \"It buttons in the front.\"\r\n\r\n\"That's generally how a lot of dresses work, yes.\"\r\n\r\n\"No, I mean-\" May's voice was strained, \"-the buttons are under a lot of... pressure.\"\r\n\r\nWeiss pinched the bridge of her nose, \"Just do your best. We need to see how it looks. We can make adjustments as we go.\"\r\n\r\nAfter what seemed like an eternity, the curtain rustled. May stepped out reluctantly, eyes fixed on the floor. The dress was a lovely color against her skin and complimented her hair, Weiss had to admit. The cut flattered her waist and fell to just above her knees. But something was definitely wrong with the front. The buttons strained visibly across May's chest, gaps appearing between them where the fabric was pulled too tight.\r\n\r\nWeiss looked her up and down critically, trying to ignore the clash between the elegant dress and May's ridiculous beanie and worn sneakers. Her gaze stopped when she reached the buttons on May's chest. Was that button... shaking?\r\n\r\n\"Um, I don't think-\" May started.\r\n\r\nPING!\r\n\r\nThe top button shot off like a bullet fired from May's own sniper rifle, launched with enough force to create a miniature sonic boom in the quiet boutique. Weiss' Huntress-trained reflexes kicked in instantly. She ducked, feeling the button whiz past her ear with alarming speed. It smacked against the bench behind her with a crack, ricocheted toward the wall, and proceeded to bounce wildly around the store like a hyperactive pinball.\r\n\r\nPing! Ping! Ping!\r\n\r\nCustomers ducked. A saleswoman shrieked. The security guard reached for his radio.\r\n\r\nAnd then, in a final act of cosmic mockery, the button completed its chaotic journey by flying directly back toward them... and smacking Weiss squarely in the middle of her forehead with enough force to make her Aura flicker and her head snap back.\r\n\r\nThe store fell deathly silent.\r\n\r\nWeiss stood frozen, a small red mark forming between her eyes, her expression one of perfect, blank shock, \"It wasn't my fault,\" May stuttered, clutching the front of the dress closed while simultaneously trying to make herself as small as possible, \"They're just... they're just... I told you the proportions were wrong!\"\r\n\r\nWeiss' eye twitched. That button alone would cost 3.50 lien to replace, not to mention the potential damage to the store and her dignity. And the potential lawsuit if it had hit a civilian instead of a Huntress with Aura. She forced her lips into what she intended to be a smile but probably looked more like a grimace that'd been beaten into submission.\r\n\r\n\"We're going to find another dress,\" she said through clenched teeth, \"One without buttons.\"\r\n\r\n[line break]\r\n\r\nThis wasn't how Weiss Schnee imagined spending her Saturday afternoon in Vale.\r\n\r\nShe'd had a plan - a perfect, reasonable plan. May and Jaune would go on their date. May would stop being a social disaster. The invisible teammate nonsense would end. And Weiss could finally enjoy being at Beacon, away from her father's constant pressure and partnered with the Invincible Girl.\r\n\r\nBut of course, that didn't happen because May Zedong was... well, May Zedong.\r\n\r\n\"You'll need to maintain visual contact at all times,\" May had insisted the night before, pacing their dorm room while Jaune was in the shower, \"Optimal distance: 50 to 75 feet. Any closer risks detection, any further compromises surveillance quality.\"\r\n\r\nWeiss had stared at her in disbelief, \"You want me to spy on your date?\"\r\n\r\n\"Not spy,\" May had corrected, adjusting her beanie nervously, \"Provide tactical support. I haven't engaged in direct social contact in two years. I need backup.\"\r\n\r\n\"That's what the date is supposed to fix!\"\r\n\r\n\"I can't go in cold,\" May had insisted, that edge of panic creeping into her voice that Weiss had come to recognize as the precursor to either May disappearing or having one of her electronic-death-scream episodes, \"I need someone monitoring the situation. Providing intelligence. Recommending courses of action.\"\r\n\r\n\"So I'm just supposed to be a third wheel?\" Weiss had demanded, \"Hide in a bush while you two have dinner?\"\r\n\r\nMay's face had lit up, \"Exactly! But not a bush. Poor sight lines.\" She'd pulled out a set of high-tech binoculars from one of her many hidden pockets, \"These have a built-in directional microphone. You'll be able to hear everything. And I'll keep my walkie-talkie. If I need advice, I'll call you.\"\r\n\r\nWeiss had wanted to refuse. This was insane. Completely, utterly insane. But May had started trembling, her visible eye darting toward the window (her preferred escape route), and Weiss had known she'd invested far too much into this madness to stop now.\r\n\r\n\"Fine,\" she'd snapped, \"But this is the last time I'm enabling your... whatever this is.\"\r\n\r\nAnd so here she was, perched on a bench 53 feet away (May had insisted on precise measurements) from \"Brewed Awakening,\" the coffee shop where May and Jaune were meeting. The high-tech binoculars were disguised as a normal pair, though the directional microphone attachment made them look bulkier than usual. She'd tucked her white hair under a baseball cap and wore sunglasses, feeling utterly ridiculous.\r\n\r\n\"This is so stupid,\" she muttered to herself, adjusting the focus on the binoculars, \"I'm a Schnee. We don't hide in plain sight to spy on other people's dates.\"\r\n\r\nThat was a lie, of course. Her sister Winter had absolutely done reconnaissance missions for the Atlesian military. But those had been for national security, not... whatever this was.\r\n\r\nThrough the binoculars, she spotted Jaune arriving first. He looked surprisingly presentable - she'd forced him to wear something other than his usual hoodie, and he'd actually managed to find a decent blue button-up shirt and clean pants. He was shifting his weight nervously, checking his scroll every few seconds.\r\n\r\n\"Target in position,\" Weiss muttered sarcastically, \"Blonde Shield looks like he's about to flee.\"\r\n\r\nTwo minutes later, May appeared, walking stiffly toward the coffee shop. Weiss had to admit, despite everything, she'd done a decent job with the sniper's appearance. The maroon dress - carefully selected to have no buttons and extra room in the chest - flattered May's figure without being too revealing. She'd replaced her usual sneakers with sandals that matched the dress nicely.\r\n\r\nBut of course, the stupid beanie remained firmly in place, covering half her face.\r\n\r\nWeiss adjusted the microphone, picking up their conversation as they met outside the shop.\r\n\r\n\"M-May?\" Jaune sounded like he'd seen a ghost. Which, in a way, he had, \"Is that... really you?\"\r\n\r\nMay stood awkwardly, clutching her ever-present walkie-talkie, \"Affirmative, Jaune. Visual confirmation achieved.\"\r\n\r\nJaune took a step forward, then stopped, clearly unsure of the protocol for greeting someone you've talked to daily but haven't actually seen in two years, \"You look... different.\"\r\n\r\n\"Tactical circumstances required appearance adjustment,\" May replied, falling back on her military jargon. Then, softer, \"Weiss helped.\"\r\n\r\n\"Well, you look... wow.\" Jaune was staring at May with an expression of wonder, like he was seeing the sun for the first time. He finally broke into that goofy smile of his, \"It's really good to see you again, May. Like, actually see you.\"\r\n\r\nMay shuffled her feet, visibly fighting the urge to either bolt or raise the walkie-talkie to her mouth, \"Surveillance indicates cafe is at 62% capacity. Acceptable crowd density. Shall we proceed inside?\"\r\n\r\nJaune laughed, the sound carrying clearly through the microphone, \"Some things never change, huh? Sure, let's go in.\"\r\n\r\nAs they walked into the coffee shop, Weiss quickly relocated to a position with a better view through the window. She felt utterly ridiculous, like the world's most uninterested stalker. This was beneath her dignity as a Schnee, as a Huntress, as a normal human being with better things to do on a Saturday.\r\n\r\nShe watched as they found a table by the window (May's choice, no doubt - optimal escape route) and settled in. The directional microphone picked up their conversation with surprising clarity.\r\n\r\n\"So,\" Jaune started, \"two years as my invisible protector, huh? That's... dedicated.\"\r\n\r\nMay's hand crept toward her walkie-talkie before she visibly forced it back to her lap, \"Mission parameters required constant surveillance. You have a remarkable talent for finding trouble.\"\r\n\r\n\"Yeah, but... why?\"\r\n\r\nWeiss leaned forward slightly, genuinely curious about how May would answer.\r\n\r\n\"I...\" May's usual confidence faltered, \"Strategic reasons. Increased operational security.\"\r\n\r\n\"May,\" Jaune said gently, \"we've been friends since we were six. You used to come to my house for dinner every Tuesday. You helped me build a treehouse in my backyard. Then one day, you just... disappeared. I mean, you were there, but not there. I've missed you.\"\r\n\r\nMay's visible eye widened, and she glanced out the window - directly at where Weiss was sitting. Weiss ducked slightly, cursing under her breath.\r\n\r\nThe walkie-talkie at her side crackled, \"Ice Queen, requesting immediate tactical advice. Target has expressed emotional sentiment. Appropriate response unclear. Over.\"\r\n\r\nWeiss groaned, pressing the button, \"Tell him you missed him too, you absolute disaster. Over.\"\r\n\r\nThrough the binoculars, she saw May take a deep breath and turn back to Jaune, \"I... missed you too. Being visible is... challenging for me now. But I'm trying.\"\r\n\r\nJaune's expression softened, \"Hey, that's all I can ask for. One step at a time, right? And maybe someday you'll tell me what actually happened two years ago?\"\r\n\r\nMay stiffened slightly, \"Classified information.\"\r\n\r\n\"Right,\" Jaune laughed, \"Of course it is.\"\r\n\r\nWeiss had to admit, the idiot was handling this remarkably well. She'd expected him to be his usual bumbling self, but he was being patient, understanding even. It was... almost impressive.\r\n\r\nAs their coffees arrived, Weiss continued her reluctant surveillance. May, at least, had replaced her sneakers with more appropriate sandals that matched the maroon dress, even if she still refused to take off that stupid beanie. Not that Jaune noticed. He just looked stunned and then happy to see his childhood friend again. Weiss didn't know whether to be impressed or annoyed that his eyes didn't flick once to those useless lumps of fat despite Weiss choosing a dress to flatter the sniper's grotesque figure.\r\n\r\nWeiss watched the unfolding catastrophe through her binoculars with a grimace that grew deeper by the minute. This wasn't a date. This was a slow-motion train wreck. Inside the coffee shop, May sat with perfect military posture, her back ramrod straight, hands placed precisely on either side of her mug. She hadn't taken a single sip. Every time Jaune asked a question, she responded with the shortest possible answer, usually in terminology better suited for a mission briefing than a coffee date.\r\n\r\n\"So, what have you been up to these past two years?\" Jaune asked, leaning forward with genuine interest.\r\n\r\n\"Surveillance. Target protection. Skill enhancement,\" May replied mechanically. She'd become even more robotic than usual.\r\n\r\n\"No, but like... what do you do for fun? Do you still like those mystery novels? Remember how we used to read them together in my backyard?\"\r\n\r\nMay's visible eye darted around the room, cataloging exits and potential threats, \"Recreational activities minimized. Operational efficiency prioritized.\"\r\n\r\nJaune's smile dimmed slightly, \"Right...\"\r\n\r\nThe conversation lapsed into awkward silence - the third one in ten minutes. May fidgeted with her napkin, folding it into increasingly precise triangles. Jaune took a long sip of his coffee, clearly scrambling for another topic.\r\n\r\n\"Excuse me,\" May said suddenly, standing up, \"Bathroom break required.\"\r\n\r\nWeiss barely had time to reposition herself before the walkie-talkie at her side crackled to life.\r\n\r\n\"Ice Queen, this is Beanie One. Conversation parameters failing. Require immediate conversational reinforcement. Over.\"\r\n\r\nWeiss pressed the button with more force than necessary, \"Ask him about his family! You've known them forever, haven't you? Talk about something normal, for Brothers' sake! Over!\"\r\n\r\n\"Family status inquiry. Confirmed effective strategy. Implementing immediately. Over.\"\r\n\r\nWeiss watched through the binoculars as May returned to the table, her stride purposeful like she was approaching a combat zone rather than a coffee date, \"Jaune,\" she announced as she sat down, with all the warmth of a military commander, \"Provide status update on familial units.\"\r\n\r\nJaune blinked, \"You mean... my family?\"\r\n\r\n\"Affirmative.\"\r\n\r\n\"Uh, they're good? Saphron got married last year - I think I mentioned that over the walkie-talkie? My mom keeps asking when I'll visit. Dad's still head of the Militia. He said the offer to teach sharpshooting to the guys is still on the table.\"\r\n\r\n\"Excellent intelligence. Processing.\"\r\n\r\nAnother excruciating silence followed. Jaune valiantly tried again, \"How about your mom? She still making those amazing cookies?\"\r\n\r\n\"Maternal unit continues baking operations. Cookie production uninterrupted.\" Weiss buried her face in her hands. This was going even worse than she'd anticipated. May couldn't hold a normal conversation if her life depended on it.\r\n\r\nAfter thirty agonizing minutes of watching this disaster unfold, with May excusing herself to the \"bathroom\" no fewer than seven times to request conversational backup, they finally left the coffee shop.\r\n\r\n\"That was... nice,\" Jaune said, ever the optimist, \"Maybe we could walk through the park? It's a beautiful day.\"\r\n\r\nWeiss repositioned herself, following at a safe distance as they headed toward Vale Central Park. May walked beside Jaune with at least three feet of space between them, clutching her walkie-talkie in a death grip. Every time a civilian passed too close, her hand twitched toward where Weiss suspected she had a concealed weapon.\r\n\r\nThe park was bustling with weekend activity. Families having picnics, couples walking hand-in-hand, street performers entertaining small crowds. The moment they stepped through the wrought-iron gates, May's demeanor changed dramatically. Her eye darted frantically from person to person, her breathing becoming shallow and rapid. Her knuckles whitened around the walkie-talkie. She stopped walking entirely, frozen in place like a startled deer.\r\n\r\n\"May?\" Jaune asked, concerned, \"You okay?\"\r\n\r\n\"Too many... Too many civilians,\" May gasped, sounding nothing like her usual confident self, \"No clear sight lines. Multiple unknown variables. Tactical disadvantage. I need... I need...\"\r\n\r\nShe looked like she was on the verge of a full-blown panic attack. Jaune, to his credit, immediately guided her to a less crowded area, finding a bench partially secluded by trees, \"Hey, it's okay,\" he said gently, \"Just breathe. We can go somewhere else.\"\r\n\r\nWeiss's walkie-talkie crackled urgently, \"Emergency extraction required! Civilian density exceeding tolerable parameters! Over!\"\r\n\r\n\"For Brothers' sake, May, it's just a park!\" Weiss hissed into the device, \"Take a deep breath and stop acting like you're in enemy territory! Over!\"\r\n\r\nThrough the binoculars, Weiss saw May visibly trying to compose herself, her chest rising and falling with deliberately controlled breaths. Jaune sat patiently beside her, not touching, just offering his presence, \"Operational control regained,\" May finally reported, both to Jaune and through the walkie-talkie. Jaune gracefully chose not to comment on it. Thank the Brothers Weiss was masking her voice. The last thing she needed was for this to be traced back to her, \"Alternative venue recommended.\"\r\n\r\nJaune considered for a moment, \"How about the movies? It's dark, not a lot of people talk, and we can sit at the back if that makes you more comfortable?\"\r\n\r\nMay seemed to consider this, her tactical mind whirring almost visibly behind her visible eye, \"Acceptable alternative. Darkness provides cover.\" They left the park, heading toward the cinema several blocks away. Weiss followed, growing increasingly irritated with every step. This was not how she'd planned to spend her Saturday.\r\n\r\nThe movie theater was showing some action film with explosions and car chases - exactly the kind of mindless entertainment that might be perfect for this disaster of a date. Jaune purchased tickets while May conducted what appeared to be a thorough security assessment of the lobby.\r\n\r\nAs they entered the dimly lit theater, Weiss slipped in several rows behind them, keeping her cap pulled low. May had insisted on seats in the back corner, providing an unobstructed view of all exits and other patrons. For a brief moment, as the lights dimmed fully and the trailers began, Weiss dared to hope this might actually work. The dark environment seemed to calm May. Jaune offered her some popcorn, and she actually took a handful.\r\n\r\nThen the first action sequence played: a dramatic sniper scene where the protagonist took out targets from a rooftop.\r\n\r\n\"Completely unrealistic,\" May announced loudly enough for several nearby patrons to turn around, \"That rifle has insufficient muzzle velocity for the depicted range. And his firing position is tactically unsound,\" Jaune hushed her gently, but the damage was done. May began a running commentary on every tactical error in the film, growing increasingly agitated, \"That's not how you clear a room! Amateur technique! He'd be dead in seconds!\"\r\n\r\n\"May,\" Jaune whispered, \"it's just a movie.\"\r\n\r\n\"It's dangerous misinformation,\" May replied, not lowering her voice at all, \"If someone attempted that maneuver in the field, they'd-\"\r\n\r\nA patron two rows ahead turned around, \"Can you please be quiet?\"\r\n\r\nMay's eye widened, her hand immediately reaching for what Weiss strongly suspected was a hidden grenade. Weiss tensed, ready to intervene, but Jaune smoothly placed his hand over May's.\r\n\r\n\"Sorry about that,\" he called to the annoyed moviegoer, then leaned closer to May, \"Maybe this wasn't the best idea. Want to try something else?\"\r\n\r\nMay nodded stiffly, already rising from her seat with military precision. Weiss waited until they exited before following, increasingly tempted to abandon this whole fiasco.\r\n\r\nThe walkie-talkie crackled, \"Cinema operation aborted. Target suggesting nutritional acquisition at nearby establishment. Please advise on restaurant security protocols. Over.\"\r\n\r\n\"It's dinner, May, not a covert operation!\" Weiss snapped, earning confused looks from passersby, \"Just act normal for five minutes! Over!\"\r\n\r\nThey ended up at a mid-range restaurant with mood lighting and tablecloths. Nicer than a cafe but still not fancy enough to need a dress code. Weiss positioned herself at a corner table, pretending to study the menu while keeping the pair in view. May surveyed the restaurant like she was planning a tactical strike, evaluating each server, patron, and exit. When their waiter approached, she subjected him to such an intense stare that the poor man nearly dropped his notepad.\r\n\r\n\"What can I get you folks?\" the waiter asked with a nervous smile.\r\n\r\n\"What's prepared fresh to order?\" May demanded.\r\n\r\n\"Uh, pretty much everything? Our chef-\"\r\n\r\n\"Unacceptable.\" May cut him off, \"Pre-made items present lower poisoning risk. Kitchen access should be restricted. Who tastes the food before serving?\"\r\n\r\nThe waiter stared at her, \"I... what?\"\r\n\r\n\"Places like this make it easy to poison someone,\" May said matter-of-factly, as if the waiter was the idiot for not realizing, \"Nothing is ever pre-made. No quality control. Anyone could introduce toxins at multiple points in the preparation process.\"\r\n\r\nJaune laughed awkwardly, \"She's joking! Huntress humor, you know? We'll have the, uh, special and the pasta. Thanks!\"\r\n\r\nThe waiter backed away slowly.\r\n\r\nWeiss pressed her face into her menu, mortified on their behalf. This date wasn't just a disaster - it was a catastrophe of epic proportions. Every attempt Jaune made at normal conversation was met with either tactical assessment, one-word answers, or May excusing herself to request assistance via walkie-talkie.\r\n\r\nBy the time they finished their meals (May had only eaten after forcing the Waiter take several bites to ensure it wasn't poisoned), Weiss finally reached her limit. She'd spent nearly five hours watching this train wreck, provided countless pieces of conversational advice that May had invariably translated into military jargon, and had nothing to show for it except a mounting headache.\r\n\r\nWhen they stepped out of the restaurant, with May looking relieved to have survived the \"high-risk dining environment,\" Weiss made her decision. She tossed aside all pretense of stealth, marched straight up to them, and watched with grim satisfaction as May's visible eye widened in shock and horror. She frantically slashed at her neck, the agreed upon \"abort mission\" signal, which Weiss gleefully ignored. She was done with this buffoonery..\r\n\r\n\"W-Weiss?\" Jaune stammered, \"What are you doing here?\"\r\n\r\n\"Ending this farce,\" Weiss declared, crossing her arms. She turned to Jaune, ignoring May's frantic head-shaking, \"Jaune, May is in love with you. She has been since you were both fifteen, which is why she turned into a ghost and has been following you around for two years instead of just talking to you like a normal person.\" May made a strangled sound, her face flushing as red as her hair. Steam practically rose from her beanie, \"I am not wasting another day playing stalker for you two,\" Weiss continued mercilessly, \"Deal with this now, because I refuse to continue enabling whatever this is.\"\r\n\r\nJaune stood frozen, his mouth slightly open. Slowly, he turned to May, who looked like she was contemplating diving into the nearest storm drain, \"Is that true?\" he asked softly.\r\n\r\nMay was shaking uncontrollably, her hand clutching the walkie-talkie so tightly Weiss feared it might shatter. After what seemed like an eternity, she managed a tiny, jerky nod.\r\n\r\nAnd Jaune, the absolute doofus, just smiled. That wide, genuine smile that made his whole face light up, \"I like you too, May,\" he said it like it was the simplest thing in the world, \"I always have. Why do you think I never complained about talking to a walkie-talkie for two years?\"\r\n\r\nMay's visible eye widened impossibly further.\r\n\r\n\"You... You do?\"\r\n\r\n\"Of course I do! You're amazing. A little scary sometimes, but amazing!\"\r\n\r\nMay looked like she might faint from shock or happiness or both. She opened her mouth, closed it, opened it again, and finally managed, \"Target reciprocation... confirmed?\"\r\n\r\nJaune laughed, \"Yeah, 'target reciprocation confirmed.'\"\r\n\r\nWeiss threw up her hands in exasperation, \"Unbelievable. You two deserve each other.\" She turned and walked away as the pair began staring at each other with matching goofy expressions, May still clutching her walkie-talkie like a lifeline, Jaune looking like he'd just discovered a new continent, \"Hopefully this fixes things,\" Weiss muttered to herself. Though given May's track record, she doubted anything would ever be normal with their team.\r\n\r\nAt least she could stop playing relationship counselor via walkie-talkie. That alone was worth the intervention.\r\n\r\n[line break]\r\n\r\nWeiss had been naive. Foolishly, stupidly, embarrassingly naive. She'd actually believed that after the disastrous date and her forceful intervention, things would improve. That May would finally become a normal, visible teammate. That the walkie-talkies would be relegated to actual combat situations. That she could enjoy being part of a prestigious Huntsman team at Beacon, free from her father's shadow and partnered with the incredible Pyrrha Nikos.\r\n\r\nWhat a joke.\r\n\r\n\"Blonde Shield to Beanie One, your tactical position yesterday was impeccable. Over.\" Jaune's voice drifted across their dorm room, disgustingly fond.\r\n\r\nWeiss stabbed her pencil into her textbook with enough force to tear the page.\r\n\r\n\"Beanie One acknowledges compliment. Your pincer movement was... exceptionally executed. Over.\" Weiss's head snapped up, catching the smirk on Jaune's face as he cradled the walkie-talkie like it was made of precious gemstones. She glanced at Pyrrha, who was diligently focused on her own studies, either oblivious to or politely ignoring the barely-veiled conversation happening three feet away.\r\n\r\n\"You two know we can hear you, right?\" Weiss snapped, throwing her pencil down, \"We're literally in the same room!\"\r\n\r\nJaune at least had the decency to look embarrassed, \"We're just discussing combat techniques, Weiss.\"\r\n\r\n\"Combat techniques. Right.\" Weiss crossed her arms, \"And I suppose May's 'excellent breath control' you were praising last night was also about combat?\"\r\n\r\nJaune turned crimson, \"That was... I mean, snipers need to... control their breathing to...\"\r\n\r\n\"Save it,\" Weiss cut him off, \"At least May promised to attend classes and team meetings in person from now on, right? That was the deal.\" Jaune's sudden fascination with a loose thread on his blanket told her everything, \"Jaune,\" Weiss said dangerously, \"What happened to our agreement?\"\r\n\r\nHe scratched the back of his neck- a telltale sign of impending disappointment, \"Well, about that... May and I talked it over, and she really prefers the current arrangement. It works for her, you know? And I don't mind.\"\r\n\r\n\"You don't mind,\" Weiss repeated flatly, \"Of course you don't mind. You're so whipped you'd probably agree if she suggested communicating exclusively through smoke signals and carrier pigeons!\" She was almost tempted to call him a simp.\r\n\r\n\"That's not fair,\" Jaune protested weakly, \"She has... social anxiety.\"\r\n\r\n\"She shot Yang in the forehead five times in the cafeteria! Then made fun of her for it!\"\r\n\r\n\"Tactically,\" Jaune corrected, as if that made it any better.\r\n\r\n\"She's not socially anxious! She's a brat who hides behind a screen like a dustnet troll!\"\r\n\r\nThe walkie-talkie crackled, \"Ice Queen's blood pressure rising to critical levels again. Recommend Blonde Shield disengage from confrontation. Over.\"\r\n\r\n\"I CAN HEAR YOU!\" Weiss shrieked, lunging across the room. Jaune barely managed to hold the walkie-talkie out of her reach, rolling off his bed to create distance.\r\n\r\n\"Weiss, calm down!\" Jaune pleaded, \"May's trying. She came to the strategy meeting yesterday!\"\r\n\r\n\"For exactly eleven minutes, during which she sat in the corner with her beanie pulled down, refused to speak to anyone but you, and then 'tactically withdrew' through the window!\" Weiss pinched the bridge of her nose, trying to regain some semblance of composure. This was not how a Schnee behaved. This wasn't dignified. This wasn't-\r\n\r\n\"Beanie One to Blonde Shield,\" May's voice came through the walkie-talkie, low and suggestive, \"Looking forward to reviewing your... weapon maintenance techniques later. Your handling skills have improved significantly. Over.\"\r\n\r\nJaune actually giggled. Giggled! \"I heard your breech-loading speed is getting faster too. Over,\" he replied, his voice dropping to what he apparently thought was a seductive tone but sounded more like he was suffering from a mild throat infection.\r\n\r\n\"That's it!\" Weiss grabbed her textbooks and stomped toward the door, \"I'm studying in the library! Some of us are trying to maintain our academic standing without being subjected to... to... whatever this is!\"\r\n\r\nPyrrha finally looked up from her notes, \"Would you like some company, Weiss?\"\r\n\r\n\"Yes, please,\" Weiss practically begged. Any excuse to escape this nightmare.\r\n\r\nAs they gathered their materials, the walkie-talkie continued its torture. \"Your marksmanship is so impressive,\" Jaune cooed into the device, \"I've never seen anyone hit a moving target so accurately. Over.\"\r\n\r\nMay's voice came back immediately, \"Your shield deployment is getting much more... firm. Over.\"\r\n\r\nWeiss screamed into her textbook.\r\n\r\nOver the next week, Weiss tried every strategy she could think of to cope with her team's increasingly disturbing walkie-talkie habits.\r\n\r\nShe tried earplugs, which proved ineffective against Jaune's tendency to repeat May's messages out loud with that dopey smile on his face. She tried studying in the library, only to have Jaune appear there too, walkie-talkie clipped to his belt, whispering sweet tactical nothings when he thought no one was listening. She tried complaining to Professor Goodwitch, who merely raised an eyebrow and reminded her that team dynamics were to be resolved internally unless they affected combat performance.\r\n\r\nShe even tried appealing directly to May during one of the sniper's rare physical appearances at team training.\r\n\r\n\"Could you two at least keep your... conversations private?\" Weiss had pleaded.\r\n\r\nMay had tugged her beanie lower, her visible eye fixed on a point somewhere over Weiss's shoulder, \"All communications are coded for security. Improper interpretation is your responsibility. Over.\"\r\n\r\n\"You called his moves 'deliciously aggressive' during sparring practice!\"\r\n\r\n\"Tactical assessment only. Over.\"\r\n\r\nIt was Thursday night when Weiss finally reached her breaking point. She'd been trying to sleep, exhausted after a grueling day of classes and combat training, when Jaune's walkie-talkie crackled to life, \"Beanie One to Blonde Shield,\" May's voice was barely a whisper, \"All-clear for nighttime operation?\"\r\n\r\n\"Roger that,\" Jaune whispered back, glancing over to where Weiss was supposedly sleeping, \"Ice Queen and Red Warrior appear to be in sleep mode. Over.\"\r\n\r\nWeiss kept her eyes firmly shut, breathing evenly, though her blood pressure was skyrocketing.\r\n\r\n\"Excellent,\" May continued, \"Wanted to review your performance during today's combat exercise. Your endurance is increasing impressively. Over.\"\r\n\r\n\"Thanks,\" Jaune replied, his voice sickeningly sweet, \"I've been practicing my thrust-and-parry technique too. What did you think? Over.\"\r\n\r\n\"Very forceful. Perfect penetration of opponent defenses. Extremely... satisfying to observe. Over.\"\r\n\r\n\"Maybe tomorrow you could show me that special grip you mentioned? The one that provides better... control? Over.\"\r\n\r\n\"Affirmative, Blonde Shield. I think you'll find it gives you enhanced sensation when handling your... equipment. Over.\"\r\n\r\nWeiss grabbed her pillow, pressed it over her face, and screamed into it with every ounce of her being. The sound wasn't nearly muffled enough for them to not hear it, but of course, the two completely ignored her.\r\n\r\n\"Did you receive those special supplies I requisitioned? Over,\" May asked, her tone making it clear these weren't standard combat items.\r\n\r\n\"Yeah! The dust-infused ones? Can't wait to test them out. Over.\" Weiss pressed the pillow harder against her face, wondering if it was possible to smother herself.\r\n\r\n\"Confirmed. Recommend application in circular motion for optimal effect. Over.\"\r\n\r\n\"You're the expert. Your hands-on demonstrations are always so... educational. Over.\"\r\n\r\nThat was it! Weiss threw off her covers, stormed over to Jaune's bed, and snatched the walkie-talkie from his startled grasp, \"LISTEN HERE, YOU HORNY LITTLE MONKEYS!\" she shouted into the device, beyond caring if she woke Pyrrha or the entire dormitory, \"I DON'T CARE WHAT PERVERTED LITTLE GAME YOU TWO ARE PLAYING, BUT SOME OF US ARE TRYING TO SLEEP!\"\r\n\r\nThere was a long silence. Pyrrha sat up in bed, blinking in confusion. The walkie-talkie crackled, \"Ice Queen, we were discussing combat techniques and dust application for weapon maintenance. Over.\"\r\n\r\n\"Oh, please,\" Weiss snarled, \"You think I don't know what 'thrust-and-parry technique' and 'hands-on demonstrations' really mean? I've seen enough sitcoms to recognize thinly-veiled innuendo when I hear it!\" Sitcoms. Her guilty pleasures alongside chicken wings.\r\n\r\nAnother silence. Then, to Weiss's utter disbelief, May's voice came back, sounding genuinely confused, \"Blonde Shield's sword requires specific thrust techniques to maximize effectiveness. And dust application is standard weapons maintenance. What did you think we were discussing? Over.\"\r\n\r\nJaune was looking at Weiss with wide, innocent eyes. Too innocent, \"Yeah, Weiss. We're just talking about training techniques.\"\r\n\r\n\"Arc, your acting sucks more than your combat skills.\" Jaune winced. Good, \"If you think either of you are being subtle, you're more deluded than Blake thinking that wiggling bow is hiding her cat ears.\" Seriously, she hadn't even changed her last name! \"Now, if the two of you don't stop making asses of yourselves, I'm going to find May and destroy every single walkie talkie she has then blacklist her from every store that sells more. Are we clear?\"\r\n\r\n\"Y-Yeah, sure, Weiss...\"\r\n\r\n\"... Understood. Over.\"\r\n\r\n\"Good.\" She pressed the walkie talkie back to Jaune's chest none-too-gently then stomped back to bed. For the next few minutes, blissful silence was their only companion. Weiss' perpetual frown finally dimmed and she felt herself relaxing.\r\n\r\n...And then those two animal-brained cretins couldn't help themselves.\r\n\r\n\"J-Jaune, I'm... I'm inserting the magazine,\" May's voice cut in, quiet but not nearly quiet enough, \"The...The bullets are going in the chamber, Jaune. They're filling up every inch. Oh, I'm about to fire~\"\r\n\r\n\"Do it, May. Shoot it all out.\"\r\n\r\n...\r\n\r\nWeiss slowly counted to 1000. Tomorrow, she thought. Tomorrow she'd make May and Arc pay for their insanity. Destroying her walkie talkies like she threatened would be a start, but first she needed to find the right earplugs so May's screeching wouldn't deafen her. After that? Oh yes, revenge would be delicious.\r\n\r\n[line break]\r\n\r\nPoor Weiss. Again. Works her ass off to have May stop being a sniper troll and she ends up just having walkie walkie sex with Jaune. She's gonna fucking destroy these two, but the exact methods how will be left to the reader's imagination ;)\r\n\r\nAnyway, hope you guys enjoyed this one. Maid Jaune is next along with a NSFW comedic White Knight time travel fic commissioned by someone."
    }
  ]
}