{
  "title": "Mr and Mrs Arc-Schnee",
  "author": "Vendetta543",
  "synopsis": "When Jaune and Weiss finished signing their divorce papers, the last thing they expected was to get killed by White Fang remnants in a terrorist bombing. Or to somehow end up back in time two years before Beacon. Now two divorced time travelers have to stop the fall of Beacon, save their friends, and stop Salem. All while trying not to kill each other.",
 
  "chapters":[
    {
      "title": "Chapter 1",
      "text": "Commission that came from an idea. Jaune and Weiss being a bitter divorced married couple who both end up going back in time. Cue them both trying to fix things while falling in love again as they avert tragedies. Poor Ruby is caught in the middle.\r\n\r\nNote: four of the five chapters are already done, so don't worry about this being unfinished.\r\n\r\nFor anyone interested in making a commission, email me at: storylover543 gmail . com\r\n\r\nWeiss Arc-Schnee's heels clicked aggressively against the marble floor of the courthouse. Each step reverberated with the precision of a metronome and the fury of a woman scorned. Thirty years old, and already getting divorced. Her father would have had a field day with this if he weren't rotting six feet under where Atlas fell.\r\n\r\n\"Sign here, and here, and initial there,\" the lawyer droned, pointing at various lines on the document that would officially end five years of what Weiss was now categorizing as \"matrimonial hell.\"\r\n\r\nJaune, the soon-to-be-ex-husband in question, slouched in his chair across the table. At thirty, he still somehow managed to look like that bumbling seventeen-year-old who had incessantly hit on her at Beacon. Except now he was a respected Huntsman, with muscles and confidence and a fan club of swooning girls who sent him cookies and cards addressed to \"Beacon's Blond Knight.\"\r\n\r\n\"Could you please stop grinding your teeth, Weiss? I can hear it from over here,\" Jaune said, his blue eyes pleading for some semblance of peace.\r\n\r\n\"I am not grinding my teeth,\" Weiss lied, absolutely grinding her teeth. Her dentist would've cried.\r\n\r\nThe lawyer - a portly faunus with mouse ears that twitched nervously at every spike in tension - cleared his throat, \"If we could proceed? I have another divorce at three.\"\r\n\r\n\"Popular day for heartbreak,\" Weiss muttered, snatching the pen and signing with the flourish of someone autographing hate mail.\r\n\r\nShe remembered how it used to be. The early days of their marriage when they would curl up on the couch, his hands in her hair, talking about their future. Before the new revamped SDC demanded sixty-hour work weeks from her. Before Jaune started taking Huntsman missions that lasted months at a time. Before they became two people who happened to occasionally sleep in the same bed instead of husband and wife.\r\n\r\nAnd before she came home last week to find Ruby Rose - her partner, her best friend, her fucking homewrecker - walking out of Jaune's room wearing THEIR hoodie. The blue one with the bunny on it that Weiss had bought him for their first anniversary.\r\n\r\n\"It's just a hoodie, Weiss,\" Jaune had insisted, \"She was cold, and it was the first thing I grabbed.\" Cold? In the middle of summer? In Vale? Sure. And beowolves were just misunderstood puppies.\r\n\r\n\"All done,\" the lawyer announced, collecting the papers, \"Congratulations, you're officially divorced. The split is as agreed - Mr. Arc makes no claim to Schnee Dust Company assets, and Mrs.- I mean, Ms. Schnee makes no claim to Mr. Arc's Huntsman pension.\" Jaune hadn't fought for anything in the divorce. Not the house, not the vacation property in Vacuo, not even the ridiculous coffee machine he'd insisted they needed. It just confirmed what Weiss already knew - he had already moved on.\r\n\r\nWith Ruby.\r\n\r\nJust like Summer Rose had done with Taiyang after Raven left. The Rose women apparently had a type: blonde, broken, and belonging to someone else. Well, not anymore. She could have him!\r\n\r\n\"So, that's it?\" Jaune asked, standing and awkwardly pushing in his chair. The chair leg caught on the carpet, making a sound like a wounded animal. Clumsy oaf.\r\n\r\n\"That's it,\" Weiss confirmed, not looking at him. If she looked at him, she might cry, and Schnees didn't cry in public. It was practically the family motto, right after \"Exploit the Faunus\" and \"Emotional repression builds character.\"\r\n\r\nThey walked out of the lawyer's office together, a final act of unity in their lack of it. The summer sun hit Weiss's face like an accusation, too bright and cheerful for the occasion, \"Well,\" Jaune said, rocking back on his heels. He was looking anywhere else but her, \"I guess this is goodbye.\"\r\n\r\n\"Guess so,\" Weiss replied, chin high, spine straight, heart breaking. But she refused to give him the satisfaction, \"Say hi to Ruby for me. Tell her she can keep the hoodie. I'm sure she already marked her scent on it.\"\r\n\r\nJaune's face crumpled, \"Weiss, there's nothing-\"\r\n\r\n\"Save it,\" Weiss cut him off, \"I'm not blind, Jaune. I've seen how she looks at you. How she's always there when we fight. How she messages you at two in the morning because she 'had a nightmare'.\" Weiss made aggressive air quotes, \"Ruby's been circling like a vulture, waiting for our marriage to die so she could swoop in and feast on the remains.\"\r\n\r\n\"That's not fair, and you know it,\" Jaune argued, his voice taking on that reasonable tone that made Weiss want to stab him with Myrtenaster, \"Ruby's our friend. She's been trying to help.\"\r\n\r\n\"Help herself to my husband,\" Weiss snorted. Ex-husband, she reminded herself bitterly.\r\n\r\nA small crowd was gathering on the steps of the courthouse, several faunus with signs. Probably another protest about faunus rights - Weiss had been working on reforms at the SDC, but centuries of discrimination weren't erased in five years, no matter how many diversity initiatives she implemented. Without Salem, people didn't waste time going back to old conflicts.\r\n\r\n\"You know what? I'm done,\" Jaune said, throwing his hands up, \"This is exactly why we couldn't make it work. You always assume the worst of people.\"\r\n\r\n\"And you're too naive to see what's right in front of your face!\" Weiss shot back. The faunus crowd was getting louder, but Weiss was too busy systematically dismantling her ex-husband's character to pay attention.\r\n\r\n\"Maybe if you'd been home more than three days a month, you would have noticed how our marriage was falling apart!\" Jaune's voice rose to match hers.\r\n\r\n\"Maybe if you'd focused more on your WIFE than your groupies, we wouldn't BE in this situation!\" Weiss screamed, feeling her face flush with rage.\r\n\r\n\"FOR THE WHITE FANG!\" someone suddenly shouted from the crowd.\r\n\r\nWeiss and Jaune both turned, argument temporarily forgotten. Several faunus ripped open their jackets, revealing vests packed with Dust crystals wired to crude detonators. The red crystals glowed ominously in the sunlight. Her hands went to her side and only found air. She'd left Myrtenaster in her car because weapons were forbidden in the courthouse. Stupid, stupid, stupid!\r\n\r\n\"Weiss!\" Jaune's eyes widened in alarm.\r\n\r\nIn that moment, as her ex-husband lunged toward her, Weiss had two thoughts:\r\n\r\nFirst: Even in divorce, his timing is terrible.\r\n\r\nSecond: I'm going to die in last season's boots.\r\n\r\nJaune's body slammed into hers as the world exploded in a blinding flash of white.\r\n\r\nWeiss woke up with a scream. Her heart hammered against her ribs like a trapped Nevermore, and she bolted upright with a gasp that felt like her first breath after drowning, \"The courthouse-\" she blurted to the empty room, her hand flying to her chest.\r\n\r\nMemories crashed through her mind with the force of a derailed Dust train. The divorce papers. Jaune's sad puppy dog eyes. The Faunus terrorists. The explosion. Jaune throwing himself over her in one final, infuriating act of chivalry. Weiss blinked rapidly, trying to orient herself. This wasn't a hospital. It wasn't her penthouse in Mistral with its minimalist decor and view of the city skyline. It wasn't even the modest but comfortable home she'd shared with Jaune before everything imploded spectacularly (both literally and figuratively).\r\n\r\nShe was in a bedroom. A very specific bedroom.\r\n\r\n\"No,\" she whispered, her voice sounding wrong in her ears. Higher. Softer, \"No, no, no.\" Weiss swung her legs over the edge of the bed, noticing immediately how much shorter they seemed. Her feet barely grazed the plush white carpet. When she stood, a wave of vertigo sent her stumbling, as if her body didn't match the movements her brain was commanding, \"This isn't possible,\" she muttered.\r\n\r\nThe ice-blue walls. The ornate four-poster bed with its pristine white comforter. The framed oil painting of the Schnee family - looking miserable in their finery with only Whitley smiling - hanging on the wall. The silver hairbrush on the vanity that had been a gift from Klein on her twelfth birthday. The same one that had been lost in the rubble in Atlas' fall.\r\n\r\nWeiss knew this room intimately. She'd spent seventeen years of her life trapped in it, after all.\r\n\r\nShe moved toward the bathroom with the cautious steps of someone crossing a minefield, bracing herself for what she might see. The marble floor was cold beneath her bare feet, familiar and alien all at once. When she flipped on the light and faced the mirror, the reflection staring back nearly made her knees buckle.\r\n\r\n\"By the Brothers...\" she breathed.\r\n\r\nGone was the confident, poised woman of thirty with stress lines beginning to form around her eyes and a permanent furrow between her brows from years of boardroom battles. Gone was the distinctive scar that had bisected her left eye - a mark earned in battle and worn as a badge of honor. Instead, she saw a girl. A child, really. Fourteen, maybe fifteen at most. Pale, unblemished skin. Hair a pristine white, pulled back in a side ponytail that she hadn't worn since her Beacon days. Eyes wide with shock, showing far more vulnerability than Weiss Schnee had allowed herself in nearly two decades.\r\n\r\n\"This can't be happening,\" she whispered to her reflection, which perfectly mimicked her mounting panic. She pinched her cheek hard enough to leave a red mark. The pain was sharp and immediate.\r\n\r\nNot a dream, then.\r\n\r\nA high-pitched melody broke the silence, making Weiss jump so violently she nearly slipped on the marble floor. Her scroll - an older model, she realized with growing dread - was chiming from the bedside table. She approached it like it might transform into a King Taijitu, gingerly picking it up with trembling fingers that seemed far too small and delicate. The notification light blinked an urgent blue.\r\n\r\nOne new message from Winter. Weiss swiped the screen, her muscle memory still intact despite the years (or lack thereof).\r\n\r\nReminder: Training begins at 0700 hours. Do not be late. Remember what you're fighting for. Your place at Beacon Academy depends on your performance. I expect nothing less than excellence.\r\n\r\n- Winter\r\n\r\nWeiss sat down heavily on the edge of the bed, scroll clutched in her hand like a lifeline.\r\n\r\nBeacon. She hadn't even started at Beacon yet. Which meant-\r\n\r\n\"I'm back before everything,\" she whispered, her analytical mind racing to calculate the implications, \"Before the Fall, before Salem, before-\"\r\n\r\nBefore Jaune. Before Team RWBY. Before the Fall of Beacon and the Battle of Haven and the Siege of Atlas. Before she knew what it meant to have real friends... and real enemies. She pinched her thigh viciously, harder this time, twisting the pale skin until tears sprang to her eyes. The pain was sharp, immediate, and utterly real.\r\n\r\n\"Time travel,\" she said, the words feeling ridiculous on her tongue, \"Or I've gone completely insane. Either option seems equally plausible at this point.\"\r\n\r\nWeiss stood again, more steady this time as she paced the length of her childhood prison. If she was truly back in time, before Beacon, that meant she had approximately two to three years before she would even meet Ruby, her homewrecking future(?) best friend. Before she hoped to be paired with Pyrrha Nikos - dear, doomed Pyrrha - during initiation, only to end up with Ruby as her partner instead. Before she would meet the bumbling, scraggly-haired boy who would someday become her husband.\r\n\r\nEx-husband.\r\n\r\n\"Focus, Weiss,\" she muttered, the habit of self-criticism coming back as naturally as breathing, \"If this is real, then you need a plan.\" She walked to the window, pulling back the curtain to reveal the sprawling Schnee estate blanketed in snow. Atlas. Still floating in the sky, pristine and unbroken. A city that in her timeline had crashed into the ground, taking gods only knew how many lives with it despite their attempts to evacuate.\r\n\r\n\"I can change things,\" she realized, her heartbeat quickening with the enormity of the thought, \"I know what's coming. The Breach. The Fall. The Relics. Salem.\" A strange, giddy laugh bubbled up from her chest. It was all so absurd, and yet- what an opportunity. To fix the mistakes of the past, to save lives, to prevent catastrophes.\r\n\r\nAnd to absolutely destroy her father.\r\n\r\nJacques Schnee. Still alive in this timeline. Still ruling the SDC with an iron fist dripping with faunus blood and corruption. Still psychologically torturing his children while presenting a polished public image. A slow, predatory smile spread across Weiss's face. An expression that would have looked utterly foreign on the fifteen-year-old girl she appeared to be, but felt perfectly natural to the woman she really was.\r\n\r\n\"Oh, Father,\" she murmured, the word coated in ice, \"You have no idea what's coming.\"\r\n\r\nShe had decades of corporate knowledge, insider trading information, and the exact details of every illegal scheme her father had ever concocted. She knew which board members were loyal and which could be swayed. She knew about the secret accounts in Vacuo, the backdoor deals with dust smugglers, the bribes to council members. It would be difficult to getk but not impossible. Not with the exact details she knew.\r\n\r\nAnd most importantly, she knew exactly how to use all of it to systematically dismantle Jacques Schnee's empire and reputation, piece by precious piece.\r\n\r\nThe dizzying possibilities stretched before her like an open road. She could save Pyrrha. Prevent the Fall of Beacon. Expose Cinder's plans before they ever came to fruition. Protect Penny. Keep the Relics safe from Salem's cabal.\r\n\r\nShe could even, the thought came unbidden, avoid the mistake of marrying Jaune Arc in the first place.\r\n\r\n\"No,\" she said firmly, pushing away thoughts of blue eyes and clumsy proposals, \"Focus on what matters.\"\r\n\r\nFirst, her father. Then, saving the world.\r\n\r\nHer scroll chimed again - a reminder that she had training in twenty minutes. Weiss straightened her shoulders, chin lifting in the practiced Schnee posture that had been drilled into her since childhood. She might look like a teenage girl, but inside, she was Weiss Schnee-Arc - no, just Schnee now - CEO of the largest Dust company in Remnant, veteran Huntress, and one of the saviors of the world.\r\n\r\n\"Time to remind Winter what a Schnee is truly capable of,\" she said with a smirk, heading to her closet to select an outfit for her first day in this second chance at life.\r\n\r\nAnother memory came unbidden. Their wedding day. Walking down the aisle, Ruby - that traitor - as her maid of honor. Winter, Whitley, Mother and the rest of their friends joining them for that one beautiful day. She remembered seeing Jaune standing by the altar looking at her swith a smile that could melt Solitas snow. She'd been so convinced back then that she'd found the one.\r\n\r\nShe thook the thought away and replaced it with another that crystallized with perfect clarity: this time, everything would be different.\r\n\r\nJaune's eyes snapped open to the sound of someone singing an off-key rendition of \"Shine\" by The Achieve Men. For one disorienting moment, he thought he was back in the JNPR dorm room with Nora belting out lyrics while Ren silently suffered beside her.\r\n\r\nThen the memories hit him like a charging Boarbatusk. The courthouse, the White Fang terrorists, the explosion, Weiss's look of absolute fury turning to shock as he lunged to protect her...\r\n\r\n\"Weiss,\" he croaked, his voice cracking in the middle of the word.\r\n\r\nWait. His voice cracked?\r\n\r\nJaune pushed himself up, immediately noticing that something was very, very wrong. His arms felt too long for his body. His chest, which had sported well-defined muscles from years of Huntsman work, felt flat and unremarkable beneath his pajama top. Speaking of which. He glanced down. Was this his Pumpkin Pete onesie?\r\n\r\n\"What the hell?\" he muttered, scrambling out of bed and promptly tripping over feet that seemed determined to betray him. He crashed to the wooden floor with all the grace of a tranquilized Ursa.\r\n\r\nFrom down the hall, a female voice called out, \"Jaune? Are you okay in there?\"\r\n\r\nThat voice. It was impossible. It couldn't be-\r\n\r\n\"I'm fine, Mom!\" Jaune shouted back automatically, then clapped a hand over his mouth. Mom? His mother had died during the Atlas evacuation. She'd been visiting along with Saphron when the city fell. The grief had nearly destroyed him, and only Weiss's quiet, steady presence had pulled him through those dark months.\r\n\r\nWeiss, who'd just finalized their divorce when the world literally exploded around them.\r\n\r\nHeart pounding, Jaune staggered to his feet and looked around. This wasn't his apartment in Vale. It wasn't the hospital room he would have expected after an explosion.\r\n\r\nIt was his childhood bedroom in Domremy.\r\n\r\nVideo game posters plastered the walls. A shelf of comic books sagged in the corner. The battered acoustic guitar he'd never learned to play properly leaned against the desk. On the bedside table sat a worn, dog-eared copy of X-Ray and Vav: The Ultimate Collection, \"This isn't possible,\" he whispered, making his way to the small mirror hanging on the back of his door.\r\n\r\nThe reflection staring back made him stumble backward until his knees hit the bed.\r\n\r\nThe face that stared back at him made him release a strangled sound somewhere between a gasp and a squeak. Gangly limbs, narrow shoulders, a face free from the scar that should have run along his jawline (courtesy of a particularly nasty Beowolf during a mission in Vacuo). And most notably, not a hint of the beard he'd grown after the divorce. The beard Nora had described as his \"divorced dad beard\" (nevermind that he wasn't a father).\r\n\r\nHe was fifteen again. Maybe even fourteen.\r\n\r\n\"I've gone back in time,\" Jaune said to his reflection, which looked appropriately horrified at the prospect, \"Or I'm having the most detailed dying hallucination in the history of dying hallucinations.\"\r\n\r\nHe pinched himself hard on the arm.\r\n\r\n\"OW!\" he hissed, \"Okay, so not a hallucination. Unless hallucinations can feel pain, which seems unfair.\"\r\n\r\nHe paced the small bedroom, nearly tripping over discarded comic books and a half-eaten sandwich that really shouldn't have been on the floor in the first place. His mind raced through possibilities, each more ridiculous than the last.\r\n\r\n\"Time travel. Actual, literal time travel,\" he finally said, running his hands through hair that was shaggier than he'd worn it in years, \"Because apparently explosive divorce proceedings can tear holes in the space-time continuum. That seems reasonable.\"\r\n\r\nJaune sank down onto his bed, the ancient springs creaking ominously under even his negligible teenage weight. If he really had traveled back in time, that meant he was years away from Beacon. Years away from meeting Ruby and Yang and Blake. Years away from being paired with Pyrrha.\r\n\r\nPyrrha.\r\n\r\n\"She's alive,\" he whispered, the realization hitting him like a charging Boarbatusk, \"Pyrrha's still alive.\" A complicated wave of emotions swept through him. Grief for his first partner, who had died far too young. Guilt for the year he'd spent oblivious to her feelings. And a strange, uncomfortable pang when he thought about Weiss; his ex-wife as of approximately thirty minutes and one temporal explosion ago.\r\n\r\n\"Weiss,\" he said, the name feeling different on his teenage lips, \"Did she...?\" No, that was impossible. Just because he'd been thrown back in time didn't mean Weiss was too. She was probably still on those courthouse steps. Or more likely, given the bombs, in some kind of afterlife. The thought made his chest ache. For all their fighting, for all the harsh words and broken promises, he did love her.\r\n\r\n\"Focus, Jaune,\" he muttered, channeling his inner Weiss with disturbing accuracy, \"If this is real, you have a second chance. You can change things.\" He could save Pyrrha. He could prevent the Fall of Beacon. He could warn everyone about Cinder and Salem and the Relics.\r\n\r\nHe could even, the thought came with a pang of both relief and regret, avoid the mistake of marrying Weiss in the first place.\r\n\r\nTheir marriage had been doomed from the start, hadn't it? Two people with completely different priorities, trying to force a relationship work while the world pulled them in opposite directions. Weiss with her company, him with his Huntsman duties. Both of them too stubborn to compromise, too proud to admit when they were wrong.\r\n\r\nAnd then there was the whole Ruby situation, which was a complete misunderstanding that Weiss had blown wildly out of proportion. Ruby had just been returning his hoodie after borrowing it during a mission when her cloak got torn. That was it. But try telling that to Weiss when she was in full ice queen mode.\r\n\r\n\"Nope,\" Jaune said firmly, cutting off that train of thought before it could spiral into another imaginary argument with his ex-wife, \"Not going down that road again. This time, it'll be different.\"\r\n\r\nHe stood up with newfound determination, stumbling slightly as his gangly teenage limbs betrayed him. He caught himself on the edge of his desk, knocking over a stack of brochures for combat schools and Huntsman academies. Schools he'd never actually attended before faking his way into Beacon. He'd just been a lazy teenager with dreams of heroics without the drive to actually earn it.\r\n\r\nThe sight of them sparked an idea.\r\n\r\n\"No more fake transcripts,\" he said, picking up one of the brochures, \"I know how to fight now. Well, my brain knows how to fight. My body's still...\" He glanced down at his skinny arms and sighed, \"...A work in progress.\"\r\n\r\nBut he had time. If he was truly back before Beacon, he had at least a couple of years to train properly this time. To build up the strength and skills he'd eventually developed under Pyrrha's tutelage - and later, as a full-fledged Huntsman. He could pass the entrance exams legitimately. No lies, no shortcuts, no endangering his friends because he wasn't prepared.\r\n\r\n\"And no Weiss,\" he added, trying to sound firm rather than wistful, \"Definitely no Weiss this time around.\"She wouldn't remember their relationship. Their marriage. Their divorce. She'd just be that snippy heiress who looked down her nose at him from day one.\r\n\r\nThe thought was oddly depressing.\r\n\r\n\"It's for the best,\" Jaune told himself, reaching for Crocea Mors. Dad didn't really care for it and he let them take it out of the fireplace whenever they wanted. Really, it was just him, though. No one else in the family dreamed of being Huntsmen or fighters. The sword felt both foreign and familiar in his grip. Lighter than he remembered, but perfectly balanced,\r\n\r\nHe swung the sword experimentally, his muscle memory at odds with his underdeveloped physique. He nearly took out his desk lamp but managed to correct at the last second.\r\n\r\n\"Okay, so that needs work,\" he muttered with a grimace.\r\n\r\nJaune looked out his window at the pre-dawn sky, the first hints of sunlight just beginning to peek over the horizon. Most of the family would still be asleep for another hour at least. Plenty of time to start his new training regimen.\r\n\r\n\"Time to get to work,\" he said , changing out of his bunny onesie and into the closest thing he owned to workout clothes, \"This time, I'm doing everything right.\"\r\n\r\nHe paused at his bedroom door, one last thought of Weiss flashing through his mind. Her face on their wedding day, snowflakes caught in her eyelashes as she smiled up at him. It had been the happiest day of his life.\r\n\r\nJaune shook his head, pushing the memory away. He slipped out into the hallway, Crocea Mors clutched in his determined grip, ready to begin rewriting history one proper sword swing at a time.\r\n\r\nRuby couldn't believe it. After years of training at Signal, after all those nights staying up late reading weapon magazines and practicing with Crescent Rose until her arms felt like noodles, she was finally here. Beacon Academy! Two years early! She almost wanted to thank Torchwick for being a jerk and trying to rob that store.\r\n\r\nThe airship landed, and Ruby was practically vibrating with excitement as she descended the ramp, silver eyes wide and sparkling at the sight of the towering spires and amazing architecture, \"Oh my gosh, Yang! Look at that girl's collapsible staff! And that guy has a fire sword! Is that a gun-axe? IT'S A GUN-AXE! Just like mom!\" Ruby bounced on her toes, pointing wildly at every weapon in sight, her enthusiasm threatening to launch her into the stratosphere. Yang, her long-suffering older sister, placed a steadying hand on her shoulder.\r\n\r\n\"Easy there, Rubes. They're just weapons.\" Yang rolled her eyes\r\n\r\nRuby gasped, clutching her chest as if mortally wounded, \"Just weapons? JUST WEAPONS? They're extensions of ourselves! They're part of us! Oh, they're so cool...\"\r\n\r\nYang chuckled, running a hand through her blonde hair, \"Well, why don't you go make some friends instead of gawking at their gear?\"\r\n\r\n\"Huh? Why would I need friends when I have you?\" Ruby asked, suddenly feeling the familiar anxiety of being thrust into a new, ugh, social situation. Meeting new people was hard. Weapons were easy. Weapons didn't judge you or think you were weird for being obsessed with weapons. If they could talk, they would've been thanking her for being so nice to them.\r\n\r\n\"Wellllll,\" Yang drawled, backing away slowly as a group of her friends from Signal appeared behind her, \"Actually, my friends are here now. Gotta go catch up. 'Kay, see ya, bye!\"\r\n\r\nAnd just like that, Yang was gone in a swirl of blonde hair and casual betrayal, leaving Ruby spinning literally and figuratively.\r\n\r\n\"Wait! Where are you going? Where are we supposed to go?! Yang?!\" Ruby called after her TRAITOROUS sister, nervous dizziness overtaking her as she stumbled backward, \"I don't know what I'm doing...\"\r\n\r\nRuby teetered dangerously, about to fall directly into someone's luggage, when an arm shot out and yanked a briefcase away from her path. Ruby caught herself at the last second, narrowly avoiding a collision with the ground.\r\n\r\n\"Not this time,\" came a crisp, snobby voice. Ruby looked up to see a girl dressed in pristine white, with pale skin and hair like freshly fallen snow pulled back in an off-center ponytail. She was pretty in the way expensive statues were. A little cold, a little perfect, and a little intimidating. Even had the same color palette.\r\n\r\n\"Um, I'm sorry?\" Ruby said, straightening her red cloak, \"I didn't mean to almost fall on your... stuff.\"\r\n\r\nThe white-haired girl was staring at her with an intensity that made Ruby want to check if she had cookie crumbs on her face. There was something weirdly... knowing in that gaze, like the girl was seeing someone else when she looked at Ruby.\r\n\r\n\"Right. Well.\" The girl seemed to catch herself, smoothing invisible wrinkles from her combat skirt, \"I suppose I should introduce myself. I'm Weiss Schnee, heiress to the Schnee Dust Company.\" She paused, then corrected herself, \"Co-CEO, actually.\"\r\n\r\n\"Oh! I'm Ruby! Ruby Rose. It's nice to meet-\"\r\n\r\n\"We're going to be partners for the next four years,\" Weiss interrupted, her tone leaving no room for debate. It wasn't a suggestion or even a prediction. It was a command, like a Queen telling some peasant an order.\r\n\r\nRuby blinked owlishly, \"Wait, what? How do you know-\"\r\n\r\n\"And I'll be keeping an eye on you,\" Weiss continued, narrowing her ice-blue eyes, \"Homewrecker.\"\r\n\r\nRuby's mouth fell open. Of all the bizarre introductions she'd imagined having at Beacon, being called a home-destroying epithet by a total stranger hadn't even made the list, \"What the heck is that supposed to mean?!\" Ruby sputtered, her voice rising an octave, \"I've never wrecked a home in my life! Well, except for that one time with Zwei and the blender, but that was an accident and it was only the kitchen, not the whole house, and I don't even know you!\"\r\n\r\nBefore Weiss could respond - and judging by her expression, she had something planned - another voice cut in, \"I'm surprised the new co-CEO of the Schnee Dust Company is attending Beacon at all,\" said a girl with long black hair, amber eyes, and a black bow perched atop her head. She stood a few feet away, arms crossed and expression cautious, \"Shouldn't you be too busy exploiting faunus labor?\"\r\n\r\nInstead of bristling at the accusation like Ruby expected, Weiss merely smiled. It was a sharp smile, the kind that reminded Ruby of Uncle Qrow right before he sliced a Beowolf in half, \"Whitley and my mother can handle the company for now,\" Weiss replied coolly. Then, without missing a beat, she added, \"Oh, and by the way? Do take off that bow. You're not fooling anyone, Belladonna.\"\r\n\r\nThe black-haired girl gasped, one hand flying protectively to her bow as her amber eyes widened in alarm, \"How do you-\"\r\n\r\nWeiss rolled her eyes dramatically, \"You didn't even bother to change your last name. Who do you think you're fooling?\" She adjusted the collar of her bolero jacket with meticulous precision, \"And before you start on your tirade about faunus treatment under the SDC, I'm dealing with it, okay? I only took over three years ago. Decades of oppression can't be fixed with a snap of your fingers.\" She snapped for emphasis, \"So if you have any lectures about how I'm draping myself in blood money? Shut it.\"\r\n\r\nAnd with that, Weiss snatched up her briefcase, spun on her heel with military precision, and strode away, leaving behind the faint scent of expensive perfume and utter confusion. Ruby and the bow-wearing girl - Belladonna, apparently - stared after her retreating figure, then turned to each other with matching expressions of bewilderment.\r\n\r\n\"What. The. Heck. Was. THAT?!\" Ruby shouted, throwing her arms up, \"Did you know her? Does she know you? Why did she call me a homewrecker? I'M FIFTEEN! I don't even know how to wreck a home!\" She knew how to wreck faces, but a home? Who did that?\r\n\r\nThe dark-haired girl shook her head slowly, amber eyes still wide with shock, \"I've never met her before in my life,\" she said quietly, \"But she knew...\" She trailed off, hand still protectively hovering near her bow.\r\n\r\n\"Knew what?\" Ruby asked.\r\n\r\n\"Nothing,\" the girl replied quickly. Then, as if remembering her manners, she extended a hand, \"I'm Blake. Blake Belladonna.\"\r\n\r\n\"Ruby Rose,\" Ruby replied, shaking Blake's hand, \"Did that Weiss girl seem... weird to you? Like, not just rich-girl weird, but like... she knew things she shouldn't know?\"\r\n\r\nBlake nodded slowly, \"Very weird. It was like she was having a completely different conversation than we were.\" She glanced in the direction Weiss had disappeared, \"How did she know about- ugh,never mind.\"\r\n\r\nRuby kicked at the ground with the toe of her boot, \"Well, this is a great start to my first day at Beacon. My sister abandons me, I almost faceplant in front of everyone, and some random girl who's apparently a CEO calls me a homewrecker and decides we're going to be partners.\" She sighed dramatically, \"At least it can't get any weirder, right?\"\r\n\r\nBlake raised an eyebrow, \"I wouldn't count on that.\"\r\n\r\n\"So, uh, I'm gonna head to the auditorium,\" Ruby said, backing away from Blake, \"It was nice meeting you! Good luck with your... bow situation?\" She flicked her eyes upwards. Did...Did it just twitch?\r\n\r\nBlake gave her a flat look, \"Thanks.\"\r\n\r\n\"Cool, cool, cool,\" Ruby said, finger-gunning awkwardly as she continued her tactical retreat, \"See ya around!\"\r\n\r\nOh my gosh, she was such a dork, Ruby thought, cringing at herself as she speed-walked away. Finger guns? Really? Dad would be so proud and that's, like, the worst part. Ruby pulled her hood up, trying to make herself as small as possible. All she wanted was to find Yang, maybe hide behind her for the rest of orientation, and definitely avoid that scary Weiss girl who'd called her a homewrecker, whatever that was supposed to mean.\r\n\r\nShe was so busy looking down at her boots and mentally replaying her social failure that she didn't notice the tall boy until she slammed right into his chest. She grunted, bouncing off him like a rubber ball and landing flat on her butt.\r\n\r\n\"Whoa! Sorry about that,\" said a voice from above her. A hand appeared in her field of vision, \"Need a hand?\"\r\n\r\nRuby looked up to see a tall, lanky boy with messy blonde hair and blue eyes. He was wearing jeans and a black hoodie with armor pieces strapped over it, a sword slung over his right hip, \"Thanks,\" Ruby said, grabbing his hand and letting him pull her up, \"I wasn't looking where I was going. Too busy hiding from the crazy white-haired girl who thinks I'm going to destroy her house or something.\"\r\n\r\nThe boy froze for a split second, then laughed a little too loudly, \"Crazy white-haired girl, huh? That's, uh, that's something.\" Ruby narrowed her eyes. There was something weird about the way he said it, like he knew exactly who she was talking about, \"I'm Jaune,\" he said quickly, cutting off her thoughts, \"Jaune Arc. Short, sweet, rolls off the tongue.\" He paused, wincing like he'd just said something embarrassing, \"I mean, that's my name. Just my name. Not a pickup line or anything. Definitely not hitting on you.\"\r\n\r\n\"Okaaaaay,\" Ruby said. This day was just getting weirder and weirder, \"I'm Ruby. Ruby Rose.\"\r\n\r\nJaune nodded, like her name confirmed something he already suspected, \"Nice to meet you, Ruby. Are you headed to the auditorium?\"\r\n\r\n\"I guess so. Wanna walk together? I don't actually know where it is, and my sister ditched me, and I'm kind of having the worst first day ever.\"\r\n\r\n\"Sure,\" Jaune said, gesturing ahead, \"It's this way. And don't worry, my first day's been pretty weird too.\"\r\n\r\nThey started walking, and Ruby found herself relaxing a bit. At least Jaune seemed normal-ish, even if he was being super careful with his words. Like he was tiptoeing through a minefield or something, \"So,\" she said, desperate to fill the silence, \"I've got this.\" She whipped out Crescent Rose, the massive scythe unfolding with a series of satisfying mechanical clicks until it towered over both of them.\r\n\r\nJaune jumped back, but not as far as most people did. Actually, the way he jumped was weird too. Like he did it because he was supposed to, \"Whoa! Is that a scythe?\"\r\n\r\n\"It's also a customizable, high-impact sniper rifle,\" Ruby said proudly.\r\n\r\n\"A gun-scythe,\" Jaune said, nodding, \"That's... exactly what I'd expect from you.\"\r\n\r\nRuby frowned, \"What's that supposed to mean?\"\r\n\r\n\"Nothing!\" Jaune said quickly - a little too quickly, \"Just that, you know, it's a cool weapon. Really fits your... aesthetic.\"\r\n\r\nHe was doing it again. Choosing his words super carefully, like he was afraid of saying the wrong thing. Like he knew her already, which was impossible unless... \"Did Yang put you up to this?\" Ruby scowled, \"Is this some kind of prank? Send the socially awkward weirdo to talk to Ruby so she feels better about how she can't make any friends?\"\r\n\r\n\"What? No!\" Jaune protested, looking genuinely confused, \"I barely know Yang- I mean, I don't know Yang at all. Who's Yang? Your sister, right? The one who ditched you? That's what you said earlier. Not that I know anything about her. Because I don't. At all.\"\r\n\r\nRuby stared at him. He was sweating now. Actually sweating, \"You're being super weird,\" she said.\r\n\r\nJaune sighed, shoulders slumping, \"Yeah, I know. Sorry. First day nerves, I guess.\"\r\n\r\n\"It's okay,\" Ruby said, expression softening, \"I'm basically a walking ball of awkward myself. So what's your weapon?\"\r\n\r\nJaune seemed to relax at the question. He drew his sword, the motion smooth and practiced, \"Pretty standard stuff. Sword and collapsible shield. My great-grandfather used it in the war.\"\r\n\r\nRuby couldn't help the little snort that escaped her, \"Retro.\" Not that she was AGAINST the classics, of coruse, but mechashift was just...it was the dream. Besides, what kind of weapon didn't have an explosive component nowadays?\r\n\r\n\"It gets the job done,\" Jaune said with a shrug, but there was something in his eyes that suggested more.\r\n\r\nThey continued walking, chatting about weapons and how overwhelming Beacon was. Ruby was just starting to think she might have made her first actual friend when a familiar, icy voice cut through the air.\r\n\r\n\"Getting started early, hm? Typical. Horny cheating bastard.\"\r\n\r\nRuby and Jaune both froze, turning slowly to see Weiss Schnee standing there, arms crossed and one white eyebrow raised so high it was practically touching her hairline. Her lips were pursed in an expression of supreme disapproval. Ruby suddenly felt smaller than she already was.\r\n\r\nJaune's face went from normal to tomato-red in about half a second, \"I said nothing happened!\" he blurted out.\r\n\r\nRuby's brows furrowed. What did he mean by that? She glanced between them, completely lost, \"Uh, do you guys know each other or-\"\r\n\r\nBut neither of them was listening to her. Weiss's eyes had gone as wide as dinner plates, and so had Jaune's. They were just... staring at each other. Not saying a word. But it was like they were having this whole intense conversation with just their eyeballs. It was the weirdest thing Ruby had ever seen, and she'd once caught her dad trying to teach Zwei to play poker.\r\n\r\nThe worst part? Dad was losing three hands in.\r\n\r\nThe silence stretched on for what felt like forever. Weiss's mouth opened and closed like she wanted to say something but couldn't find the words. Jaune kept making these little aborted hand gestures like he was trying to communicate in some secret code. Ruby took a step back, hoping to slip away unnoticed. This was clearly some kind of... whatever this was... that she didn't want any part of.\r\n\r\nBut the second she moved, Weiss's hand shot out and grabbed her arm, \"No,\" Weiss said, her voice weirdly intense, \"Let's go together. To the auditorium. I insist.\" She was still staring at Jaune, not even looking at Ruby.\r\n\r\n\"Uh, do you two, like, know each other?\" Ruby asked, glancing between them.\r\n\r\n\"No,\" they said in perfect unison, still locked in their bizarre staring contest.\r\n\r\nWeiss finally tore her gaze away to look at Ruby, \"I simply have a very poor opinion of pathetic wannabe knights who think they're all that. I can see he's already imagining having fanclubs.\"\r\n\r\n\"And I think stubborn stuck-up rich girls suck,\" Jaune shot back, glaring at Weiss with an intensity that seemed way over-the-top for someone he supposedly didn't know, \"She obviously thinks she knows better than everyone else.\"\r\n\r\nWeiss's grip on Ruby's arm tightened, \"Well, we should get going. Come along, Ruby.\"\r\n\r\n\"But I was walking with-\"\r\n\r\n\"We're going to be late,\" Weiss insisted, already pulling Ruby away.\r\n\r\nRuby looked back at Jaune helplessly. He seemed torn between following them and running in the opposite direction, \"I guess I'll... see you at the auditorium?\" she said.\r\n\r\nJaune nodded, his face a complicated mix of emotions that Ruby couldn't even begin to decode, \"Yeah. See you there.\"\r\n\r\nAs Weiss dragged her away, Ruby couldn't help but feel like she'd just witnessed something super important but had absolutely no idea what it was. Like walking into the middle of a movie where everyone knew the plot except her, \"So, uh, that was awkward,\" Ruby ventured, trying to reclaim her arm from Weiss's death grip. It didn't work.\r\n\r\n\"He's an idiot,\" Weiss said, but there was something weird in her voice. Something that didn't sound like she was talking about a stranger.\r\n\r\n\"Okaaaay,\" Ruby said slowly, \"And you know this because...?\"\r\n\r\n\"I can tell,\" Weiss snapped, \"I have excellent judgment of character.\"\r\n\r\nRuby wasn't convinced, \"Then why did you call me a homewrecker earlier? I don't even know what that means! Well, I mean, I know what it means, but I've never wrecked anyone's home! I have, like, zero wrecking balls. No home destruction equipment at all.\"\r\n\r\nWeiss finally let go of Ruby's arm, giving her an appraising look, \"It was... pre-emptive.\"\r\n\r\n\"Pre-emptive home wrecking? Is that, like, a construction term? Are we demolishing buildings? Because that sounds fun, actually.\" What? She picked up a few things from Yang.\r\n\r\nFor a second, Ruby thought she saw the corner of Weiss's mouth twitch upward, but it was gone so fast she might have imagined it, \"You're exactly like I expected,\" Weiss muttered, more to herself than to her.\r\n\r\n\"Is that... good?\"\r\n\r\n\"It's predictable,\" Weiss said, which wasn't an answer at all.\r\n\r\nThey reached the entrance to the auditorium where students were already filing in. Weiss paused, looking back toward where they'd left Jaune. Her expression was impossible to read - part anger, part confusion, part something else entirely. Not the look you'd give someone you just met.\r\n\r\nRuby followed her gaze just in time to see Jaune approaching, his eyes locked on Weiss with the same weird intensity. It was like watching two cats about to either fight or... well, Ruby wasn't sure what the alternative was, but it was super uncomfortable to witness.\r\n\r\n\"Um, I'm gonna go find my sister,\" Ruby said, backing away from whatever tension-filled bubble Weiss and Jaune were creating, \"You two can... continue your not-knowing-each-other thing without me.\"\r\n\r\nNeither of them seemed to hear her. They were back to their silent staring communication, completely oblivious to Ruby or the crowd of students streaming around them. Ruby shook her head and slipped into the auditorium, taking her shot before Weiss grabbed her again. Whatever was going on between those two weirdos, she wanted no part of it. She'd had enough strange encounters for one day.\r\n\r\nWeiss watched as Ozpin finished his little speech about team assignments, her face a perfect mask of polite interest despite the whirlwind of thoughts ricocheting around her head, \"Ruby Rose, Jaune Arc, Weiss Schnee, and Pyrrha Nikos. The four of you retrieved the white rook pieces. From this day forward, you will work together as Team RJWP.\" Ozpin's eyes crinkled slightly, \"Pronounced 'Rejewel.' Led by... Ruby Rose.\"\r\n\r\nRuby gasped beside her, silver eyes widening to comical proportions. Pyrrha clapped politely, red ponytail swinging as she beamed at her new teammates. And Jaune - the infuriating, impossible, apparently-also-time-traveling Jaune - had the audacity to grin like he'd seen this coming. Of course he had. Because he apparently remembered everything just like she did.\r\n\r\nRejewel. How fitting for their second chance. Ozpin couldn't have known that, of course, but the man always was absurdly prescient in the most absurd things. Couldn't figure out Cinder was a spy, but did know where Qrow kept his secret stashes.\r\n\r\nTheir do-over. Their opportunity to fix the colossal mess that was the future they'd left behind.\r\n\r\nA future where they'd been unhappily married and then explosively divorced. Literally.\r\n\r\nWeiss forced herself to smile as Ruby did an excited little hop beside her. She'd miss being on a team with Blake and Yang, but this was actually more convenient. She could keep an eye on Ruby and Pyrrha (and Jaune) this way, and she could still befriend Yang and Blake. Besides, Blake and Yang had made out like bandits in the future (past? time travel semantics were giving her a headache). Their relationship had been the only solid one in their friend group, disgustingly happy even when the world was crumbling around them. They'd be fine.\r\n\r\n\"This is so cool!\" Ruby squealed, practically bouncing, \"We're going to be the best team ever!\"\r\n\r\n\"I look forward to working with all of you,\" Pyrrha said with that perfect, polite smile that Weiss now recognized as her public persona. The real Pyrrha - the one who would emerge with time and trust - was much more fun. And much more alive this time around, if Weiss had anything to say about it. She'd need to curb that sacrificial streak of hers.\r\n\r\n\"Yeah,\" Jaune chimed in, his eyes sliding to Weiss with a look that said far more than his bland statement, \"Looking forward to getting to know you all.\"\r\n\r\n\"Indeed,\" Weiss said crisply, already planning her next move. She needed to talk to Jaune alone. Immediately. As they were led to their dorm room - the same one Team RWBY had occupied in the original timeline, which was just weird - Weiss waited for Ruby and Pyrrha to start unpacking before making her move.\r\n\r\n\"I'm going to take a walk,\" she announced, striding toward the door without waiting for a response, \"I need some fresh air.\"\r\n\r\n\"Do you want company?\" Pyrrha offered, ever the thoughtful one. Gods, she missed her. She'd tear all of Ozpin's carefully laid plans apart if it meant saving her.\r\n\r\n\"No, thank you,\" Weiss replied, voice perfectly pleasant even as she shot Jaune a look that could have frozen lava, \"I prefer to be alone.\" She walked into the hallway, letting the door click shut behind her. Then she headed for the courtyard, her heels clicking an aggressive beat against the polished floors of Beacon.\r\n\r\nThe courtyard was mercifully empty this late in the evening. Weiss positioned herself by the fountain; the very one where she'd once screamed at Ruby about being a reckless child. But that was in another lifetime. One she had no intention of repeating.\r\n\r\nShe didn't have to wait long. Within minutes, she heard footsteps approaching. Deliberately heavy footsteps, like someone wanted her to know they were coming, \"Took you long enough,\" she said without turning around.\r\n\r\n\"Sorry, had to wait until Ruby was distracted by her weapon maintenance kit,\" Jaune replied, his voice no longer carrying that careful, hesitant tone he'd used around Ruby. This was confident Jaune. Adult Jaune. Huntsman Jaune.\r\n\r\nEx-husband Jaune.\r\n\r\nWeiss turned, crossing her arms as she took him in. He looked so young, just like she did. He was more muscular this time around, his body no longer the gangly mess of limbs of someone who expected skills to come to them. His face was more boyish than it had been in years without the stubble she suggested he grow out once they hit their twenties.\r\n\r\nBut his eyes... those revealed the truth. They were old eyes. Eyes that had seen war and death and heartbreak.\r\n\r\n\"You remember,\" she stated. Not a question.\r\n\r\nJaune didn't bother denying it, \"Yeah. Everything.\"\r\n\r\nA moment of charged silence passed between them, filled with fifteen years of history that hadn't happened yet and never would. Weiss was the first to break it, lips curling into a sneer, \"Let me guess. You used your fake transcripts again? Couldn't be bothered to actually earn your place this time either?\" She knew it was (likely) false, but she couldn't resist.\r\n\r\nJaune bristled instantly, stepping forward with a scowl that would have intimidated her if she hadn't seen him cry while watching soap operas, \"No, I didn't! I earned my place here, Ice Queen! Fair and square!\"\r\n\r\nWeiss's eye twitched at the nickname. He knew exactly how much she hated it, the insufferable ass, \"Oh really? So you spent the past three years training to pass the entrance exam?\"\r\n\r\n\"Yeah, actually, I did,\" Jaune shot back, crossing his arms to mirror her stance, \"Every single day, rain or shine. While you were probably having tea parties in your mansion.\"\r\n\r\nWeiss let out a bark of laughter, sharp and cutting, \"Tea parties? I've spent the past three years outmaneuvering my father and completely reversing his barbaric business practices while you were swinging a sword around in your backyard. I've created faunus employment initiatives, restructured the entire supply chain, and wrested control from Jacques with Winter's help.\" She lifted her chin, \"What exactly have you accomplished besides the bare minimum of what you should've done the first time around?\"\r\n\r\nJaune clicked his tongue, rolling his eyes, \"Oh, I don't know, just hunting down bandit groups across Anima. You know, real tangible stuff, not just boardroom politics. I've saved actual lives while you've been playing corporate chess.\"\r\n\r\n\"Playing chess?\" Weiss repeated, her voice rising dangerously, \"I've revolutionized faunus labor rights! I've cut off Jacques' access to the company finances and ensured he couldn't weasel his way out of jail! I've-\"\r\n\r\nShe caught herself, realizing they were both shouting now, their faces inches apart, so close that she could see the whites of his eyes surrounding those blue orbs. This was exactly how most of their fights had started during their marriage. The exact same pattern. And look how well that had turned out.\r\n\r\nWeiss took a deliberate step back, smoothing her combat skirt, \"This is counterproductive.\"\r\n\r\nJaune sighed, running a hand through his messy blond hair. A gesture so familiar it made something in Weiss's chest ache, \"Yeah, it is.\" He looked up at the shattered moon, \"I want to fix things. Avoid what happened the first time around.\"\r\n\r\n\"We can agree on that much, at least,\" Weiss said stiffly, \"Penny and Pyrrha need to survive. The Breach and the Fall of Beacon must be averted. Lionheart should be exposed as the traitor he is. And Atlas...\" Her voice hitched slightly, \"Atlas can't be destroyed.\"\r\n\r\nJaune nodded, his expression grim, \"I tried to find that Amber woman, the Fall Maiden that Cinder attacked. Thought maybe I could save her, change everything from the start. But I couldn't figure out where she was when she got attacked.\"\r\n\r\nWeiss paused, genuinely surprised by his initiative. She'd expected to have to drag him along with her plans, not to discover he'd been working toward the same goals all along, \"That was... not a terrible idea,\" she conceded reluctantly, \"But it's actually convenient that you couldn't find her. If Amber isn't at Beacon, Cinder wouldn't attend disguised as a Haven student next semester. We can save her from her coma when we deal with Cinder.\"\r\n\r\n\"So we're going to work together, then?\" Jaune said, not quite a question despite his tone.\r\n\r\n\"It would be foolish not to,\" Weiss replied, \"But don't make a mistake. I have absolutely no interest in getting back together with you. That ship has sailed, crashed, and sunk to the bottom of the ocean.\"\r\n\r\nJaune scowled, crossing his arms again, \"You took the words right out of my mouth, Princess. Our marriage was a disaster the first time around. I'm not eager for a repeat performance.\"\r\n\r\n\"Good,\" Weiss sniffed, \"I'm glad we're clear on that point.\"\r\n\r\n\"Crystal clear.\"\r\n\r\n\"Excellent.\"\r\n\r\n\"Fantastic.\"\r\n\r\nThey glared at each other, the tension between them thick enough to cut with Myrtenaster, \"You know,\" Weiss said suddenly, unable to help herself, \"I've been meaning to ask. Why did you try to shield me? At the courthouse, when the bombs went off. We had just signed divorce papers. We hated each other. And yet, your first instinct was to throw yourself over me.\"\r\n\r\nJaune looked caught off guard for the first time in their conversation, \"I- that was just- reflex. Huntsman training. See civilian, protect civilian.\"\r\n\r\n\"I was a Huntress too, you moron,\" Weiss pointed out, eyebrow raised.\r\n\r\n\"Well, maybe I just didn't want your death on my conscience,\" Jaune retorted, \"It would have been a real mood-killer at the after-divorce party I was planning.\"\r\n\r\n\"You were planning a party? Of coruse you were. Asshole.\"\r\n\r\n\"Of course not! It was a joke, Weiss. Something people with actual senses of humor make occasionally.\"\r\n\r\n\"I have a sense of humor!\"\r\n\r\n\"Name one joke you've told. Ever.\"\r\n\r\nWeiss opened her mouth, then closed it. Then opened it again, \"I don't have to prove anything to you.\"\r\n\r\n\"That's what I thought,\" Jaune said smugly.\r\n\r\n\"Oh, shut up. We need to make a plan for stopping Cinder.\"\r\n\r\n\"Always changing the subject when you're losing an argument,\" Jaune muttered, \"Some things never change.\"\r\n\r\n\"I wasn't losing! And don't act like you know me, Arc.\"\r\n\r\n\"We were married for five years, Schnee. I think I know you better than I'd like to.\"\r\n\r\nWeiss glared at him, \"Clearly not well enough, since you thought it was appropriate to let Ruby Rose prance around in our bedroom wearing your hoodie.\"\r\n\r\n\"For the last time, nothing happened with Ruby!\" Jaune exclaimed, throwing his hands up, \"She was returning it after a mission! Her cloak got torn fighting an Ursa and she got cold and- you know what? I'm not having this argument again. You'd think trying to save your life would get a guy some leeway, but apparently not.\"\r\n\r\n\"Typical. Play the sacrifice card so I feel like a jerk for ever questioning. Classic.\"\r\n\r\n\"Oh, I'm sorry for trying to save your life!\"\r\n\r\n\"I didn't ask you to!\"\r\n\r\nThey were nose to nose again, breathing hard, eyes locked in mutual fury. This, Weiss thought distantly, was why their marriage had fallen apart. This exact pattern of escalation, of pushing each other's buttons with surgical precision.\r\n\r\nJaune seemed to realize it at the same moment she did. He took a deliberate step back, pinching the bridge of his nose, \"We need to work together,\" he said, voice carefully measured, \"For the sake of everyone else. For Pyrrha and Penny and all the people who died last time.\"\r\n\r\nWeiss nodded stiffly, \"Agreed. Truce?\"\r\n\r\n\"Truce,\" Jaune echoed, \"But you need to stop being such a princess in the bathroom. You always use all the hot water.\"\r\n\r\n\"I do not!\"\r\n\r\n\"I still remember your hour long showers.\"\r\n\r\n\"A proper skincare routine is not negotiable, Arc!\"\r\n\r\n\"Neither is hypothermia from ice-cold showers, Schnee!\"\r\n\r\nAnd just like that, they were arguing again. Some things, it seemed, were constants across all timelines. They were doomed, Weiss thought, even as she continued to bicker with her ex-husband about bathroom etiquette that wouldn't be relevant for another thirteen years.\r\n\r\nWeiss keeps an eye on Ruby. Will likely drag Ruby into a throuple when she gets older, all while convincing herself this was Ruby's plan all along. Poor Cinder gets her plans ruined by bickering exes.\r\n\r\nWanna help support me (and gain access to chapters a week or two early)? Then check out the link below:\r\n\r\nP a treon . com (slash) Vendetta543"
    },
    {
      "title": "Chapter 2",
      "text": "Chapter 2. Commissioner confirmed this'll go on for about 4 chapters.\r\n\r\nFor anyone interested in making a commission, email me at: storylover543@gmail.com\r\n\r\n[line break]\r\n\r\nRuby had been super excited for Combat Class. Like, jumping-on-her-bed-until-Weiss-threatened-to-freeze-her-feet-to-the-floor excited. This was what being at Beacon was all about! Learning to fight better! Showing off Crescent Rose! Getting tips from actual pro Huntsmen!\r\n\r\nWhat she hadn't expected was to witness what could only be described as the most uncomfortable public meltdown in Beacon history.\r\n\r\nIt started innocently enough. Professor Goodwitch stood in the center of the combat arena, riding crop in hand, looking like she'd personally fight anyone who disrupted her class, \"Today we will assess your combat abilities,\" she said, adjusting her glasses with one finger, \"I need volunteers for our first match.\"\r\n\r\nWeiss' hand shot up so fast it nearly broke the sound barrier, \"Professor, Jaune and I will fight.\"\r\n\r\nRuby glanced at her partner in surprise. Weiss had barely spoken two words to Jaune all morning, and those words had been \"move\" and \"idiot\" when he'd accidentally stepped on her shoe. Professor Goodwitch raised an eyebrow, \"It's unusual for teammates to spar against each other on the first day, Miss Schnee.\"\r\n\r\n\"I want to go,\" Jaune said, already standing up. He had a weird look on his face - kind of determined, kind of angry, and kind of something else Ruby couldn't identify.\r\n\r\nProfessor Goodwitch looked between them for a moment before nodding, \"Very well. Please change into your combat outfits then come to the arena.\"\r\n\r\n\"Huh, one day and your teammates are already fighting,\" Yang said from the row behind Ruby, leaning forward, \"My lien's on Weiss.\"\r\n\r\n\"Jaune is rather skilled,\" Pyrrha said, watching as he took his position across from Weiss, \"I wouldn't count him out.\" Ruby wasn't sure what to expect. She'd only seen Jaune fight briefly during initiation, and while he'd been decent, he hadn't seemed like anything special. Weiss, on the other hand, had those cool glyphs and perfect swings.\r\n\r\nThe match began, and Ruby's jaw nearly hit the floor.\r\n\r\nThey were good. Like, really good. Weirdly good for first-year students.\r\n\r\nWeiss moved like water, her rapier a blur of silver as she created glyph after glyph, launching herself around the arena with incredible speed. And were those... summons? Tiny glowing white Beowolves that charged at Jaune like angry puppies?\r\n\r\nBut Jaune was holding his own. His shield blocked everything Weiss threw at him, and he countered with sword strikes that showed years of training. His footwork was perfect, pivoting and sidestepping like he could predict Weiss' moves before she made them. He cut through the summons like they were made of paper and ignored one that slipped past and bit his ankle.\r\n\r\nRuby's eyes flicked between the fight and the Aura displays on the massive screen overhead. Professor Goodwitch had said the match would end when either contestant's Aura dropped to 70 percent. But the numbers were barely moving. Weiss was at 95%, Jaune at 97%.\r\n\r\n\"How much Aura do they have?\" Ruby whispered, more to herself than anyone else. The fight was mesmerizing. They moved like they'd practiced fighting each other for years, anticipating feints, countering strategies, adjusting in real-time. It was less like a spar and more like a deadly dance between two experts. Every move perfectly executed then countered, like they knew exactly what the other one was gonna do before they did it.\r\n\r\nAnd then something changed.\r\n\r\nJaune blocked a particularly aggressive thrust from Weiss, their faces inches apart over their locked weapons. He said something that Ruby couldn't hear from the stands, but his grin was all teeth and he looked almost manic.\r\n\r\nWhatever he said, it made Weiss' face go fire dust red.\r\n\r\n\"What did you just say to me?!\" she shrieked, loud enough for the entire arena to hear.\r\n\r\nAnd just like that, all technique went out the window.\r\n\r\nWeiss abandoned her rapier completely and tackled Jaune to the ground. Actually tackled him. Proper football-style, full-body launch. The co-CEO of the Schnee Dust Company was wrestling on the floor like a tavern brawler, \"Holy shit!\" Yang said, eyes wide and laughing, \"This is awesome!\"\r\n\r\nAwesome was one word for it. Horrifying was another. Cataclysmic might have been the most accurate.\r\n\r\nJaune and Weiss rolled across the arena floor, a tangle of limbs and fury and- oh Brothers, was Weiss trying to gouge his eyes out?!\r\n\r\n\"I think we should stop them,\" Pyrrha murmured, \"This doesn't seem like typical sparring behavior.\"\r\n\r\nBefore anyone could respond, Weiss delivered a devastating kick directly to Jaune's groin. Like, heel first. Every male student in the audience winced collectively. Several crossed their legs protectively. Even Professor Goodwitch looked horrified, \"That's for missing our anniversary, you lying sack of-\" Weiss' next words were cut off as Jaune, despite what must have been excruciating pain, grabbed a fistful of her pristine white ponytail and yanked. Hard.\r\n\r\nYang actually hissed, \"Not the hair. Never the hair.\"\r\n\r\n\"Whitley was right about you!\" Jaune bellowed as Weiss shrieked and clawed at his face.\r\n\r\nProfessor Goodwitch stepped forward, looking alarmed, \"That's enough! The match is-\"\r\n\r\nNeither of them were listening. They were too busy trying to murder each other with their bare hands, their weapons completely abandoned on the arena floor, \"You have a tiny dick!\" Weiss screamed, loud enough that Ruby was pretty sure people all the way down in Vale could hear it. Ruby's face went as red as her cloak. Oh no. Oh no no no. This was not happening. This was not the kind of combat training she'd signed up for!\r\n\r\n\"You cum the second I go inside you!\" Jaune roared back, somehow even louder, \"One thrust and it's like a waterfall! And you screech like a banshee!\" The entire class went dead silent for a split second before erupting into scandalized gasps and nervous laughter. Ruby wanted to sink through the floor and possibly all the way to the center of Remnant.\r\n\r\nWeiss, apparently unaware or uncaring that they had an audience of shell-shocked classmates, wasn't done, \"I faked every single orgasm! Every. Single. One!\"\r\n\r\n\"By the Brothers,\" Blake whispered from somewhere behind Ruby, \"Is this actually happening?\"\r\n\r\nIt was. It absolutely was. And it was somehow getting worse by the second.\r\n\r\nProfessor Goodwitch was shouting for them to stop, her voice sharp with authority, but Jaune and Weiss were beyond hearing. They were in some kind of rage-fueled alternate dimension where only they existed, rolling around on the floor of the combat arena, screaming deeply personal sexual information at each other.\r\n\r\n\"You broke my grandpa's coffee table with your bony ass!\" Jaune yelled.\r\n\r\n\"You cried after sex on our honeymoon! I still remember, Arc!\" Weiss shrieked.\r\n\r\nRuby couldn't look away. It was like watching a Nevermore crash into a Dust refinery - horrific, but impossible to ignore. And apparently, she wasn't the only one. The entire class was quiet, watching with a mixture of horror and fascination, \"Did... Did she say honeymoon?\" Pyrrha asked quietly. Ruby had no answer. Her brain had short-circuited around the time Weiss had started discussing Jaune's d-dick.\r\n\r\nThe fight had devolved into something primal. Weiss had managed to flip Jaune onto his back and was sitting on his chest, slapping at his face while he pulled at her combat skirt. Their Aura meters were still barely below 90%, which was impressive considering how hard they were going at it..\r\n\r\nAnd then Weiss straight-up bit Jaune on the cheek. Not a playful nip. A full-on, jaw-clenched, leaving-teeth-marks BITE. Ruby saw Jaune's Aura go down by two percent.\r\n\r\nJaune howled, \"You bit me! Again! You crazy ice bitch!\" Again?! What did he mean again?!\r\n\r\n\"Enough!\" Professor Goodwitch shouted, and suddenly both Jaune and Weiss were floating six feet off the ground, suspended in a purple glow of the professor's telekinetic Semblance. They dangled there, still trying to claw at each other despite being held several feet apart.\r\n\r\n\"Miss Schnee! Mr. Arc!\" Professor Goodwitch's voice could have frozen fire, \"This behavior is absolutely unacceptable! You will both report to the headmaster's office immediately!\" Neither of them seemed to hear her. They were still glaring at each other with enough intensity that Ruby half expected laser beams to shoot from their eyes.\r\n\r\n\"I hate your stupid face!\" Weiss screamed.\r\n\r\n\"I hate your entire existence!\" Jaune bellowed back.\r\n\r\nProfessor Goodwitch, apparently deciding that further conversation was pointless, simply floated them both out of the arena, their bodies still suspended in her telekinetic grip. They continued hurling insults at each other as they disappeared through the doors, their voices echoing down the hallway.\r\n\r\nThe class sat in stunned silence after they were gone, \"Well,\" Professor Goodwitch said, smoothing her skirt and adjusting her glasses with impressive composure, \"That was... irregular. Let's continue with the next match, shall we?\"\r\n\r\nRuby couldn't move. She couldn't think. She just sat there, trying to process what she'd just witnessed, \"So,\" Yang said, breaking the silence as she leaned forward to rest her chin on Ruby's shoulder, \"Your partner and your teammate are either trying to kill each other or have some really intense history. Possibly both.\"\r\n\r\n\"They said they didn't know each other,\" Ruby whispered, still shell-shocked.\r\n\r\n\"Yeah, about that,\" Yang said, patting her shoulder consolingly, \"I'm pretty sure they lied.\"\r\n\r\nRuby nodded weakly. The evidence suggested that not only did Weiss and Jaune know each other, but they knew each other in ways Ruby really, really wished she could un-hear, \"Do you think they'll be kicked out of Beacon?\" Pyrrha asked, looking genuinely worried.\r\n\r\nShe honestly had no idea. All she knew was that their team - Team RJWP, less than 24 hours old - was already the most dysfunctional group in the history of Huntsman academies.\r\n\r\n\"They better not get kicked out,\" she said finally, \"Because if they do, I'm going to kill them both myself. With Crescent Rose. Slowly.\"\r\n\r\nThe scary part was she kind of meant it.\r\n\r\n[line break]\r\n\r\nJaune rubbed his sore cheek as he and Weiss trudged back to their dorm room, the bite mark still throbbing despite his Aura's attempts to heal it. Ozpin's office had been... uncomfortable, to say the least. The headmaster had watched them with those unnerving eyes, fingers steepled beneath his chin, as they'd fumbled through explanations of \"pre-existing tensions\" and \"combat high.\"\r\n\r\nThey'd carefully avoided mentioning anything about time travel, Salem, or their shared past-future-whatever. Not yet. Not while they were still figuring out their next moves. Better that he didn't risk dying and Oscar remain a farm boy in Anima, his brain uneaten by an ancient wizard with questionable judgment.\r\n\r\nFor his part, Ozpin hadn't seemed entirely convinced by their excuses, but he'd let them off with a warning and a week of detention scrubbing the dining hall after hours. A light punishment, all things considered. Jaune suspected the headmaster was more curious than angry, which was both good and bad. An intrigued Ozpin was a meddling Ozpin. As much as he kept the world safe until now, they didn't need someone hovering over their shoulder.\r\n\r\nWeiss threw open the door to their dorm room, shoulders stiff with lingering rage. Ruby and Pyrrha were still in class, leaving them alone to stew in the aftermath of their very public meltdown, \"I cannot believe,\" Weiss hissed as she slammed the door behind them, \"That you thought it was appropriate to announce my sexual responses to an entire classroom of teenagers.\"\r\n\r\nJaune snorted, dropping onto the windowsill with his arms crossed, \"Says the woman who informed all of Beacon that I have a 'tiny dick.' Which, by the way, is a blatant lie and you know it!\" He tried not to think about how much she praised said part of his anatomy back in their old life.\r\n\r\n\"Oh, I'm sorry,\" Weiss said, voice dripping with sarcasm as she perched on the edge of her bed, \"Should I have been more specific about the disappointing aspects of your anatomy?\"Jaune tried not to notice the way her combat skirt rode up when she crossed her legs, exposing a few more inches of smooth, pale thighs. Nope. Not looking. That way lay madness and death. Probably his death, specifically, courtesy of Myrtenaster through his eye socket.\r\n\r\nThey sat in smoldering silence for several minutes, the tension so thick Jaune could have cut it with Crocea Mors.\r\n\r\nFinally, Weiss spoke, \"You're an asshole.\"\r\n\r\n\"And you're a bitch,\" Jaune shot back without hesitation.\r\n\r\nWeiss' lips curled into a sneer, \"Do you actually have a plan to stop the Fall, or are you just going to coast along and let me do all the strategic thinking as usual?\"\r\n\r\nJaune shrugged, feigning nonchalance, \"I was thinking I'd cut Cinder's throat and go from there. Simple, effective, minimal room for error.\"\r\n\r\n\"Short-sighted, as always,\" Weiss said, shaking her head, \"We need a guarantee that her Maiden powers won't transfer to Emerald. Have you even considered that?\" Jaune frowned at the name. Emerald. She'd ditched them shortly after they arrived in Vacuo and they never found her again. So much for her supposed redemption arc.\r\n\r\n\"Fine,\" he said, pinching the bridge of his nose, \"What's your brilliant plan, then? Since you're obviously the strategic mastermind here.\"\r\n\r\nWeiss straightened, a smug little smile playing at her lips, \"It's actually quite simple. Cinder has no idea that we're anything besides regular first-year students. It shouldn't be too difficult to poison their drinks.\"\r\n\r\nJaune blinked, \"I'm sorry, what?\"\r\n\r\n\"Poison,\" Weiss repeated slowly, as if talking to a particularly dim child, \"I can get my hands on some high-grade paralytics. There are a few formulations that work even against active Aura. Expensive, but money isn't an issue for me. They'll last long enough for us to deal with all three of them.\"\r\n\r\n\"Right,\" Jaune gave her a flat look, \"You don't sound completely insane or anything. 'Hello, transfer students! Would you like some refreshing beverages laced with deadly neurotoxins'?\"\r\n\r\nWeiss rolled her eyes, \"Don't be dramatic. We'd be subtle about it.\"\r\n\r\n\"Because subtle is definitely what we were today in combat class.\"\r\n\r\n\"That was different,\" Weiss said, having the grace to look slightly abashed, \"You provoked me.\"\r\n\r\n\"I made one comment about how you used to like my sword technique!\"\r\n\r\n\"It was clearly innuendo!\"\r\n\r\nJaune threw up his hands, \"Everything is innuendo to you! I can't even ask you to pass the salt without you thinking I'm making some kind of dirty joke!\"\r\n\r\n\"Because you usually are!\"\r\n\r\nThey were shouting again. Jaune took a deep breath, forcing himself to lower his voice. They couldn't afford another big fight, \"Look,\" he said, trying for a reasonable tone, \"I remember there's an Aura transfer machine in the vault beneath the school. We could use that to safely transfer the Maiden powers if we manage to capture Cinder. We can save that Amber woman.\"\r\n\r\nWeiss looked surprised, like she hadn't expected him to come up with something actually useful. It was irritating how low her expectations of him still were, \"That's... not a terrible idea,\" she admitted, \"But we'd need to tell Ozpin. We can't exactly sneak into the vault.\"\r\n\r\n\"Yeah,\" Jaune agreed, \"We'll have to loop him in at some point. Probably sooner rather than later.\"\r\n\r\n\"But Cinder isn't the only problem we need to address,\" Weiss said, ticking points off on her perfectly manicured fingers, \"There's the White Fang operation in Mountain Glenn, Roman Torchwick and his psychotic little sidekick, Adam Taurus, and of course, Salem herself.\"\r\n\r\n\"One thing at a time,\" Jaune said, wondering how they were possibly going to handle all this without getting their friends killed. Again, \"Cinder's the immediate threat. She's the lynchpin of the attack on Beacon. We take her out, everything else changes.\"\r\n\r\nWeiss nodded, then added, \"Taking down Raven Branwen would be advantageous as well. She's the Spring Maiden, and even if she's not aligned with Salem, she's using her powers to kill and enslave her way across Anima. It's frankly insulting that Ozpin's group hasn't dealt with her before now.\"\r\n\r\n\"Yeah,\" Jaune agreed, surprising himself. It was probably the first thing they'd agreed on all day, \"Raven's a problem. And she has the Relic, or will have it eventually. I dunno. Yang was pretty vague on the details.\" They lapsed into silence again, but it was different now. Less hostile, more contemplative. They were on the same side, even if they couldn't stand each other. The fate of the world depended on them putting aside their personal issues, at least long enough to prevent the apocalypse.\r\n\r\n\"We should write this down,\" Weiss said suddenly, \"Make a proper plan, with contingencies.\"\r\n\r\n\"You and your lists,\" Jaune said, but there was almost a fondness in his voice. Almost.\r\n\r\n\"My lists saved your ass more times than I can count,\" Weiss retorted. It was weird hearing her curse again. She looked almost innocent now that they were teenagers again. Not like the hardened, cold executive who had perpetual bags under her eyes even Aura couldn't fix.\r\n\r\n\"Your lists nearly got us killed in Vacuo.\"\r\n\r\n\"That wasn't the list's fault! That was your inability to follow simple instructions!\"\r\n\r\nAnd just like that, they were back to bickering. Some things never changed, no matter how much time travel was involved.\r\n\r\nJaune sighed, looking out the window at Beacon's pristine grounds. It was strange seeing the school whole again, untouched by the destruction that had marked the beginning of the end. They had a chance to preserve this, to save all the lives that had been lost the first time around. To turn their bittersweet ending into a happy one.\r\n\r\nIf they could just stop fighting long enough to actually do it.\r\n\r\n\"Truce?\" he offered, not looking at Weiss, \"For real this time. At least until we've dealt with Cinder and saved Pyrrha. We can hate each other as much as we want after.\"\r\n\r\nThere was a long pause.\r\n\r\n\"Fine,\" Weiss said finally, \"Truce. But if you say one more thing about my 'explosive' temper, I will cut off your-\"\r\n\r\nThe door burst open, revealing Ruby and Pyrrha, both looking apprehensive. They froze in the doorway, clearly expecting to walk in on the second Great War, \"Oh!\" Ruby said, silver eyes darting nervously between Jaune and Weiss, \"You guys are... not killing each other?\"\r\n\r\n\"We've reached an understanding,\" Weiss said primly, as if she hadn't been threatening Jaune Junior just seconds earlier.\r\n\r\n\"For now,\" Jaune added.\r\n\r\nPyrrha stepped into the room cautiously, \"Professor Goodwitch explained that... tensions sometimes run high between partners during combat practice.\" She didn't sound convinced by the explanation but she was too nice to argue. Classic Pyrrha. He found himself smiling before he remembered that day, \"But perhaps it would be beneficial if we discussed proper team communication strategies?\"\r\n\r\nRuby nodded quickly, \"Yeah! And maybe you guys could explain, you know, why you were talking about honeymoons and stuff? Because that was super weird and everyone's talking about it and Yang won't stop making jokes and-\"\r\n\r\n\"No,\" Weiss and Jaune said in perfect unison.\r\n\r\nRuby's shoulders slumped, \"But we're supposed to be a team! And teams don't keep secrets! Especially not... whatever that was in the arena.\"\r\n\r\nJaune and Weiss exchanged a look. For the second time today, they were in complete agreement: there was no way in hell they were explaining time travel, future marriage, and apocalyptic warfare to their teenage teammates. Some truths were better left unsaid.\r\n\r\n\"Would you believe we were both possessed by the ghosts of a dysfunctional married couple?\" Jaune asked.\r\n\r\nRuby's flat stare was answer enough.\r\n\r\n\"We have... issues to work through,\" Weiss said diplomatically, \"But we've agreed to be civil for the sake of the team.\"\r\n\r\n\"Civil,\" Pyrrha repeated, raising an eyebrow, \"Is that what you call what happened today?\"\r\n\r\n\"That was an anomaly,\" Weiss said.\r\n\r\n\"A one-time thing,\" Jaune nodded.\r\n\r\n\"It will not happen again,\" Weiss said, with the conviction of someone who absolutely knew it would happen again, probably within 24 hours.\r\n\r\nRuby didn't look convinced, but she seemed willing to let it go for now, \"Well... okay. But if you guys start trying to kill each other again, I'm getting Professor Goodwitch, and she's waaaaay scarier than Professor Ozpin.\" She had no idea how true that was, Jaune thought. In the original timeline, Glynda Goodwitch had survived everything Salem had thrown at them, emerging from the final battle with barely a scratch while looking mildly annoyed at the inconvenience.\r\n\r\n\"Understood,\" Weiss said crisply.\r\n\r\nAs Ruby and Pyrrha began unpacking their books, chattering about the rest of their classes, Jaune caught Weiss' eye. She gave him a small, almost imperceptible nod. A silent agreement to continue their planning later, away from curious teammates.\r\n\r\nMaybe they could pull this off after all. Assuming they didn't kill each other first.\r\n\r\n[line break]\r\n\r\nRuby went through some hard stuff in her fifteen years of life. She'd fought Grimm, gotten into Beacon two years early, and convinced Dad to let her have cookies for dinner that one time when she was nine. But nothing - absolutely nothing - had prepared her for the complete and total weirdness that was having Weiss Schnee as a partner.\r\n\r\nIt had been two weeks since The Incident (which was what everyone called the combat class meltdown now, always with capital letters and hushed voices). Jaune and Weiss were serving their detention every night, scrubbing pots in the cafeteria and apparently managing not to murder each other, which Ruby counted as a win. She'd even caught them having what looked like an actual civil conversation yesterday, their heads bent together over some papers that they'd quickly hidden when she approached.\r\n\r\nProgress! Maybe. Possibly. ...She wasn't holding her breath.\r\n\r\nBut while the Jaune-Weiss situation had stabilized from \"active volcano\" to \"dormant volcano that might explode again at any moment,\" Ruby was still trying to figure out what the heck was going on with her partner.\r\n\r\nBecause Weiss Schnee was the most confusing person Ruby had ever met.\r\n\r\nOn the one hand, Weiss was super supportive. Like, aggressively supportive, \"If you need anything at all, just ask me, Ruby. We're partners, after all,\" she'd say, at least twice a day, in this weirdly intense voice that made it sound like she was reminding herself as much as Ruby. She tutored Ruby in Dust studies without a single condescending comment. She made sure Ruby was eating properly. She even woke up early to train with Ruby before classes, offering genuinely helpful combat advice without any of the snark Ruby would have expected from someone who radiated \"better than you\" energy like it was her Semblance.\r\n\r\nBut then there were the other moments. The ones that made Ruby feel like she was missing some huge, obvious thing that everyone else understood. Like how Weiss would sometimes glare at her when she thought Ruby wasn't looking. Not an angry glare exactly, but suspicious, like she expected Ruby to suddenly rip off a mask and reveal herself as a Beowolf in disguise. Or the way she'd mutter under her breath sometimes when Ruby was talking to Jaune.\r\n\r\n\"Homewrecker,\" she'd hiss, barely audible.\r\n\r\n\"Skank,\" she'd murmur, while aggressively stabbing her salad at lunch.\r\n\r\nThat was the pattern. Weiss would be super supportive one moment, then mutter things like \"homewrecker\" and \"just like her mother\" the next. It was giving Ruby emotional whiplash. And then, just when Ruby was ready to confront her about it, Weiss would do something completely disarming.\r\n\r\nLike yesterday, when she'd presented Ruby with a box of chocolate-covered strawberries, the super fancy kind from that expensive bakery in Vale.\r\n\r\n\"These are for you,\" Weiss had said, thrusting the box at Ruby with a smile that was almost warm, \"To keep you from getting wandering eyes.\"\r\n\r\n\"Wandering... eyes?\" Ruby had repeated, completely lost but already drooling at the sight of the strawberries, \"Like, so I don't need glasses?\"\r\n\r\nWeiss had just patted her on the shoulder with a weird little laugh, \"You're so funny, Ruby. Enjoy the strawberries. They're your favorite, right?\"\r\n\r\nAnd they were. Which was another weird thing. Weiss seemed to know all of Ruby's favorite things without being told. She'd given Ruby a red and black scarf last week, claiming it would \"complement her combat outfit,\" but it was exactly the kind of scarf Ruby had been eyeing in a shop window the previous weekend. A shop they hadn't visited together and she never even went inside of because the thing had two too many zeroes for her liking.\r\n\r\nThen there was the premium Dust. Ruby had been saving up for weeks to buy some for Crescent Rose's upgrades, and then Weiss had just... handed her a case of it. Top quality, perfectly suited for Ruby's specific weapon needs, \"SDC's finest,\" Weiss had said with a dismissive wave when Ruby tried to thank her, \"I have warehouses full of the stuff. It's nothing.\"\r\n\r\nMaybe it was nothing to Weiss, but to Ruby, it was bizarre. Were all rich people this randomly generous? Was it a Schnee thing? A partner thing? A cover-up-for-whatever-weird-history-she-had-with-Jaune thing?\r\n\r\n\"I think you're her sugar baby,\" Yang had said that morning when she visited their dorm room, watching as Ruby unwrapped yet another gift. This time it was a special weapon-cleaning oil that smelled like roses. Actual roses.\r\n\r\n\"I'm her what?\" Ruby had asked, completely baffled.\r\n\r\nYang had laughed so hard she'd fallen off her bed, \"Never mind, sis. Just enjoy your rose-scented gun lube.\"\r\n\r\nRuby still had no idea what Yang meant, but she'd decided it was probably another one of those jokes that she'd understand when she was older. Or, given her current trajectory, one of those jokes she'd never understand, because her entire Beacon education was turning into a bizarre social experiment rather than actual Huntress training.\r\n\r\nThe most confusing part was that Weiss seemed to genuinely care about her well-being while simultaneously acting like she was some kind of threat. Which made absolutely no sense! Ruby couldn't intimidate Zwei, let alone the heiress to the largest Dust company on Remnant.\r\n\r\n\"Whatcha thinking about?\" Yang asked, dropping down next to Ruby on the library bench a day later.\r\n\r\nRuby jumped, nearly dropping her comic book- uh, very serious study material! \"Gah! Don't sneak up on me like that!\"\r\n\r\n\"I called your name three times,\" Yang said, raising an eyebrow, \"You were in the zone.\"\r\n\r\n\"I was thinking about Weiss,\" Ruby admitted, closing her comic, \"She's so weird.\"\r\n\r\n\"Yeah, that's an understatement,\" Yang said, leaning back, \"She give you any new gifts?\"\r\n\r\nRuby nodded glumly, \"This morning she gave me these.\" She scooted back slightly and raised her feet to show Yang a pair of combat boots that were exact replicas of her current ones, except they were lined with some kind of super-light material that made them feel like walking on clouds, \"Then she said, and I quote, 'So you can run faster away from me when your Rose instincts kick in'.\" She said the name 'Rose' like a curse. Ruby didn't know whether to be offended or confused.\r\n\r\n\"Rose instincts? The hell does that mean?\"\r\n\r\n\"I have no idea!\" Ruby shook her head. But man, these boots felt awesome...\r\n\r\n\"You know, the whole Weiss-Jaune situation is like a soap opera. My team has a betting pool going on what they're actually fighting about.\"\r\n\r\n\"You do?\" Ruby perked up, \"What's your theory?\"\r\n\r\nYang lowered her voice conspiratorially, \"Well, Blake thinks they're ex-Huntsmen partners who had a falling out over a mission gone wrong. Ren thinks they're reincarnations of an old married couple. Nora thinks they're childhood friends who played house way too hard. But my money's on secret lovers from rival families, like a whole Montague-Capulet situation.\" Ruby almost laughed at the casual reference. Yang was a sucker for tragic romances no matter how old.\r\n\r\n\"Secret... lovers?\" Ruby whispered, eyes wide, \"But they hate each other!\"\r\n\r\n\"Thin line between love and hate, Rubes,\" Yang said with a wink, \"And nobody fights that dirty unless they've seen each other naked.\"\r\n\r\nRuby's face burned at the memory of the combat class. The things they'd shouted at each other.., \"But they're our age! When would they have had time to... you know...\" She waved a hand nervously. Sex was weird. Everyone her year back at Signal was running around all hormonal like while she was still focused on weapons and, you know, being a Huntress. Who ahd time for all that junk about prom and dating and whatever?\r\n\r\n\"Secret summer romance?\" Yang suggested, \"Forbidden tryst at a Dust conference? Weekend in Vacuo that got out of hand? The possibilities are endless.\"\r\n\r\nRuby frowned and thought about it. It didn't seem right. The way Weiss and Jaune fought was too... personal. Too specific. And there was the whole \"honeymoon\" thing they'd shouted about,\"Yang,\" she said slowly, \"Do you think it's possible they're, like... married?\"\r\n\r\nYang snorted, \"At seventeen? Not likely. Besides, who would officiate a wedding for minors? I can't even get a drink down in Vale and I'm training to fight Grimm, \"\r\n\r\n\"Yeah, you're right,\" Ruby said, but something still nagged at her. The way Weiss and Jaune seemed to know things - about each other, about the school, about their classmates - that they shouldn't know. The way they'd sometimes slip and reference events that hadn't happened.\r\n\r\nLike last week, when Pyrrha had been practicing her Semblance and Jaune had casually mentioned something about \"the food fight,\" only to freeze and hastily change the subject when she asked what he meant. Or how Weiss somehow knew that Professor Port's first name was Peter, even though he'd never introduced himself as anything but \"Professor Port\" in class. She brushed it off by saying that she looked him up on the school site, but his picture there said. 'P. Port.'\r\n\r\nLittle things. Weird things. Things that didn't add up.\r\n\r\n\"Maybe they're time travelers,\" Ruby joked weakly.\r\n\r\nYang burst out laughing, \"Yeah, right! And I've with magical powers.\"\r\n\r\nRuby laughed too, but the idea stuck with her. Not seriously, of course - time travel was impossible, even in a world with Semblances and Dust and Grimm. But it would explain a lot. Like why Weiss kept giving her those suspicious little glares, then showering her with gifts. Or why Jaune sometimes looked at Pyrrha with this heartbreaking sadness, like he was seeing a ghost. Or why both of them seemed to know exactly when Professor Goodwitch would call on students in class.\r\n\r\nRuby was still pondering this when a shadow fell over her. She looked up to find Weiss standing there, holding yet another wrapped package.\r\n\r\n\"Ruby,\" Weiss said, her smile just a little too bright, \"I got you something.\"\r\n\r\n\"Another present?\" Ruby asked, barely hiding her exasperation, \"Weiss, you don't have to keep buying me stuff.\"\r\n\r\n\"Nonsense,\" Weiss said, thrusting the package at her, \"That's what partners do. Support each other. With gifts. And not stealing each other's significant others.\" The last part was muttered so quietly that Ruby almost missed it.\r\n\r\n\"What was that last part?\"\r\n\r\n\"Nothing!\" Weiss said brightly, \"Just open it.\"\r\n\r\nRuby unwrapped the package to find a beautiful red leather journal with her emblem embossed on the cover.\r\n\r\n\"I noticed you like to sketch weapon designs,\" Weiss said, looking pleased with herself, \"I thought you might like something special to draw in.\"\r\n\r\nIt was actually a really thoughtful gift. Ruby ran her fingers over the embossed rose symbol, genuinely touched, \"This is really nice, Weiss. Thank you.\"\r\n\r\nWeiss beamed, then her expression suddenly darkened as she looked past Ruby. Ruby turned to see Jaune entering the library, accompanied by Pyrrha.\r\n\r\n\"I have to go,\" Weiss said abruptly, \"Study... things. Enjoy your journal! Remember, partnerships are sacred and should never be betrayed!\" And with that, she stalked off toward Jaune and Pyrrha, interrupting whatever conversation they were having with a vehemence that suggested it was a matter of life and death.\r\n\r\nYang watched her go, then turned back to Ruby with raised eyebrows, \"Still think she's a time traveler and not just crushing on you super hard?\"\r\n\r\n\"Crushing on me?\" Ruby spluttered, \"That's ridiculous! She's just being a good partner!\"\r\n\r\n\"Uh-huh,\" Yang said skeptically, \"A good partner who glares at Jaune every time he talks to you and buys you fancy gifts with little roses on them. Shit, I wish Blake was that good with me.\"\r\n\r\n\"It's not like that!\" Ruby huffed, though a small, confused part of her wondered if maybe, possibly, Yang might be onto something. And if Ruby was against the idea or not, \"She's just... Weiss. Being Weiss-y.\"\r\n\r\n\"If you say so,\" Yang said, clearly unconvinced, \"But if she starts writing you poetry or trying to take you to fancy restaurants, don't say I didn't warn you.\"\r\n\r\nRuby clutched her new journal to her chest, watching as Weiss cornered Jaune by the history section, jabbing a finger at his chest while Pyrrha looked on in bewilderment. Whatever was going on with her partner, Ruby was determined to figure it out. If Weiss was hiding something - whether it was a crush, a secret past with Jaune, or some arranged marriage divorce - Ruby would get to the bottom of it. After all, that's what partners did. Support each other, figure out each other's weird behavior, and accept way too many expensive gifts without asking too many questions.\r\n\r\nAlso, kill Grimm. But that part actually seemed easier than understanding Weiss Schnee.\r\n\r\n[line break]\r\n\r\nJaune had learned to recognize the signs of Weiss Schnee plotting something. The slightly narrowed eyes. The too-casual posture. The way she'd tap her index finger against her thumb when she thought no one was looking. After five years of marriage and thirteen years of knowing her, he was practically a professional Weiss-decoder. Maybe even better than Ruby had been. Would be. Whatever. Time travel terminology sucked.\r\n\r\nSo when she'd announced at breakfast that she was 'inviting' the team down to Vale to see the festival preparations, his internal alarm bells had immediately started ringing, \"It'll be fun!\" she'd said with a smile so forced it looked painful, \"Team bonding!\"\r\n\r\nRuby had nearly choked on her cereal, \"You... want to hang out? With us? For fun?\"\r\n\r\n\"Is that so hard to believe?\" Weiss had asked, her eye twitching slightly.\r\n\r\n\"Yes,\" all three of them had answered in unison. Even Pyrrha.\r\n\r\nBut somehow, here they were, stepping off the airship in Vale. Jaune had managed not to vomit this time. Small victories. His teenage body might be gangly and awkward, but at least he'd overcome the motion sickness through sheer force of will and the memory of Yang's relentless \"Vomit Boy\" mockery., \"Oh!\" Weiss said, with all the subtlety of an Ursa in a porcelain shop, \"Ruby, Pyrrha, could you check if that shop over there has any Dust rounds? I've been meaning to restock.\"\r\n\r\nRuby frowned, \"But you just bought like a ton of premium Dust last week. You gave half of it to me, remember?\" Probably while calling her a skank and making veiled threats about how the bullets would be going through her back if she tried anything.\r\n\r\n\"Different kind,\" Weiss said quickly, \"Very specific. Technical. You wouldn't understand. I had it specially ordered.\"\r\n\r\n\"I'm pretty good with Dust, actually-\"\r\n\r\n\"Pyrrha needs help carrying it!\" Weiss blurted out.\r\n\r\nPyrrha, who'd been watching this exchange with bemused confusion, blinked, \"I do?\"\r\n\r\n\"Yes,\" Weiss said, eyes boring into Pyrrha with laser intensity, \"You do.\"\r\n\r\n\"Oh,\" Pyrrha said slowly, catching on that something weird was happening, \"Yes. I... need help. With the carrying. Of the Dust.\" Jaune didn't know whether to smile or sigh at Pyrrha's dogged determination to be nice and not rock the boat.\r\n\r\n\"Great!\" Weiss clapped her hands together, \"Off you go! Jaune and I will wait right here.\"\r\n\r\nAs soon as Ruby and Pyrrha were out of earshot, Jaune turned to Weiss with a raised eyebrow, \"Subtle.\"\r\n\r\n\"Shut up,\" Weiss said, dropping the fake smile, \"We need to talk.\"\r\n\r\n\"About what? Your complete inability to act like a normal human being?\"\r\n\r\n\"No, you insufferable oaf. About our plan for today.\"\r\n\r\nJaune crossed his arms, leaning against a nearby lamppost, \"What plan? You didn't tell me about any plan.\"\r\n\r\n\"That's because you've been avoiding me for the past three days.\"\r\n\r\n\"I haven't been avoiding you. I've been strategically minimizing my exposure to your particular brand of crazy.\" Mostly because he'd made a comment about her push-up bra and barely avoided being turned into a Jaune-cicle.\r\n\r\nWeiss' nostrils flared, but she seemed to physically restrain herself from escalating. Progress, Jaune supposed, \"We have two objectives today,\" she said, all business, \"First, we need to meet Penny.\"\r\n\r\n\"Penny?\" Jaune's heart gave a little pang at the name. Penny Polendina, the robot girl with more humanity than most humans he'd known. Cut down by...by him during the evacuation of Atlas. She'd asked for it - begged him to, really - and it was because of her sacrifice that he and the rest of team RWBY made it through the portal with the staff.\r\n\r\n\"Yes,\" Weiss said, \"In our original timeline, we - well, I - literally bumped into her while we were chasing Sun Wukong around. This time, I'm not going to be racist about the faunus situation, so we'll just 'happen' to run into Penny, and then I'll subtly make it so that Ruby and Penny become best friends.\" She made it sound like the most cunning plan on Remnant.\r\n\r\n\"Why?\" Jaune asked, though he was pretty sure he knew the answer.\r\n\r\nSure enough, Weiss' expression turned slightly maniacal, \"Because I care about Ruby, and hopefully Penny will keep Ruby's eyes from wandering like she did last time around.\" Jaune sighed, not even bothering to correct her about the non-existent cheating. Weiss had constructed her own reality around their divorce, and no amount of evidence was going to change her mind. He didn't really know how to feel about her downright schizophrenic treatment of Ruby.\r\n\r\n\"And the second objective?\" he asked instead.\r\n\r\n\"Today is the day that Roman Torchwick and the White Fang steal Dust from the docks,\" Weiss said, checking her scroll, \"I've made sure that the deliveries for Vytal weren't interrupted despite my coup against my father. Originally, this was when Blake ran off after I made some... insensitive comments about the faunus, and she and Sun encountered Roman at the docks.\"\r\n\r\n\"Right,\" Jaune said, remembering when Ruby told team JNPR second-hand all those years back. Back then, he'd been pettily jealous, thinking that team RWBY was off having all the fun adventures, \"And then the rest of you showed up later.\"\r\n\r\n\"Exactly. I wished I'd been at From Dust Till Dawn when Ruby first fought Torchwick, but I had something to deal with.\" She clicked her tongue, \"It's fine. The two of us can handle him this time, and Blake won't need to run off to prove the White Fang's involvement.\" Jaune nodded slowly. Despite his issues with Weiss, he had to admit it was a solid plan. They could apprehend Torchwick months ahead of schedule, potentially preventing a lot of the chaos that had led to the Breach.\r\n\r\nNeo was gonna be a problem though...\r\n\r\n\"You must've noticed it, by the way,\" she said airily, \"Our Aura.\"\r\n\r\nJaune grunted. He kenw what she meant. For some reason, their Auras had doubled when they got sent back, and they'd advanced rapidly. He'd unlocked his Semblance and Weiss could summon years ahead of schedule. Neither of them knew the exact reason why, but Weiss theorized that maybe it was because their souls had been sent back. And since Aura was the soul made manifest, they'd esentially compounded it. Jaune didn't really know how valid that sounded, and he didn't really care.\r\n\r\nAll he knew was that it'd make fighting Torchwick, Cinder, and everyone else easier. They'd be expecting first years, not fully-trained Huntsmen with double the Aura they should have had. Which in his case, was a lot.\r\n\r\n\"So we go to the docks tonight,\" he said.\r\n\r\n\"Yes. But first, Penny.\" Weiss checked her scroll again, \"She should be around here somewhere...\"\r\n\r\nAs if on cue, Ruby and Pyrrha emerged from the Dust shop, looking confused, \"They said they don't have any special technical Dust orders,\" Ruby said, giving Weiss a suspicious look.\r\n\r\n\"How strange. I was so sure I ordered from them,\" Weiss said, not sounding surprised at all, \"Well, let's continue our tour, shall we?\"\r\n\r\nThey walked through the bustling streets of Vale, Weiss keeping a keen eye out for a certain orange-haired girl. Jaune found himself doing the same, a mix of anticipation and dread swirling in his stomach. Seeing people who had died in the original timeline - Penny, Pyrrha - was simultaneously heartwarming and heartbreaking.\r\n\r\n\"Oh!\" Weiss suddenly exclaimed, stopping short, \"I think I see- oomph!\" She was cut off as someone collided with her from behind, sending her stumbling forward. Jaune caught her reflexively, his hands gripping her waist to steady her. For a brief moment, they were pressed together, faces inches apart, and Jaune was hit with a wave of unwelcome familiarity. Her perfume - winter pines and frost - hadn't changed, and he felt how soft her skin was even through her dress.\r\n\r\nWeiss' face flushed and she jerked away from him like she'd been burned, whirling around to face the person who'd bumped into her.\r\n\r\n\"Salutations!\" And there she was. Penny Polendina, looking exactly as Jaune remembered. Bright orange hair, big green eyes, and that slightly stiff, too-perfect posture that hinted at her non-human nature, \"I apologize for the collision!\" Penny said, giving a little bow, \"I was not properly calibrating my direction of movement!\"\r\n\r\nWeiss smiled. A genuine smile, not the forced grimace she'd been sporting earlier, \"It's quite alright,\" she said, \"No harm done. I'm Weiss Schnee, and these are my teammates: Ruby Rose, Pyrrha Nikos, and Jaune Arc.\"\r\n\r\nPenny's eyes widened slightly at each name, like she was recording them to memory. Which, Jaune realized, she probably was. \"It is a pleasure to meet you all!\" Penny said, \"My name is Penny! I'm here for the tournament!\"\r\n\r\n\"You're a fighter?\" Pyrrha asked, perking up with interest.\r\n\r\n\"I'm combat ready!\" Penny confirmed with an enthusiastic salute. He tried not to think of her begging him to kill her.\r\n\r\nWeiss smiled again, looking at Ruby expectantly. This was clearly the moment in her master plan where Ruby and Penny were supposed to bond. Time for the subtle manipulation to work its magic. \"It's lovely to meet you, Penny,\" Weiss said, her voice dripping with uncharacteristic warmth, \"Ruby, perhaps you'd like to hang out with our new friend Penny here? I'm sure you two would get along splendidly. You seem like you have much in common!\"\r\n\r\nJaune nearly choked trying not to laugh. Subtle was definitely not Weiss' strong suit.\r\n\r\nPenny tilted her head, processing this. And then, instead of turning to Ruby as Weiss had so transparently orchestrated, she took a step closer to Weiss, \"Friend?\" she repeated, leaning in so close that Weiss had to lean back, \"Did you just call me... friend?\"\r\n\r\nWeiss' eyes widened as she realized her mistake, \"I, uh- well, what I meant was-\"\r\n\r\n\"Are we friends?\" Penny pressed, her green eyes huge and hopeful. Hungry for connection.\r\n\r\n\"I- that is- Ruby is the one who- \" Weiss stammered, looking frantically at Ruby for help. But Ruby, bless her oblivious heart, was distracted by a weapons shop across the street and left her partner to fend for herself. Jaune and Pyrrha shared a look, Jaune barely holding back a shit-eating grin while Pyrrha looked both confused and worried. He shook his head.\r\n\r\n\"Sensational!\" Penny said, clasping her hands together, \"I've never had a friend before! This is such a momentous occasion! Friend Weiss, we must commemorate this development in our relationship!\" Jaune couldn't hold it in anymore. He burst out laughing, earning a death glare from Weiss that only made him laugh harder. She'd been so determined to push Penny and Ruby together, and now she was stuck with an enthusiastic robot girl who'd imprinted on her like a baby duckling.\r\n\r\n\"I'm not- we're not-\" Weiss tried, but Penny was already looping her arm through Weiss', practically vibrating with excitement. No, wait, she was literally vibrating.\r\n\r\n\"What activities do friends typically engage in?\" Penny asked, \"I have compiled a list of potential friendship rituals from my observations, but firsthand data would be most valuable!\"\r\n\r\n\"Ruby,\" Weiss said desperately, \"Don't you want to be friends with Penny too?! She seems right up your alley! Enthusiastic! Weapon-oriented! Not at all like me!\"\r\n\r\nRuby, finally tuning back into the conversation, smiled, \"Uh, sure! The more friends, the merrier! But it looks like you guys are already hitting it off, so don't mind me.\"\r\n\r\n\"Perfect!\" Penny said, \"Friend Weiss and Friend Ruby! This exceeds all expectations for my first day of autonomous exploration!\"\r\n\r\nJaune was pretty sure he'd cracked a rib from trying to suppress his laughter. The look of absolute horror on Weiss' face as she realized she was now stuck with the very friend she'd tried to pawn off on Ruby was priceless, \"So, Penny,\" Jaune said, deciding to twist the knife a bit, \"Weiss was just saying how much she loves showing new friends around Vale. I bet she'd be thrilled to give you a personal tour.\"\r\n\r\nIf looks could kill, Jaune would have been a smoking crater in the pavement. Weiss' glare promised slow, painful retribution, \"Is that true, Friend Weiss?\" Penny asked, eyes shining with hope.\r\n\r\n\"I... yes,\" Weiss managed through gritted teeth, \"Nothing would make me happier.\"\r\n\r\n\"Sensational! Perhaps we could begin with an analysis of local cuisine? I am most curious about the concept of 'comfort food' and its psychological effects!\" As Penny began dragging Weiss toward a nearby cafe, chattering excitedly about friendship protocols and nutritional intake, Jaune caught his ex-wife's eye over Penny's shoulder. He grinned and gave her a little wave, enjoying her predicament far more than he probably should have.\r\n\r\nWeiss mouthed what looked suspiciously like \"I will end you\" before being pulled through the caf door by her enthusiastic new best friend.\r\n\r\n\"Well,\" Jaune said to Ruby and Pyrrha, \"that wasn't how I expected this trip to go, but I can't say I'm disappointed.\"\r\n\r\n\"Weiss made a friend!\" Ruby said, sounding genuinely happy, \"That's great! She needs to do more than just calling me names and buying me stuff.\" Pyrrha nodded politely, though she still looked confused by the whole interaction.\r\n\r\nJaune glanced at his scroll, checking the time. They still had hours before the White Fang would show up at the docks. And now it seemed like he'd be handling that situation alone, since Weiss was busy with her new BFF. He couldn't wait to remind her of this spectacular backfire the next time she accused him of being the incompetent one in their relationship.\r\n\r\nFormer relationship, he corrected himself mentally. Very, very former.\r\n\r\nThough watching her squirm under Penny's enthusiastic friendship advances had been oddly... endearing? No, that wasn't the right word. Hilarious. That was it. Definitely hilarious, not endearing at all.\r\n\r\n[line break]\r\n\r\nChapter 3 has them clowning the villains and Ozpin/Ironwood getting a massive infodump."
    },
    {
      "title": "Chapter 3",
      "text": "Chapter 3 out of maybe 5. Hope you guys enjoy.\r\n\r\n[line break]\r\n\r\nRoman Torchwick considered himself a professional. A criminal mastermind, a master thief, a criminal virtuoso. Vale's most wanted for a reason. He had style, panache, and enough skill with his cane to make even trained Huntsmen think twice before crossing him (and made them regret when they did). You didn't grow up in the mean streets of Mistral without learning how\r\n\r\nSo how, exactly, had his evening devolved into... this?\r\n\r\nThe heist had started perfectly. Moonlight gleaming off the shipping containers at the Vale docks. The White Fang grunts - useless animals, the lot of them, but they had numbers and were scared enough of Cinder to follow orders - were actually managing to load Dust crates without dropping them for once. Neo was off handling another job, but he didn't need her for simple grunt work like this.\r\n\r\nRoman took a long drag from his cigar, savoring the expensive blend. In an hour, they'd be gone with enough Dust to keep Cinder happy, and he'd be one step closer to whatever insane endgame the crazy fire witch was planning. Not that she bothered to tell him the details. Just \"steal this\" and \"recruit them\" and \"don't fail me, Roman.\"\r\n\r\nWomen. Always so demanding.\r\n\r\n\"Well, well, well. Stealing from the Schnee Dust Company? I must say, that's rather offensive to me personally.\"\r\n\r\nRoman spun around, cane at the ready, to find two teenagers standing at the edge of the docks. A short, prissy little thing in white with a rapier, and a tall, lanky blonde farmboy with a sword and shield that looked like hand-me-downs from the Great War.\r\n\r\nOh, for the love of-\r\n\r\n\"Kids,\" Roman said, forcing a smile as he tapped his cigar against the edge of his cane, \"shouldn't you be in bed? It's past your curfew.\"\r\n\r\nThe white-haired girl stepped forward, and Roman recognized her immediately. Weiss Schnee. The Special Snowflake Princess herself. Co-CEO of the SDC after her daddy got arrested for tax fraud or embezzlement or whatever it was - hard to keep track of white-collar crimes when you specialized in the more direct variety. Honestly, at least he was honest about being a criminal. All that spreadsheet and bribing politicians sounded like far too much busywork.\r\n\r\n\"That's my Dust you're stealing,\" she said, chin raised with all the entitlement of someone born with a silver spoon lodged permanently up her ass, \"And I'm not in the habit of letting petty criminals help themselves to my property.\"\r\n\r\nRoman laughed. Genuinely laughed, \"Sweetheart, shouldn't you be at a board meeting? Or a debutante ball? Playing Huntress is going to ruin your manicure.\" He glanced at the blonde farmboy, \"And who's your date? He looks like he got his combat gear from a yard sale.\" The farmboy just smiled, and something about that smile made Roman's instincts twitch. It wasn't the smile of some scared kid. It was the smile of someone who knew something Roman didn't.\r\n\r\n\"I'm giving you one chance to surrender,\" Schnee said, drawing her ridiculous toothpick of a rapier, \"Before this gets... messy.\"\r\n\r\n\"Yeah,\" the blonde added, drawing a surprisingly well-maintained sword, \"We've got, like, three other apocalypses to prevent after this, so...\"\r\n\r\nRoman blinked. What did the farm boy just say? \"Seriously?\" the Schnee girl hissed, turning to her friend with narrowed eyes, \"You just had to mention the apocalypses, didn't you? What happened to subtlety?\"\r\n\r\n\"Oh, I'm sorry,\" the blonde shot back, \"I forgot I was talking to the queen of subtlety here. How's your new best friend Penny doing, by the way?\"\r\n\r\nThe Schnee girl's face turned an interesting shade of crimson, \"Shut up, Arc!\"\r\n\r\nRoman sighed dramatically, \"Look, Ice Queen, I'm not in the mood to fight children tonight. Even rich ones playing dress-up with Daddy's money. Oh wait-\" he grinned, \"Daddy's in prison now, isn't he? So I guess you're just the pretty figurehead while the grown-ups run the company, hmm?\"\r\n\r\nHe expected her to get flustered. To stamp her foot and pout. What he didn't expect was for her to move faster than his eyes could track, a blur of white that suddenly materialized two inches from his face, \"First,\" she said, her voice colder than Atlas in winter, \"I earned my position. Second, you talk too much.\" Roman barely managed to bring his cane up to block the rapier thrust aimed at his throat. The impact sent vibrations up his arm that made his teeth rattle. What the hell? He knew Aura was a force equalizer, but this was ridiculous. He'd taken hits from Huntsmen twice her weight without flinching.\r\n\r\n\"White Fang! Hey, you animals!\" he shouted, backpedaling rapidly, \"Earn your keep!\"\r\n\r\nA dozen Faunus terrorist charged forward, weapons raised. The farmboy stepped in front of Schnee - chivalrous idiot - and raised his shield, \"You realize I can handle myself, right?\" Schnee said, glaring at the blonde.\r\n\r\n\"Old habits,\" the boy replied with a shrug, \"You going to summon the Knight, or should I handle these guys myself?\"\r\n\r\n\"Oh, because you did such a good job handling those Beringels in Vacuo?\"\r\n\r\n\"That was one time! And I had food poisoning!\" \r\n\r\n\"From a hot dog you insisted was 'perfectly fine' despite sitting in the sun for three hours!\"\r\n\r\nRoman blinked, momentarily forgetting the imminent threat as he watched the two teenagers bicker like... well, like an old married couple. What the hell was going on?\r\n\r\nHis confusion was short-lived as the Schnee girl suddenly slammed her rapier into the ground, creating a massive glyph thatsummoned a giant, spectral knight twice as tall as the shipping containers. The glowing behemoth swung its sword in a wide arc, sending White Fang grunts flying like bowling pins. Roman grit his teeth. Damn Semblances.\r\n\r\n\"Show-off,\" the farmboy muttered, before charging directly at him. Roman fired his cane, the explosive round speeding toward the boy's face. The kid should have at least tried to dodge. Instead, he just tilted his shield slightly. The round bounced off at precisely the right angle to hit a White Fang grunt who was sneaking up on Schnee. The resulting explosion sent the Faunus flying into the harbor with a splash.\r\n\r\n\"Trying to be a gentleman, Arc?\" Schnee called, not even looking back as her spectral knight flattened three more White Fang members, \"But I suppose I should thank you.\"\r\n\r\n\"Lucky ricochet,\" the farmboy - Arc, apparently - replied, closing the distance to Roman with alarming speed. Roman swung his cane, aiming for the kid's head. The boy didn't even try to block. He just... wasn't there when the cane arrived, having shifted his weight by a fraction of an inch. The dodge was so effortless, so casual, that Roman felt a surge of genuine anger.\r\n\r\n\"Stand still, you little-\" Roman's insult was cut short as the flat of Arc's blade slammed into his gut, driving the air from his lungs.\r\n\r\n\"Your footwork's gotten sloppy,\" Schnee commented, casually disarming two White Fang members without taking her eyes off Arc, \"I'm surprised they even let you into Beacon this time around.\" This time around? What was that supposed to mean?\r\n\r\n\"Says the girl who can't even hit a Boarbatusk without tripping over her own feet,\" Arc shot back, blocking Roman's retaliatory swing and countering with a shield bash that sent Roman staggering.\r\n\r\n\"That was one time! And it was because you distracted me with that ridiculous dance you were doing!\"\r\n\r\n\"It wasn't a dance, it was a legitimate combat technique!\"\r\n\r\n\"The only technique involved was making yourself look like an idiot!\"\r\n\r\nRoman, having regained his footing, stared at the bickering teenagers in complete bewilderment. They were demolishing his operation - his beautiful, perfect heist - while arguing like they'd known each other for decades. The Schnee girl's summon was methodically crushing White Fang militants. The farmboy was casually blocking and dodging Roman's every attack like he could read Roman's mind. And they just. Wouldn't. Shut. Up.\r\n\r\n\"-never should have let you plan our honeymoon!\" Schnee was saying as she created a series of glyphs that launched three White Fang members into the air.\r\n\r\n\"Oh, here we go again with the honeymoon!\" Arc rolled his eyes, ducking under Roman's swing and retaliating with a kick that connected solidly with Roman's knee, \"I said I was sorry about the Grimm attack! How was I supposed to know there was a nest of King Taijitus under the resort?\"\r\n\r\nHoneymoon? These kids were like, what, seventeen? Brothers, those Atlesians married young, didn't they? Roman's brain was starting to hurt, and not just from the repeated impacts of farmboy's shield against his head, \"WILL YOU TWO SHUT UP AND JUST FIGHT?!\" Roman finally screamed, his composure cracking like cheap glass, \"FOR THE LOVE OF- JUST STOP BICKERING AND FOCUS ON THE BATTLE!\"\r\n\r\nBoth teenagers paused, turning to look at him with identical expressions of surprise, as if they'd forgotten he was there even as they were trampling him underfoot, \"He's right, you know,\" Arc said after a moment, lowering his shield slightly, \"We're being unprofessional.\"\r\n\r\n\"I suppose,\" Schnee said with a sniff, \"We should focus on apprehending the criminal element.\"\r\n\r\n\"Thank you!\" Roman exclaimed. Finally they could have some-\r\n\r\nThe farmboy's shield slammed into his face with enough force to make him see stars. As he staggered backward, he saw the Schnee girl creating what looked like a giant, spectral fist above his head, \"This doesn't mean I forgive you for the honeymoon!\" was the last thing Roman heard before the fist came crashing down.\r\n\r\nWhen Roman regained consciousness, he was trussed up like a Seasonal Festival turkey, his hands and feet bound with what felt like ice. Around him, the White Fang members were in similar states of restraint and unconsciousness. Or dead. The Dust shipment sat untouched.\r\n\r\nAnd the two teenagers were still arguing.\r\n\r\n\"-could have timed that better if you hadn't been grandstanding with your shield,\" Schnee was saying, examining her nails as if checking for chips in the polish.\r\n\r\n\"Me? Grandstanding? That's rich coming from Miss 'I Need to Summon a Giant Knight for Five Grunts'! Did you forget how to swing a sword, Ice Queen? When was the last time you ever used Time Dilation? Could've used that in that Deathstalker hunt in Anima!\"\r\n\r\n\"It was efficient! And don't you dare bring up my time dilation! You know I'm sensitive about that!\"\r\n\r\n\"It was excessive! Just like our wedding cake!\"\r\n\r\n\"Don't you DARE bring up the cake again, Jaune Arc! I will freeze you solid and feed you to a Nevermore!\"\r\n\r\nRoman let his head thump back against the concrete. Maybe jail wouldn't be so bad. At least it would be quiet.\r\n\r\nIn the distance, he heard police sirens approaching. Neo was going to be so disappointed in him. Cinder was going to be furious. But somehow, the thing that bothered him most was that he'd been defeated by two children who couldn't even stop fighting each other long enough to fight him properly.\r\n\r\nProfessional pride. It was a curse sometimes.\r\n\r\nAs the police cars pulled up to the docks, Roman closed his eyes and hoped that whatever cell they put him in had good soundproofing. He'd had enough of teenage drama for one night.\r\n\r\n[line break]\r\n\r\nAdam Taurus was not a patient man. Particularly not when it came to incompetence, and especially not when that incompetence came from humans. Roman Torchwick's arrest weeks ago had set their timeline back significantly. The flamboyant criminal had one job - acquire Dust - and he'd managed to fail spectacularly at the hands of two Beacon students. One of whom was a Schnee.\r\n\r\nThe irony wasn't lost on Adam.\r\n\r\nHe stalked through the abandoned subway tunnels beneath Mountain Glenn, Wilt and Blush strapped securely to his hip. The darkness posed no issue for his faunus eyes, which swept methodically over the train cars lined up and ready. Each one loaded with stolen Dust, bombs, and the means to breach Vale's defenses. When the time came, they would punch a hole straight through to the city center, allowing the Grimm lurking in the ruins above to pour in and feast on human fear.\r\n\r\nIt wasn't supposed to happen yet, of course. But Adam was nothing if not thorough. Every detail had to be perfect, \"The final coupling mechanisms are in place,\" Bane said, his massive lieutenant's chainsaw resting casually against his shoulder as he approached. The man's imposing size made even the spacious tunnels feel cramped, his Grimm mask more elaborate than those of the regular foot soldiers, \"We'll be ready to move on your command when the time comes.\"\r\n\r\nAdam nodded, satisfaction mingling with irritation. The plan was sound, but he couldn't help thinking they could have been weeks ahead of schedule if not for Torchwick's failure, \"And the explosives?\"\r\n\r\n\"Primed and ready. Each car is rigged to detach and detonate on impact.\"\r\n\r\n\"Good.\" Adam had no fond feelings for Cinder Fall or her scheme, but their goals aligned for now. If working with a human meant bringing Vale to its knees - meant making the Schnees and their ilk feel true fear - then he would tolerate the arrangement. Whether they stayed 'allies' after her plans came to fruition remained to be seen, though he had his doubts.\r\n\r\nCinder had \"suggested\" that Torchwick's partner, that diminutive assassin with the parasol, join him after Roman's arrest. Adam had refused outright. After Torchwick's \"leadership\" had led to the arrests and deaths of their Brothers and Sisters, the remaining White Fang couldn't stomach the idea of another human in their midst. And neither could he. This was an alliance of convenience, nothing more. It had been a mistake to let a human assume command for even the small group he'd been given.\r\n\r\n\"We should check the forward cars again,\" Adam said, turning toward the front of the train, \"Make sure the Paladins are secured properly for transport.\" Bane followed silently, his heavy footfalls echoing through the tunnel. They had just reached the lead car when Adam's instincts flared. He froze, hand moving to Wilt's hilt, \"Someone's here,\" he said quietly, the words barely loud enough for Bane to hear.\r\n\r\nAs if on cue, two figures emerged from the shadows ahead, stepping into the dim light cast by the tunnel's sparse emergency fixtures. Adam's lip curled into a snarl beneath his mask as he recognized the smaller figure. White hair, pale skin, and that unmistakable air of superiority that all Schnees carried like a second Semblance.\r\n\r\nWeiss Schnee. The newest co-CEO - co-tyrant - of the company that had ground his people beneath their heel for generations. She stood with perfect posture, one hand resting casually on the rapier at her hip, looking spectacularly unimpressed to find the leader of the Vale branch of the White Fang in an abandoned tunnel. Beside her stood a tall, blond human male with a sword and shield. Adam dismissed him with barely a glance. Just another Huntsman-in-training playing at heroics.\r\n\r\nThe Schnee's eyes - cold and blue as glacier ice - met his mask, \"Adam Taurus, I presume?\" she said, her voice carrying the cultured inflection of someone raised in Atlas high society, \"Beacon's a little lax on their security, don't you think? How did THIS slip past them?\"\r\n\r\nThe blond human snorted, \"You're seriously going to critique the school's security? Right now?\"\r\n\r\n\"It's a valid point, don't pretend you don't agree.\" she retorted, not looking at him, \"If Ozpin had sent a team when the tracks were first discovered, we might have caught them still setting up.\"\r\n\r\nAdam gave them no warning. No speech. No chance to surrender. He simply attacked. His sword cleared its sheath in a flash of crimson, the blade singing through the air as he launched himself at the Schnee. She would die first. Quickly, if she was lucky. Slowly, if he was lucky.\r\n\r\nThe Schnee didn't even flinch. With a casual flick of her wrist, a glyph materialized beneath her feet, propelling her sideways as Adam's blade sliced through empty air. Before he could adjust, a wall of ice erupted from the ground, forcing him to leap backward, \"Wow, not even a monologue?\" the blond human called out, already engaged with Bane, whose massive chainsaw was whirring to life, \"That's refreshing! Most bad guys love to talk before they try to kill us.\"\r\n\r\n\"He's not the type,\" the Schnee replied, summoning a series of glyphs that surrounded Adam like a cage, \"Blake mentioned he was more of the 'strike first, spout manifesto later' variety.\"\r\n\r\nAdam's blood boiled at the casual mention of Blake's name, \"You dare speak of her?\" he snarled, slashing through one of the glyphs only to find two more appearing in its place, \"After your family enslaved our kind for generations?\"\r\n\r\nThe Schnee rolled her eyes - rolled her eyes - at him, \"Dramatic, aren't we? For your information, I've implemented more faunus labor reforms in three years than the Vale Council has in three decades. But I suppose it's easier to paint all humans with the same brush than acknowledge progress, isn't it?\" She sighed, dodging his attacks with contemptous ease, \"From what I've heard, you had - have, sorry - a black and white view of the world. Faunus up top, Humans at the bottom, all Schnees evil.\"\r\n\r\nAdam channeled his rage into his next strike, charging his blade with the energy he'd absorbed from the glyph. The red highlights in his mask glowed ominously as he prepared to unleash his Semblance-\r\n\r\nOnly to find himself surrounded by not one, but three spectral knights, their massive swords poised to strike from different angles, \"Looking for a fair fight?\" the Schnee asked, her tone almost bored, \"Sorry to disappoint. I don't believe in fighting fair against terrorists.\"\r\n\r\nAdam was forced to abort his attack, using his Semblance's energy to deflect the simultaneous strikes from the summoned knights. As he did, a fourth summon - this one a Boarbatusk - slammed into his side, sending him skidding across the tunnel floor.\r\n\r\n\"You know what I find fascinating?\" the Schnee said, creating yet another glyph that accelerated her movement to blinding speed. Even his enhanced senses could barely keep up, \"You claim to fight for faunus equality, yet here you are, planning to flood Vale with Grimm.\" She appeared behind him, rapier striking at his exposed back. Adam barely twisted in time to block, \"The same Vale where thousands of faunus live and work. Amazing consistency there.\"\r\n\r\n\"You know nothing of our struggle!\" Adam sbarke, frustration mounting as he found himself constantly on the defensive. Every attack he blocked seemed to spawn three more from different directions, whittling away at his Aura, barely giving him a chance to absorb energy for his Semblance.\r\n\r\n\"Oh, I know plenty,\" the Schnee replied, dancing - literally dancing - around his increasingly desperate attacks, \"I know you're so obsessed with punishing humans that you don't care how many faunus die in the process. How very noble of you.\"\r\n\r\nAcross the tunnel, the blond human was making short work of Bane and the White Fang soldiers who had rushed to assist. Adam had seen Bane tear through trained Huntsmen with that chainsaw, yet the blond was matching him strength for strength, his shield deflecting the massive weapon while his sword found every gap in Bane's defense, \"You're literally feeding your own people to the Grimm,\" the blonde called out, driving his shield into Bane's chest with enough force to dent the tunnel wall when the lieutenant crashed into it, \"Did you even think this plan through? Or were you too busy polishing that edgy mask?\"\r\n\r\n\"Don't waste your breath, Jaune,\" the Schnee said, summoning yet another creature - an Ursa this time - to pursue Adam as he attempted to gain some distance, \"He's not exactly known for his critical thinking skills. Just ask Blake.\" She summoned more glyphs around him, \"You know, given how much he hates my family, I'm surprised we didn't meet before.\"\r\n\r\n\"Oh, here we go again,\" the human - Jaune, she called him - groaned, disarming another White Fang member with insulting ease, \"Of course you have to make Blake's trauma all about you.\"\r\n\r\n\"I'm not making it about me!\" the Schnee snapped, her attention briefly shifting from Adam, \"I'm just pointing out that for someone who despises my family, he certainly didn't make an effort to hunt a Schnee down! It's inconsistent!\"\r\n\r\n\"Classic Weiss Schnee,\" Jaune said, rolling his eyes as he casually blocked a strike from Bane that should have cleaved him in two, \"Always has to make herself the center of Remnant.\"\r\n\r\n\"I am not getting advice about being self-centered from a guy who cheated on me with our best friend!\"\r\n\r\n\"Oh, here we go again with this!\" The blonde threw Bane like a ragdoll, \"Nothing happened! I think I'd know if Ruby was trying to get in my pants!\"\r\n\r\n\"You'd know? What, you're a relationship expert now? That's rich coming from the man who thought bringing flowers to Pyrrha after she'd been crushing on him for a year was 'just being friendly'!\" \r\n\r\n\"That was DIFFERENT and you know it!\"\r\n\r\nAdam stared in disbelief. They were... arguing? In the middle of combat? And still somehow managing to thoroughly trounce him and his men? The indignity of it burned almost as much as the growing collection of cuts, bruises, and ice burns decorating his body, \"If you're finished with your domestic squabble,\" Adam snarled, gathering what energy he could for one final, desperate attack, \"Perhaps you'd like to focus on the battle at hand!\"\r\n\r\nThe Schnee turned back to him, looking almost surprised, as if she'd forgotten he was there, \"Oh, we are focused,\" she said, her rapier glowing with Dust energy, \"Trust me, if we weren't, you'd have been dead five minutes ago.\"\r\n\r\n\"We're multitaskers,\" Jaune added cheerfully, standing over the unconscious forms of Bane and three other White Fang members. His Aura was barely depleted, the white glow still strong around his frame, \"Years of practice arguing while fighting.\"\r\n\r\nAdam didn't understand. These were students - children - yet they fought with the coordination and skill of veteran Huntsmen. And the Schnee's summoning ability... he'd never heard of a Schnee manifesting that power so young. Even the combat footage of Winter Schnee paled in comparison,\r\n\r\n\"You should have come alone, Adam,\" the Schnee said, raising her rapier as glyphs formed in a ring around him, \"Blake always said you were at your most dangerous when isolated. Charging your Semblance with every hit you took until you could release it all at once.\"\r\n\r\n\"That's why we brought friends,\" Jaune added, gesturing to the summoned creatures still circling Adam, \"Can't charge your Semblance if you can't land a solid hit, right?\"\r\n\r\nAdam's rage reached its peak. How dare they speak so casually about his abilities? About Blake? As if they knew anything about either? He would not be mocked by humans - especially not by a Schnee. With a roar of fury, he charged, Wilt's blade glowing with what little energy he'd managed to store.\r\n\r\nThe Schnee sighed, almost disappointed, \"Predictable.\" A massive glyph formed directly in his path, \"Jaune, would you mind?\"\r\n\r\n\"Nah. I still owe him for what he did to Yang. Or what he would have done to Yang. Time travel makes grammar complicated.\"\r\n\r\nWhat in the hell were they-\r\n\r\nAdam's thoughts were cut short as the blond human's shield slammed into him from behind, propelling him directly into the Schnee's waiting glyph. The world exploded into white as lightning Dust coursed through his body, overloading his nervous system and sending him crashing to the ground, his Aura shattered.\r\n\r\nAs consciousness faded, Adam Taurus - feared leader of the Vale branch of the White Fang, the Scourge of Atlas, the sworn enemy of the Schnee family - was forced to endure the final indignity of hearing his conquerors resume their bickering.\r\n\r\n\"We should have come sooner,\" the Schnee was saying, her voice already fading as consciousness slowly began to slip away, \"If you hadn't insisted on that ridiculous stakeout in Forever Fall-\"\r\n\r\n\"Oh, so now it's my fault that you wanted to make absolutely sure before acting? I remember someone saying 'we need concrete evidence before we can approach Ozpin'...\"\r\n\r\n\"That was before I knew you'd fall asleep during your watch!\"\r\n\r\n\"I did NOT fall asleep! I was conserving energy!\"\r\n\r\n\"By SNORING?\"\r\n\r\nAdam's last conscious thought was that perhaps death would have been preferable to this humiliation. At least then he wouldn't have to listen to these two argue like an old married couple while they dismantled everything he'd worked for.\r\n\r\nHe got his wish. Just as they were discussing a \"disastrous honeymoon in Vacuo\" and Schnee screamed about \"signing the divorce papers again this time around\", the blonde human gestured to him. The last thing Adam saw was Schnee walking towards him before she raised her rapier, the tip aimed straight at his head. Then she thrust down and everything went black.\r\n\r\n[line break]\r\n\r\nCinder Fall was not accustomed to things going wrong. Her plans were meticulous, her contingencies had contingencies, and she'd spent years orchestrating Salem's machinations with a precision that bordered on artistry. But lately, annoyance had become her constant companion.\r\n\r\nShe glanced at her scroll again, tapping a manicured nail against its darkened screen. Adam still wasn't answering her calls, which she couldn't say surprised her. After Roman's spectacular failure at the docks, the Faunus extremist had been even more of a sullen little terrorist than usual, barely deigning to acknowledge her instructions during their last meeting. Still, so long as he performed his role when the time came, he could be as pouty as he wanted. She only needed him for the White Fang's numbers and to move the train when the signal came. After that? Well...she didn't really need him and his pack of pathetic zealots anymore.\r\n\r\nCinder leaned back on her bed with a sigh, right leg crossed elegantly over her left. The Haven Academy uniform was hardly her most glamorous costume, but needs must. Her golden eyes swept across the modest dorm room that served as their temporary headquarters, her gaze calculating.\r\n\r\nFirst, they needed to find precisely where Ozpin was keeping the Fall Maiden's body. Then, they would trigger the train crash from Mountain Glenn, combined with the sabotage they had planned for the Vytal Tournament. The ensuing chaos would keep Ozpin and his sycophants distracted enough that they'd never see the real attack coming until it was too late. Killing Ozpin himself was secondary. Her mistress made it clear that the Maiden powers were what mattered, not his (temporary) demise.\r\n\r\nBut for now, they had to wait. Patience, after all, was one of her more cultivated virtues.\r\n\r\nCinder's eyes moved to the rest of her \"team.\" Emerald sat nearby at the desk, pretending to study while casting furtive glances her way. The mint-haired thief had that same expression she always wore when watching Cinder: a pathetic look of fawning adoration mixed with desperate need for approval. The girl was useful, her illusion Semblance invaluable, but maintaining the facade of the doting mother figure (or was it sister? Emerald seemed to see her as both simultaneously) could be grating. Still, she knew the value of having someone with Emerald's talents slavishly loyal. A few well-placed compliments were cheap currency for that kind of devotion.\r\n\r\nHer gaze flickered to Mercury, who lay sprawled on his bed, hands behind his head, staring at the ceiling with affected boredom. The gray-haired assassin was perhaps the most difficult to read. Unlike Emerald, she had no real leverage over him. He'd joined because violence was all he knew, and she offered that in abundance. But technically, nothing prevented him from simply walking away if he chose. That unpredictability made him both valuable and annoying. She had Emerald keeping an eye on him for a reason.\r\n\r\nAnd finally, there was Neo. Or Mint Cream, as she appeared in her current disguise. The disguised little gremlin had been downright sullen since Roman's arrest. She'd attempted to orchestrate a breakout immediately, forcing Cinder to forbid the action with a not-so-subtle reminder of what disobedience would cost. The last thing they needed was to draw even more attention to themselves. Roman Torchwick, notorious thief, working with terrorists had already put the city on edge. If he escaped now, the heightened security would only complicate their plans further. No, they needed Vale calm and complacent. For now.\r\n\r\n\"I'm turning in,\" Cinder announced, stretching her arms languidly above her head, a motion calculated to draw Emerald's hungry gaze. Let the girl starve for affection; it made her easier to control, \"We'll discuss our next move in the morning.\"\r\n\r\nEmerald nodded eagerly, of course, while Mercury grunted without bothering to look her way. Neo simply stared, her disguised eyes unreadable, before returning her attention to her parasol. Insolent little creature. Once Roman outlived his usefulness, perhaps Neo would have an unfortunate accident as well, \"Do you need anything before you sleep?\" Emerald asked eagerly, \"A glass of water? An extra blanket?\"\r\n\r\n\"I'm fine,\" Cinder replied, letting a hint of warmth color her voice, \"But thank you, dear.\" Emerald practically glowed at the endearment. So pathetically predictable.\r\n\r\nCinder settled back against her pillows, arranging her body in a pose of casual elegance even in sleep. One never knew when one might be observed, after all. She closed her eyes, letting her mind drift to the power that would soon be hers. The half of the Fall Maiden's abilities she'd already stolen thrummed beneath her skin, a constant reminder of the greater prize awaiting her. Adam could throw his little tantrum as long as he answered when the time came. For now, she would get her beauty sleep.\r\n\r\nHer dreamless rest was abruptly interrupted hours later by the sound of the door opening. Cinder's eyes shot open, instantly alert...except her body refused to respond. Her arms, legs, even down to her fingers and toes. All completely numb and immobile. On top of that, the room seemed to be spinning wildly around her, as if she were trapped in a crashing Bullhead. All she could move were her eyes, which darted around in panic, taking in the sight of her equally incapacitated teammates and the two figures stepping into their room.\r\n\r\nWeiss Schnee, the spoiled Atlas heiress who had interfered with Roman's operation, stood in the doorway, a smug smile playing on her lips. Beside her, the tall blonde boy from Team RJWP (an utterly forgettable team that shouldn't have been on her radar at all) surveyed the room with a grim expression that seemed oddly out of place on his youthful face.\r\n\r\n\"See?\" Schnee said, gesturing toward Cinder's paralyzed form with an elegant flick of her wrist, \"I told you the paralytic would work. You owe me fifty lien.\"\r\n\r\nThe blonde - Jaune, if she recalled correctly from Ruby Rose (a Silver-Eyed Warrior) screaming his name - shook his head, \"You're still kind of crazy for suggesting we poison the entire exchange student dorm's water supply just to get to four people.\"\r\n\r\n\"It wasn't the entire supply,\" Schnee replied, rolling her eyes, \"Just their room. And it's only temporary paralysis. The kitchen staff will just assume it was mild food poisoning.\"\r\n\r\n\"Tell that to the poor maintenance guy who's going to find a dozen paralyzed Haven students when he checks the plumbing issue I reported.\"\r\n\r\n\"Details,\" Schnee waved dismissively, \"Look, I'm not exactly happy that they were caught up in it, but by the time most of them wake up tomorrow, the poison will have passed. The ones who don't will chalk it up to sleep paralysis. I'll give a generous donation to Haven - after Lionheart is removed, of course - as compensation. The important thing is that it worked. Look at them. Complete neuromuscular inhibition, just as I predicted.\"\r\n\r\nCinder tried to make sense of what was happening. Poison? These...children had poisoned them? How was that possible? And more importantly, how did they know to target her team specifically? How did they know about that coward Lionheart? Her mind raced, trying to identify where security had been breached. Had Torchwick talked? Had Adam been compromised?\r\n\r\nWith a mental growl of effort, Cinder attempted to tap into the partial power of the Fall Maiden she possessed. She felt the familiar warmth building behind her eyes, the beginning of flames licking at her fingertips-\r\n\r\nOnly for everything to go abruptly dark as the blonde's boot connected with her face with shocking force. Her concentration shattered, the nascent flames sputtering out as her head snapped back and she fell from the bed onto the carpeted floor, \"This is for Pyrrha,\" the boy said, his voice suddenly cold and hard, utterly unlike the awkward student she'd occasionally observed in the dining hall, \"And for Penny, and Beacon, and every other life you destroyed.\"\r\n\r\nCinder's vision swam, confusion mingling with the pain blossoming across her face. Pyrrha? Penny? What was he talking about? Who were these people to her? And what did he mean by \"destroyed\"? She hadn't done anything...yet. She caught a glimpse of Emerald's wide, terrified eyes across the room, the thief struggling uselessly against her paralysis. Mercury's face was locked in a snarl of impotent rage. Neo's disguise had partially slipped, one eye pink, one brown, her features flickering between identities as her concentration faltered.\r\n\r\n\"You know,\" Schnee said conversationally, examining Cinder with the clinical detachment one might show a particularly uninteresting bug, \"I always wondered what would have happened if we'd managed to stop you before the Fall. Before you killed that poor Amber woman and stole the rest of the Maiden's powers.\" Amber? How did this girl know about Amber? About the Maiden powers? It wasn't possible. This information was restricted to Salem's inner circle and Ozpin's most trusted lieutenants. Not a couple of teenagers\r\n\r\n\"Turns out,\" the blonde - Jaune- continued, \"Stopping you is pretty easy when we know exactly who you are and what you're planning.\" He raised his boot again, positioning it directly above Cinder's face, \"Much easier than trying to kill you after you've become a full Maiden.\"\r\n\r\n\"Though considerably less satisfying than watching you get frozen on top of a tower,\" Schnee added, her voice suddenly brittle with an emotion Cinder couldn't identify, \"But I suppose we'll have to settle for imprisonment and executon this time. Probably safer that way.\"\r\n\r\nCinder's mind reeled. Tower? Freeze? These students were speaking as if events that hadn't yet occurred were firmly in the past. As if they knew her plans, knew about Salem, knew everything. It wasn't possible. It made no sense.\r\n\r\nThe last thing Cinder Fall saw before consciousness left her was the blonde's boot descending toward her face, and the brief, satisfied smirk on Weiss Schnee's face as she said, \"This time, we're rewriting the story. And you don't get to be the winner anymore.\"\r\n\r\nThen everything went black.\r\n\r\n[line break]\r\n\r\nOzpin had lived through many things in his nigh-eternal war against Salem. He'd lived in a time where magic had been as common as the sky above, when the gods themselves walked the earth. A time of fairy tales and myth that had long since faded into legend. He had witnessed the rise and fall of civilizations, survived catastrophes that had reshaped the very world, and carried the crushing weight of mistakes that had cost countless lives.\r\n\r\nAnd yet, he had to admit, even he found himself surprised by the situation he was facing now. Him, Glynda, Qrow, and James. Men and women who had decades of experience and knowledge that would bring most people to their knees, and yet they all found themselves flat-footed.\r\n\r\nSitting in front of them was Weiss Schnee and Jaune Arc with a captured transfer student named Cinder Fall lying unconscious in front of his desk. Ms. Fall, who they claimed had been the one to attack Amber and put her in that critical state. The other members of Ms. Fall's team were there too, all unconscious with Aura dampening collars around their necks. He recognized one of the 'transfer students' as Neo Politan, Roman Torchwick's partner in crime, which led credence to the idea that they weren't just innocent transfer students.\r\n\r\n\"Let me see if I understand this correctly,\" Ozpin said, keeping his voice calm despite the storm of questions raging in his mind. He took a slow sip from his mug, using the familiar gesture to center himself, \"You're claiming that these Haven students are actually agents of Salem, sent to infiltrate the Vytal Festival and acquire the Fall Maiden's powers.\"\r\n\r\n\"Yes,\" Ms. Schnee replied, her posture perfect even after what must have been an exhausting confrontation, \"Cinder Fall is the one who attacked Amber. She has a Grimm parasite in her arm that she used to steal half of the Fall Maiden's power. You can check for yourself.\"\r\n\r\nJames stepped forward, his mechanical hand flexing instinctively, \"And you expect us to believe that you discovered this... how, exactly?\" Ozpin's first instinct was caution, and James' even moreso. And yet, these two knew FAR too much for it to be a bluff. They knew about his wretched 'immortality', the attack on Amber, Amber's location, and claimed that Leonardo was a traitor. Either they had the worst information leak he'd ever had in his immortal life or...\r\n\r\n\"Simple,\" Ms. Schnee said, her voice steady, \"We're from the future.\"\r\n\r\nQrow, who had been leaning against the wall, straightened up with a bark of laughter, \"Yeah, sure, and I'm the King of Atlas.\"\r\n\r\n\"You're Qrow Branwen,\" Mr. Arc said, his tone far more casual than his partner's, \"You turn into an actual crow. Not just a bird Faunus, an actual crow. Your Semblance turns luck to shit. Your sister Raven left you and your team to go back to a bandit tribe. You drink because you think your Semblance hurts everyone around you. Oh, and you're Ruby and Yang's uncle, but that's public knowledge.\"\r\n\r\n\"Enough,\" Ozpin raised a hand, cutting the young man off. His mind was racing. These students knew things they absolutely should not know. Things that were impossible for them to know unless...\r\n\r\n\"Time travel,\" Glynda said flatly, voicing the absurdity aloud, \"You can't possibly expect us to believe-\"\r\n\r\n\"I don't care if you believe it or not,\" Ms. Schnee interrupted, her ice-blue eyes unflinching. She met Glynda's gaze with the look of someone who refused to bow or bend, \"What matters is that we have information that can prevent thousands of deaths and the fall of Beacon Academy.\"\r\n\r\n\"If what you're saying is true,\" Ironwood said, his military mind clearly running through scenarios, \"Then you should be able to provide details that would be impossible for you to know otherwise.\"\r\n\r\n\"The vault beneath Beacon contains an Aura transfer machine,\" Ms. Schnee said without hesitation, \"It was designed to transfer the Maiden powers in an emergency situation. Amber is currently in a life support pod down there, breathing but unresponsive, with half her power stolen. And her time is running out.\"\r\n\r\nMr. Arc nodded, \"You've got the Relic of Choice hidden down there too. Behind a door that can only be opened by the Fall Maiden.\" He gestured to the cane in Ozpin's hand, \"That thing doesn't just help you walk. It's way more important than that. Thing's got enough juice to wreck Beacon.\" His grip on the cane tightened, \"We also know that every time you die, you reincarnate into someone closest to you in personality. And we know you hate it.\" Mr. Arc looked at him with a profound sense of pity.\r\n\r\nOzpin felt a chill run down his spine. The casual way these students - these children - spoke of his most closely guarded secrets was deeply unsettling. More unsettling still was the implication that somehow, in this future they claimed to come from, these secrets had become known, \"Leonardo,\" he said softly, \"You mentioned Leonardo Lionheart.\"\r\n\r\nMs. Schnee's expression darkened, \"He's working with Salem. Has been for some time. Fear got to him. He's been feeding her information about Huntsmen, about the Maidens, about your operations. Once the CCT went down in our timeline, he used it as a chance to decimate Anima's Huntsmen. The only reason Cinder and her cronies managed to file themselves as transfer students is because he forged their documentation. It's either he's a traitor or he's blisteringly incompetent. And we know for a fact that it's the former.\"\r\n\r\nQrow cursed under his breath. Ironwood's face hardened into a mask of cold fury. Glynda simply closed her eyes, the pain of betrayal evident in the tight line of her mouth, \"Leo wouldn't...\" Ozpin began, but the certainty in Ms. Schnee's eyes made the words die in his throat.\r\n\r\nThe notion - time travel - seemed preposterous...and then he remembered his own situation. An immortal soul forced to unwillingly steal bodies locked in an eternal war with the woman he once loved, \"I suppose you don't mind if we ask how exactly you two went back in time?\" Glynda asked, voice still laced with skepticism.\r\n\r\n\"We don't know.\" Ms. Schnee shrugged, somehow managing to make the gesture look elegant, \"We'd just finished signing the divorce papers when we were attacked by a nascent version of the Neo White Fang. Because even after saving the world, terrorists still exist.\" She rubbed her temples.\r\n\r\n\"Divorce? Do you mean you two were-\"\r\n\r\n\"We're not here to talk about that.\" Ms. Schnee's lips pursed.\r\n\r\n\"Yeah, what she said.\" Mr. Arc nodded\r\n\r\n\"Perhaps,\" Ozpin said carefully, \"We should hear them out.\"\r\n\r\n\"Oz, you can't seriously-\" Qrow started.\r\n\r\n\"I've seen enough impossible things in my lifetime to know better than to dismiss something simply because it seems implausible,\" Ozpin cut him off, then turned to James, \"James, I understand your skepticism, but I think we should at least listen to what they have to say.\"\r\n\r\nJames looked like he wanted to argue, but instead gave a curt nod, \"For now.\".\r\n\r\n\"Oh, thank the Brothers,\" Mr. Arc sighed, running a hand through his hair, \"Like, I get it, time travel sounds crazy, but after everything we've seen, is it really that much of a stretch?\"\r\n\r\nWeiss elbowed him sharply, \"Focus, Jaune.\"\r\n\r\n\"Right, sorry,\" he straightened up, \"Look, the point is, we can save Amber. We can stop Cinder, prevent the Fall of Beacon, save Pyrrha and Penny and all the others who died. We can change everything.\"\r\n\r\n\"The Aura transfer machine,\" Ms. Schnee said, her tone businesslike, \"It can be used to transfer the half of the Fall Maiden's power that Cinder stole back to its original owner. That would heal Amber and keep the Relic safe. And save a woman who's done nothing to deserve her horrid fate.\"\r\n\r\nOzpin steepled his fingers, studying the two students - if they could still be called that - before him. There was something in their eyes. A weariness. A hardness. The eyes of people who had seen war, who had lost too much. Not the eyes of first-year students at a combat academy.\r\n\r\n\"If what you're saying is true,\" he said slowly, \"Then we have much to discuss.\"\r\n\r\n\"You have no idea,\" Mr. Arc laughed humorlessly.\r\n\r\nMs. Schnee nodded, her expression grave, \"We've already dealt with Roman Torchwick and Adam Taurus, the latter permanently.\" She said that with the ease of an experienced Huntress, \"The White Fang operation in Mountain Glenn has been neutralized. That leaves Cinder's team,\" She gestured to the unconscious captives, \"And preparing for what comes next.\"\r\n\r\n\"And what, exactly, comes next?\" Glynda asked, her voice sharp.\r\n\r\nMs. Schnee and Mr. Arc exchanged a look - a look loaded with history and shared pain that Ozpin couldn't begin to decipher, \"That,\" Ms. Schnee said, turning back to face them, \"Is a much longer conversation.\"\r\n\r\nOzpin nodded, taking another sip from his mug as he contemplated the extraordinary tale unfolding before him. In all his many lifetimes, he had never encountered anything quite like this. Yet something in him - perhaps the countless years of experience, perhaps simple intuition - told him that these two were telling the truth. And if they were... if they truly had come back to prevent a catastrophe... then perhaps, for the first time in centuries, he dared to feel something dangerously close to hope.\r\n\r\nHe sat silently as Ms. Schnee and Mr. Arc continued their extraordinary briefing, his fingers steepled beneath his chin. The familiar weight of his cane rested against his desk, a constant reminder of the burden he carried - a burden that somehow felt both heavier and lighter with each revelation these unusual students shared. The clock mechanisms above his office ticked endlessly, marking the passage of time. Time that, according to these two, they had already lived through once before.\r\n\r\n\"There's something else we need to address,\" Ms. Schnee said, her tone crisp and businesslike. Her posture remained perfect despite the time they'd been speaking, not a single white hair out of place. So different from the somewhat prideful but (seemingly) spoiled and naive young woman he'd admitted to Beacon mere months ago, \"Raven Branwen is the Spring Maiden.\"\r\n\r\nThe room went still. Qrow pushed himself off the wall, his expression darkening. Ozpin observed the way his right hand instinctively twitched toward his flask before curling into a fist instead. Even after all these years, the mention of his sister still provoked such a visceral reaction, \"Bullshit,\" Qrow said flatly, his voice raspy with tension, \"The Spring Maiden's - \"\r\n\r\n\"Dead?\" Ms. Schnee arched a perfect eyebrow, cutting him off with practiced efficiency, \"Yes, she is. Because your sister murdered her about a decade ago and took her powers. She's been using those abilities to ravage the Anima countryside ever since. We can't leave that kind of power in her hands, both for practical and moral reasons.\"\r\n\r\nOzpin took a slow breath, absorbing this new information with the practiced calm of someone who had received world-shattering news countless times before. If it was true (and he was finding it increasingly difficult to doubt their claims), this represented a catastrophic failure for his information network. How had Raven managed to acquire such power without their knowledge? And worse, how had she concealed it for so long while apparently using it openly?\r\n\r\nGlynda stepped forward, her riding crop tapping against her palm in that unconscious gesture she made when processing difficult information. The slight furrow between her brows betrayed her concern far more than her controlled voice, \"What exactly are you suggesting?\"\r\n\r\n\"Simple enough,\" Mr. Arc shrugged, leaning back in his chair with a casualness that belied the gravity of his words. He slouched slightly, one arm draped over the back of his seat. Where Ms. Schnee was all precision and formality, he carried himself with the relaxed confidence of a veteran Huntsman who had seen too much to stand on ceremony, \"Either we catch or kill her.\"\r\n\r\nQrow's expression transformed, a complex mixture of emotions flashing across his weathered features. Anger, denial, and beneath it all, a flicker of pain that he couldn't quite mask. His shoulders tensed, and Ozpin noted the white-knuckled grip he now had on the edge of his cape. Not out of love for his sister, Ozpin knew - their relationship had fractured beyond repair years ago when he abandoned Taiyang and their daughter - but from that stubborn sense of familial loyalty that had always complicated the man's feelings toward his sister.\r\n\r\nHe'd witnessed this conflict play out in Qrow countless times over the years. The man despised what his sister had become, and yet could never quite bring himself to abandon the hope that somewhere inside the ruthless bandit leader remained the fierce, loyal teammate - the sister - he'd once known. It was a hope Ozpin understood all too well. After all, hadn't he spent millennia nurturing the same desperate belief about Salem? That some part of that adventuerous young woman remained under the hatred and corruption?\r\n\r\nMs. Schnee continued, either not noticing or deliberately ignoring Qrow's reaction, \"Her tribe of bandits moves around Anima, but tracking her with the SDC's resources shouldn't be impossible. That and finding strange weather patterns because Raven Branwen, for all her claims to intelligence, can't help but show off her stolen power.\" There was a coldness to her tone when she spoke of Raven. The dispassionate assessment of someone discussing a target rather than a person. James had used that same tone countless times.\r\n\r\n\"We'll need to plan this through,\" Mr. Arc said, sitting up straighter, his blue eyes suddenly sharp with tactical focus, \"Even if we glass her camp, she could use her Semblance to escape. So we need to put Yang, Taiyang, and Qrow into reinforced cells that can keep her contained. So if she tries to run, she'll just end up trapping herself. General Ironwood has facilities like that.\" He nodded toward James, who remained stone-faced, though Ozpin could see the slight tightening around his eyes that indicated he was already mentally reviewing available resources.\r\n\r\n\"We could use some additional help as well,\" Ms. Schned said, \"General Ironwood, is Marrow Amin already part of the Ace-Ops and unlocked his Semblance?\"\r\n\r\n\"Marrow Amin? No. He's a Specialist like Winter, but not part of the the Ace-Ops.\" The reminder of her sister made the young(?) woman's eyes soften marginally, \"But yes, he has unlocked his Semblance. Freeze, he calls it. It allows him to-\"\r\n\r\n\"Paralyze opponents, even entire groups. Yes, I've been on the receiving end of it.\" James' brows furrowed at that, which Ms. Schnee caught, \"We all made poor choices in our 'past', General. I'm hoping it won't come to that. Anyway, Marrow's Semblance will be very helpful if he helps us. We'll still need to put Yang, Taiyang, and Qrow in the cells, but perhaps with his Stay, we can keep her from escaping altogether. It would simplify things.\"\r\n\r\n\"After we beat her, we can either put her through the Aura transfer machine or kill her while putting the next host in front of her to force her on who to think about last,\" Mr. Arc finished.\r\n\r\nThe clinical detachment with which they discussed murder was chilling. These were children - at least in body - speaking of assassination with the easy pragmatism of hardened operatives. What horrors had they endured to reach this point? Ozpin felt a deep sadness well up inside him, another failure to add to his countless regrets. In their original timeline, he had clearly failed to protect these students from becoming as callous about life and death as he himself had been forced to become.\r\n\r\n\"That's my sister you're talking about,\" Qrow finally spoke up, his voice low and dangerous. His crimson eyes narrowed, a muscle working in his jaw as he fought to maintain his composure. Despite everything Raven had done, everything she had become, Ozpin could see that part of Qrow still held onto the memory of the fierce young woman who had once had his back in countless battles. Blood was thicker than water, after all.\r\n\r\nMs. Schnee fixed him with an unimpressed stare, her cold eyes unwavering, \"Your sister has spent the past two decades raiding and slaving her way across Anima. The blood on her hands numbers in the thousands. By any and all metrics, she's a mass murdering monster.\" Her voice was cold and sharp enough to cut, \"Are you really going to defend her?\"\r\n\r\nQrow winced, unable to muster a counterargument to what they all knew was true. His shoulders sagged slightly, and Ozpin watched as his hand finally moved to his flask, drawing it out with practiced ease. The gesture spoke volumes; this was a pain he couldn't face sober. Qrow took a long swig, his throat working as he swallowed, before tucking the flask away without meeting anyone's eyes. Ozpin couldn't judge him for it.\r\n\r\n\"The fact that you haven't dealt with Raven before this is fucked,\" Mr. Arc said bluntly, looking between Ozpin and Qrow with undisguised judgment in his gaze. The crude language seemed deliberately chosen to provoke, to cut through the careful diplomacy that typically characterized these meetings, \"You trained her to be a Huntress and she used those skills to murder innocent people. Settlements just like mine. Yeah, Salem was more important, but did you really not have the time at all? You had twent years. Was every second of that spent on Salem?\"\r\n\r\nEach word landed like a physical blow. Ozpin felt the truth of the accusation keenly. How many times had he chosen to focus exclusively on Salem, allowing other evils to flourish unchecked? How many Maidens had been lost, how many lives ruined, because he had convinced himself and others that there was only one threat truly worth addressing?\r\n\r\nMr. Arc shook his head, his expression hardening, \"Either way, we're going to fix this. Raven's going down, and if you don't want to help, fine, but this is happening either way.\"\r\n\r\nQrow's hands clenched and unclenched at his sides, his internal conflict written plainly across his face for anyone who knew how to read it. Loyalty to the mission warring with loyalty to blood. Principles against family ties. The rational knowledge of what Raven had become against the irrational hope of what she might still be. Ozpin had seen this battle play out in the man's eyes countless times before, but never with such raw intensity.\r\n\r\nOzpin considered their words carefully. He had always tried to believe the best of people, to offer second chances - a philosophy born from his own desperate need for redemption. But perhaps, in Raven's case, that philosophy had led to inaction where action was needed. How many innocents had suffered because he'd held out hope for a woman who had clearly chosen her path? How many times had he allowed sentiment to cloud judgment?\r\n\r\nThe heavy silence that followed was broken only by the eternal ticking of the clock gears turning above them, a mechanical heartbeat counting down the moments of yet another lifetime in his endless existence, \"What of Ms. Fall's team?\" Glynda asked at last, \"What should be done with them?\"\r\n\r\nJaune and Weiss shared a look - one of those loaded glances that spoke volumes about their shared history. Ozpin had seen such looks before, between partners who had fought back-to-back for years, between lovers who knew each other's thoughts without words, between people who had witnessed horrors together that no one else could understand. It was jarring to see such communication between students who, by all appearances, should barely know each other.\r\n\r\n\"You can either imprison or execute them,\" Ms. Schnee said matter-of-factly, as if discussing nothing more consequential than dining options, \"It doesn't really matter. They're all murderers who planned to commit genocide on Vale.\" Her voice softened slightly, a barely perceptible change that Ozpin might have missed if he hadn't been studying her so carefully, \"Emerald helped us once she found out Salem's plans to destroy Remnant, but then she left us in Vacuo, so neither of us feel too sympathetic. Given that we captured Cinder early, Emerald wouldn't have the catalyst to question her loyalty.\"\r\n\r\nThe clinical detachment in her voice was all to too familiar. These two spoke of life and death with the callousness of war veterans, not students. He'd seen it in dozens of Huntsmen across the generations.\r\n\r\nMs. Schnee and Mr. Arc stood up, brushing off their uniforms in a synchronized motion that spoke of years of familiarity. They moved in tandem, anticipating each other's movements with an ease that belied their apparent youth, \"We can talk about the rest tomorrow,\" Mr. Arc said, stifling a yawn, \"It's been a long day, capturing terrorists and all.\" The casual way he referenced their extraordinary accomplishments - as if subduing Salem's agents was nothing more remarkable than completing a homework assignment - only underscored how profoundly different these \"students\" were from their peers.\r\n\r\nOzpin set his empty mug down on his desk, the soft clink of ceramic against glass momentarily drawing everyone's attention. One question burned in his mind - had plagued him through countless lifetimes, through endless cycles of hope and despair, through the rise and fall of civilizations, \"Before you go,\" he said, unable to keep a slight tremor from his voice, \"I must ask: in your time, was Salem defeated?\"\r\n\r\nThe question hung in the air, pregnant with the weight of millennia of struggle, of countless sacrifices, of lives spent in what had often seemed a hopeless cause. Glynda and James went perfectly still, while Qrow's attention snapped fully to the two students, his personal turmoil temporarily forgotten in the face of this all-consuming question.\r\n\r\nThe two shared another of those meaningful looks before Ms. Schnee nodded, \"Yes,\" she said simply, the word falling like a stone into still water, \"She was. Sealed in stone forever with Ruby's Silver Eyes.\"\r\n\r\nThe atmosphere in the room shifted palpably. A mix of disbelief and, for the first time in centuries, genuine hope. Glynda's hand rose unconsciously to her mouth, emerald eyes widening behind her glasses. James stood straighter, his military bearing almost faltering in his shock, the fist of his mechanical hand opening and closing as if trying to physically grasp this new reality. Qrow's eyes widened, his perpetual cynicism momentarily giving way to wonder, the flask in his hand forgotten.\r\n\r\nOzpin felt something stir within him; something he had almost forgotten how to feel. Not the cautious, qualified hope that had sustained him through his many lives, but something deeper, more primal. The visceral relief of a drowning man breaking the surface, gulping air after an eternity underwater. The liberation of a prisoner seeing sunlight after decades in darkness. The end - an actual, achievable end - to his eternal punishment.\r\n\r\n\"The cost was still too much,\" Ms. Schnee continued, her voice softening with regret. A shadow passed across her young face, too deep and profound for someone her age, \"Millions dead and the people needing to pick up the pieces afterwards.\" She looked directly at Ozpin, and in that moment, he saw a reflection of his own ancient weariness in her too-young eyes, \"We're hoping to reach a happier ending this time.\"\r\n\r\nOzpin nodded, unable to find words adequate to respond to such a revelation. After thousands of years, countless lives, and immeasurable suffering, to hear that his eternal conflict with Salem could end - had ended, in some future timeline - was almost too much to comprehend. He had long since abandoned hope of living to see Salem's defeat. His goal had merely been to advance the cause incrementally, to leave the world marginally better prepared for each successive incarnation of himself.\r\n\r\nThe idea that he might actually witness the end of this ancient conflict, might live to see peace restored to a world long haunted by her shadow... it was overwhelming.\r\n\r\nAs the two students left his office, Ozpin turned to the window, gazing out at Beacon's grounds bathed in moonlight while Qrow and Glynda dealt with the team of spies. The school stood peaceful and intact, students sleeping safely in their beds, unaware of the dangers that had nearly befallen them. Dangers now potentially averted by the extraordinary intervention of two time travelers. Time travelers... the words almost made him laugh. Pure fantasy even to someone who'd seen and done things no man should have.\r\n\r\nFor the first time in more lifetimes than he could count, Ozpin allowed himself to genuinely believe that perhaps, this time, things might be different. That perhaps, the cycle of destruction and rebirth that had defined his existence might finally come to an end. And all it had taken was two bickering students with knowledge they shouldn't possess and an outlandish story about time travel.\r\n\r\nThe universe, it seemed, still had surprises even for someone who had lived as long as he had.\r\n\r\n[line break]\r\n\r\nDone. For people hoping for Emerald/Neo/Raven to be redeemed, you're going to be disappointed. Jaune and Weiss have no patience for mass murderers and psychopaths. Their job is to stop the deaths of their friends and innocent people, not play kid gloves with bad guys."
    },
    {
      "title": "Chapter 4",
      "text": "Chapter 4 of 5. Almost done. This one's more dramatic than previous chapters, but it's temporary. Just these two finishing up all the loose ends before everything is done.\r\n\r\n[line break]\r\n\r\nJaune'd seen a lot of weird shit in his life. Hell, just in the past few weeks he'd time traveled, captured international terrorists, and convinced a centuries-old wizard that he wasn't completely insane. But standing in the vault beneath Beacon Academy, watching a machine literally suck magical powers out of one unconscious woman and pump them into another, definitely ranked up there in the \"what the fuck is my life\" category.\r\n\r\nThe Aura transfer machine whirred and hummed, looking like something out of a mad scientist's laboratory crossed with Atlas military tech. Which, knowing Ozpin and Ironwood, was probably exactly what it was. Cinder lay unconscious in one containment pod, her face peaceful in a way that really pissed him off considering all the people she'd murdered. Or would murder. Time travel grammar was still giving him headaches.\r\n\r\nIn the other pod, Amber - the real Fall Maiden, the woman whose power Cinder had stolen - lay still as death. She'd been like that for months, from what they heard from the rest of the group. Seeing her now, pale and motionless behind the glass, brought back memories of when Weiss was impaled by Cinder's spear back in Haven. The rage that bubbled up in his chest was almost as strong as it'd been back then. Would've been back then. Fuck it, whatever.\r\n\r\n\"The transfer appears to be proceeding smoothly,\" Ozpin observed, his voice carrying that calm, measured tone that made it sound like they were discussing the weather instead of magical power redistribution. The old wizard - and Brothers, it was still weird thinking of his headmaster as an actual ancient wizard evena after all these years - stood with his hands folded over his cane, watching the process with clinical interest.\r\n\r\nIronwood nodded, his mechanical hand tapping against his arm in what Jaune learned was the General's version of nervous fidgeting, \"All readings are within acceptable parameters. The power transfer should be complete within minutes.\"\r\n\r\nJaune glanced sideways at Weiss, who stood beside him with perfect posture, hands clasped behind her back. Even in the weird blue-green light of the vault, she looked stunning. The way the light caught her white hair, making it almost glow... the way her fitted Atlas-style jacket hugged her curves just right... the delicate line of her neck as she tilted her head to watch the machine work...\r\n\r\n'Stop it, Arc,' he told himself firmly, 'You're divorced. Very, very divorced. Because she's crazy and accused Ruby of being a homewrecker. She literally called your dick disappointing in front of an entire combat class.'\r\n\r\nWhich was a complete lie, by the way. Weiss'd never complained about that particular aspect of their relationship. If anything, she'd been VERY enthusiastic about- 'Nope. Not going there.'\r\n\r\n\"How much longer?\" Qrow asked, taking a swig from his flask. The guy had been hitting the bottle harder than usual since their little chat about his sister yesterday. Not that Jaune could blame him. Finding out your sibling was about to be hunted down like the animal she was would drive anyone to hit the bottle.\r\n\r\n\"Not long now,\" Glynda replied, adjusting her glasses as she studied the readouts, \"The power transfer is nearly-\" The machine's humming stopped with a sharp click. For a moment, everything was silent except for the faint background noise of Beacon's ventilation systems and Qrow's nervous sipping.\r\n\r\nThen Amber's eyes snapped open.\r\n\r\nThey weren't the soft brown they looked like in the picture Ozpin showed them. Amber's eyes blazed with orange fire, literally flickering with flames that danced in her irises like tiny campfires. Her gaze swept the vault, taking in the gathered group, before landing on the containment pod where Cinder lay unconscious.\r\n\r\nAnd then she went absolutely fucking berserk.\r\n\r\nAmber's fist slammed into the reinforced glass door of her containment unit with a sound like a gunshot. The supposedly unbreakable barrier - the same stuff they used in Atlas military facilities, according to Ironwood - spider-webbed instantly. Her second punch shattered it completely, sending chunks of reinforced glass flying across the vault like bullets.\r\n\r\n\"Holy shit-\" Jaune started, but his words were cut off as Amber's bare foot connected with what remained of the door, sending the whole thing sailing directly toward their group, \"Look out!\" he shouted, tackling Weiss to the ground. They hit the metal floor hard, Jaune's body covering hers as the glass sailed over their heads and embedded itself in the wall behind them with a resounding crash.\r\n\r\nFor a split second, he was acutely aware of every point where their bodies touched. The softness of her curves beneath him, the way her hair smelled like winter roses and expensive shampoo, the way her breath hitched when he looked down at her-\r\n\r\n\"Get off me, you oaf!\" Weiss snapped, shoving at his chest. Right. Divorced. Very much divorced.\r\n\r\nJaune rolled to the side just in time to see Amber tear Cinder's containment pod open with her bare hands, the reinforced glass crumpling like tissue paper under her grip. The Fall Maiden's power blazed around her like a living being, orange flames dancing along her skin without burning her.\r\n\r\nCinder's eyes fluttered open just as Amber grabbed her by the throat and hauled her out of the pod, \"You,\" Amber snarled, her voice echoing with the power of the Maiden abilities she'd reclaimed, \"You fucking bitch. You shot me in the back. You stole my power. You put me in a goddamn coma for months.\"\r\n\r\nCinder tried to say something - probably some sarcastic quip or villain monologue - but Amber cut her off by slamming her into the floor hard enough to crack the metal. The sound of impact echoed through the vault like a gunshot.\r\n\r\n\"Oh dear,\" Ozpin murmured, sounding about as concerned as someone commenting on a light drizzle, \"Perhaps we should - \"\r\n\r\n\"MONTHS!\" Amber screamed, lifting Cinder up only to slam her down again, \"I MISSED MONTHS OF MY LIFE BECAUSE OF YOU!\"\r\n\r\nJaune looked around at the group. Ironwood and Glynda had taken cover behind some equipment, looking like they were debating whether to intervene. Qrow had his flask raised halfway to his lips, frozen in place as he watched the beatdown with wide eyes. Ozpin just stood there, occasionally wincing when Amber's impacts got particularly violent.\r\n\r\n\"Should we... do something?\" Glynda asked hesitantly, her riding crop raised but not actually moving to stop anything, \"Maybe we need Cinder alive for interrogation?\" she added, though she didn't sound particularly convinced.\r\n\r\nWeiss, who'd picked herself up and was brushing dust off her jacket with typical Schnee dignity (read: snobbery), snorted, \"Jaune and I already know everything Cinder does,\" she said coolly, not even flinching as Amber punched Cinder so hard the woman bounced off the floor, \"Let Amber have her revenge.\"\r\n\r\nAnd honestly? Jaune was totally on board with that plan. Watching Cinder get the shit kicked out of her was really therapeutic. This was the woman who had killed Pyrrha, who had orchestrated the Fall of Beacon, who had helped Salem destroy Atlas and murder millions of people. If anyone deserved to get their ass thoroughly kicked, it was her. Only Salem deserved worse, and she was made immortal by those two godly assholes.\r\n\r\n\"Rip and tear!\" Jaune called out helpfully, \"Wait, no, that's not right. Burn and... uh... sear?\"\r\n\r\nWeiss gave him a look that suggested she was reconsidering their divorce for entirely different reasons, \"You're an idiot.\"\r\n\r\n\"Hey, I'm trying to be supportive!\"\r\n\r\nAmber apparently heard him because she shot him a quick thumbs up before grabbing Cinder by the ankle and using her as a wrecking ball against the nearest wall. The satisfying crunch of impact was music to Jaune's ears, \"This is...\" Ironwood began, then trailed off as Amber lifted Cinder over her head and threw her across the vault, \"Well... I suppose justice comes in many forms.\"\r\n\r\n\"She's definitely got a fire in her. More ways than one,\" Qrow said, finally lowering his flask, \"Reminds me of Yang when someone messes with her hair.\"\r\n\r\n\"Speaking of Yang,\" Weiss said, absently tucking a strand of white hair behind her ear in a gesture that made Jaune's heart do stupid things in his chest, \"We should probably warn her that her mother is our next target. She might have... feelings about that.\"\r\n\r\nFocus, Arc. Very important conversation happening. Stop staring at your ex-wife's neck.\r\n\r\n\"Yeah, that's gonna be a fun conversation,\" Jaune said, forcing himself to look away from the elegant curve of Weiss's throat, \"Hey Yang, remember your mom who abandoned you? Well, turns out she's a magical terrorist and we're gonna capture or kill her. Hope that's cool.\"\r\n\r\n\"You have such a way with words,\" Weiss said dryly.\r\n\r\n\"Perhaps that conversation can wait until after Ms. Branwen has been captured? Knowing Ms. Xiao Long, she will insist on being present for the operation, which could complicate things.\"\r\n\r\n\"Hm...point.\" Jaune nodded.\r\n\r\nTheir talk was interrupted by a sound like a blowtorch firing up. They turned to see Amber standing over what remained of Cinder Fall; which was basically just a pile of ash and some slightly melted metal from her outfit. The Fall Maiden's hands were wreathed in flames, and she was breathing hard from exertion. Jaune felt a sudden burst of irritiation. He missed it!\r\n\r\nFor a moment, the vault was dead silent except for the crackling of dying flames.\r\n\r\nThen Amber turned to face them with a bright, friendly smile that was completely at odds with the fact that she'd just incinerated a person, \"Sorry about all that!\" she said cheerfully, dusting ash off her hands like she'd just finished gardening instead of committing a (very well deserved execution), \"Weird first impression, huh? I'm not usually that, you know, kill happy. I'm Amber, by the way. Fall Maiden. Thanks for getting my powers back!\"\r\n\r\nThe whiplash from her tone was incredible. One second she was channeling the Grimm Slayer, the next she sounded like she was introducing herself at a PTA meeting.\r\n\r\n\"Uh,\" Jaune said intelligently, \"You're... welcome?\"\r\n\r\n\"No problem at all, Ms. Amber,\" Ozpin said, apparently deciding to roll with it, \"You know us all already, of course, but these are two of our students, Weiss Schnee and Jaune Arc.\"\r\n\r\n\"Nice to meet you both!\" Amber said brightly, \"So, what's the plan? I assume we're going after the rest of Salem's people? Because I have some very strong feelings about that whole situation.\"\r\n\r\nJaune looked at the pile of ash that used to be one of Salem's most dangerous agents, then back at Amber's sunny smile, \"Yeah,\" he said slowly, \"I think you're gonna fit right in.\"\r\n\r\nWeiss made a small sound that might have been amusement, and when Jaune glanced at her, she was trying to hide a smile behind her hand. For just a moment, she looked like the girl he'd fallen in love with all those years ago - mischievous, sharp, brilliant and beautiful.\r\n\r\nThen she caught him looking and her expression went carefully neutral again, reminding him that whatever they'd had was in the past. In a timeline that might never happen now.\r\n\r\n'Right. Divorced. Focus on the mission, Arc.'\r\n\r\n[line break]\r\n\r\nWeiss sat in the passenger compartment of the Atlas military transport, her posture impeccable despite the turbulence as they flew toward the Anima wilderness. Through the reinforced windows, she could see the sprawling forests below, broken occasionally by cleared settlements or the scars of old Grimm attacks. Somewhere down there, Raven Branwen's bandit camp awaited - a collection of murderers and thieves led by a woman who had stolen power that was never meant to be hers.\r\n\r\nThe plan was sound. Weiss had spent considerable time ensuring every contingency was accounted for, drawing upon both her own tactical knowledge and the SDC's extensive intelligence network. The Atlesian military had provided satellite reconnaissance, and her own sources had confirmed the camp's location through careful observation of unusual weather patterns. Raven Branwen, for all her claims to cunning, had never learned subtlety when it came to displaying her stolen abilities.\r\n\r\nThe strategy was elegant in its simplicity and brutal in its efficiency. First, they would bombard the bandit camp with mortar fire, eliminating the bulk of Raven's followers before they could mount any meaningful resistance. Weiss felt no qualms about this particular aspect of the plan. These were not innocent civilians, but murderers and slavers who had chosen to follow a woman whose hands were stained with the blood of thousands. They had made their choice; now they would face the consequences.\r\n\r\nSecond, and most crucially, they had placed Taiyang Xiao Long, Qrow Branwen, and Yang Xiao Long in specially designed reinforced cells aboard their command ship. When Raven inevitably attempted to use her portal Semblance to escape - and she would, because beneath all her bluster and threats, she was fundamentally a coward - she would find herself trapped. The cells would then be flooded with a harmless sleeping gas, incapacitating all occupants without permanent harm.\r\n\r\nYang had been... less than pleased when they'd informed her of this necessity three days prior. Weiss could still recall the blonde fireband's expression shifting from confusion to anger to reluctant understanding as they'd explained the situation. Learning that one's absent mother was not merely a deadbeat parent but an active threat to innocent lives had clearly been difficult for her to process. Some part of her still hoped that her egg donor had a good reason for leaving.\r\n\r\n\"So let me get this straight,\" Yang had said, her lilac eyes flashing with suppressed emotion, \"My \"mom\" isn't just some selfish bitch who abandoned her family. She's a mass-murdering bandit queen with magical powers who needs to be stopped before she kills more people.\"\r\n\r\n\"That is... an accurate if simplified assessment,\" Weiss had replied carefully.\r\n\r\nYang had been silent for a long moment, her hands clenching and unclenching at her sides. Then she'd straightened, that familiar determined set to her jaw asserting itself, \"Fine. But I want answers when this is over. Real answers about why she left, what she's been doing, all of it.\"\r\n\r\nWeiss had assured her that they would capture Raven alive if possible, though she'd been careful not to promise anything beyond that. Some questions, she suspected, would never have satisfactory answers.\r\n\r\nThe alterations in team placements meant that Yang and Blake were no longer part of their immediate circle. The thought brought an unexpected pang of loneliness to Weiss's chest. In the original timeline, Team RWBY had become more than just teammates. They'd been sisters in all but blood, bound together by shared trials and genuine affection. Now, while she could interact with Yang and Blake as friends, it wasn't quite the same. There was a distance there, a formality that hadn't existed when they'd shared a dorm room and countless late-night conversations.\r\n\r\nBut that could be remedied later, she told herself firmly. With Adam Taurus dead and Raven soon to be stripped of her stolen power, many of the fundamental obstacles to rebuilding those relationships would be removed. Blake would no longer carry the burden of her association with the White Fang's violence, and Yang would be free from the shadow of maternal abandonment that had shaped so much of her personality.\r\n\r\nThe third element of their strategy provided additional reassurance. They had secured backup in the form of Marrow Amin, who while not yet a Specialist, possessed a fully realized Semblance that would prove critical to their success. His ability to freeze targets in place would be invaluable in preventing Raven from escaping through conventional means before she could activate her portal Semblance. The young man's enthusiasm for the mission had been almost infectious, his tail literally wagging with excitement, though Weiss suspected it had more to do with the opportunity being given by General Ironwood himself than any personal vendetta against Raven Branwen.\r\n\r\nMore significantly, Amber had agreed to aid them in the operation. The Fall Maiden's motivations were twofold: gratitude for the restoration of her stolen power, and a genuine understanding that someone like Raven Branwen had no right to wield abilities meant to protect and preserve life. Amber's presence would ensure that even if Raven managed to access her Maiden powers during the confrontation, they would not be fighting at a disadvantage.\r\n\r\nWeiss' only source of annoyance in an otherwise perfectly orchestrated operation was Amber's behavior toward Jaune. She understood, intellectually, that the woman would naturally feel grateful toward the people who had saved her life and restored her stolen power. Gratitude was a reasonable and expected response to such circumstances.\r\n\r\nWhat was less reasonable (and frankly unprofessional) was the way Amber had taken to obviously, though admittedly subtly, flirting with him. The lingering touches when passing him equipment. The way she laughed just a little too enthusiastically at his admittedly mediocre attempts at humor. The manner in which she found excuses to seek his opinion on tactical matters, despite the fact that strategy had never been his strong suit (despite Pyrrha's claims otherwise).\r\n\r\nIt was tiresome, really. And concerning, though not for the reasons one might assume. Weiss's objections were purely practical in nature. She simply disliked the idea of Jaune taking advantage of Amber's gratitude and vulnerability, only to inevitably betray that trust later when his attention wandered to someone else. It was a pattern she had observed firsthand, after all. Despite her role, Amber was only 19. Still too young to have her heart broken.\r\n\r\nThe thought of another woman falling victim to Jaune's particular brand of oblivious charm, only to discover too late that his loyalty was as fleeting as morning frost, was genuinely troubling. Amber deserved better than to become another casualty of Jaune Arc's inability to maintain meaningful relationships.\r\n\r\nYes, that was precisely why the situation bothered her. Concern for Amber's wellbeing, nothing more. Certainly not jealousy - such an emotion would be both irrational and beneath her dignity. She was simply being practical, looking out for someone who had already suffered enough at the hands of people who had taken advantage of her trust.\r\n\r\nThe fact that watching Amber smile at Jaune made something twist unpleasantly in her chest was merely a coincidence. Stress from the upcoming operation, nothing more. Weiss straightened in her seat, smoothing invisible wrinkles from her combat attire as she forced her attention back to the mission parameters. There would be time for such considerations later. For now, she had a mass murderer to capture and Maiden powers to confiscate.\r\n\r\nEverything else could wait.\r\n\r\n[line break]\r\n\r\nThe bandit camp sprawled across a clearing in the Anima wilderness like a festering wound, crude tents and ramshackle structures arranged in haphazard clusters around a central fire pit. Weiss observed it through her binoculars from their concealed position on the ridge above, cataloging defensive positions and escape routes with the methodical precision her father had drilled into her during SDC security briefings. Not that he'd ever intended for her to use such knowledge in actual combat, but life had a way of making even the most distasteful lessons useful.\r\n\r\nThe plan was proceeding flawlessly. Winter would be simultaneously capturing Leonardo Lionheart and securing Haven's CCT tower to prevent Arthur Watts from interfering - assuming the traitorous headmaster hadn't already compromised their communications. Her sister had taken a carefully selected team of Atlesian Specialists for that operation, leaving Weiss to handle the more direct approach with their assembled strike force.\r\n\r\nBeside her, Jaune adjusted his armor straps with practiced efficiency, the familiar ritual of pre-combat preparation that she'd witnessed countless times during their marriage. To his left, Amber stretched her arms above her head, orange flames dancing along her fingertips in anticipation. Marrow crouched nearby, his tactical vest loaded with Dust cartridges and specialized restraint equipment, while the three Valean Huntsmen they'd recruited completed their own final checks.\r\n\r\nThey hadn't risked involving any Mistrali Huntsmen; too much chance that Lionheart would be tipped off to their activities. Better to work with known quantities than risk their carefully laid plans being compromised by a network riddled with Salem's influence.\r\n\r\n\"Remember,\" Weiss said quietly, her voice carrying just far enough to reach their assembled team, \"we need Raven alive. Everything else is secondary.\" They all nodded.\r\n\r\nIt was time.\r\n\r\nThe attack began with surgical precision. Weiss had orchestrated similar operations during her time as co-CEO before Beacon, coordinating SDC security forces against Grimm incursions and bandit raids that threatened company assets. This was merely a larger scale version of those exercises, with considerably higher stakes and a more personal investment in the outcome.\r\n\r\nThe mortar barrage struck the camp's perimeter first, Atlas-manufactured shells detonating in precise patterns that eliminated sentries and created chaos among the ranks of common bandits. Screams echoed across the clearing as crude fortifications were reduced to splinters and burning debris. The sight of the bandits screaming and burning brought a grim smile across her face. It was justice long overdue for the crimes they'd committed.\r\n\r\nAs the bombardment ceased, their strike team descended into the chaos with lethal efficiency.\r\n\r\nThe fight that followed was nothing short of a slaughter.\r\n\r\nSurprise, surprise. Bullying thugs and murderers who spent their lives sacking defenseless towns while calling themselves strong stood absolutely no chance against experienced Huntsmen and a Maiden. Weiss cut through the bandit rabble like a heated blade through butter, her rapier finding gaps in improvised armor with surgical precision. Sometimes the comparison was literal, as her fire Dust cartridges left cauterized wounds in their wake, leaving the cooling bodies look oddly bloodless despite their grievous wounds.\r\n\r\nShe had to admit (though the acknowledgment left a bitter taste in her mouth) that she and Jaune worked together in perfect tandem. As... difficult as their relationship had become, years of training and partnership didn't simply evaporate. What weakness one possessed, the other instinctively covered. Where her rapier work excelled at precision strikes and crowd control, his shield and sword provided the raw stopping power needed to break enemy formations. It was a disgustingly efficient pairing, honed through countless missions and sparring sessions during their time as husband and wife.\r\n\r\nWatching him flow seamlessly from defensive positioning to aggressive assault, she was reminded why they'd been so effective as partners before their personal relationship had complicated everything. His combat instincts remained as sharp as ever, reading the battlefield with the same intuitive understanding that had once made their teamwork legendary among their peers.\r\n\r\nShe particularly enjoyed taking down that bitch - ahem, vagabond - Vernal.\r\n\r\nIn the original timeline, Weiss had been obsessed with her newly summoning ability during their encounter, repeatedly calling forth incomplete manifestations while leaving herself vulnerable to counterattack. It had been a rookie mistake born of excitement over her expanded capabilities, and Vernal had capitalized on it ruthlessly. She, the heiress to the Schnee dynasty, had been brought low by a common bandit due to her eagerness play summoner.\r\n\r\nNot this time.\r\n\r\nAs the tan woman charged forward with her twin chakrams spinning, Weiss activated her time dilation glyph with perfect timing. The world around her slowed to a crawl, Vernal's aggressive advance becoming a ponderous ballet of telegraphed movements. Weiss sidestepped the clumsy assault with contemptuous ease before she started a barrage of attacks, attacking her easily over a dozen times before the wretch could even react. She finished it off by using a glyph to propel herself downward from the air and slashing Vernal with enough force to leave a crater, which shattered her Aura.\r\n\r\n\"Eat it, Jaune,\" she murmured with satisfaction, remembering his smug commentary about her \"showboating\" during combat practice.\r\n\r\nThe glorified thug lay heaving on the ground, alive but thoroughly incapacitated. She would probably regret that mercy - Mistrali prisons were notably harsh in their treatment of bandits.\r\n\r\nThe regular bandits fell with pathetic ease, their crude weapons and lack of formal training making them little more than obstacles to be cleared. Amber moved through their ranks like an avatar of destruction, her restored Maiden powers manifesting as torrents of flame that reduced entire groups to ash. The Valean Huntsmen provided excellent support, their professional competence a stark contrast to the amateur thuggery they faced.\r\n\r\nMarrow's contribution proved particularly valuable. His \"Stay\" Semblance locked down enemy movement at crucial moments, allowing the rest of the team to capitalize on openings that would have otherwise required significantly more effort to create. Jaune's Aura amplification had enhanced the young Faunus' range considerably, extending his area of effect to cover multiple targets simultaneously.\r\n\r\nThen Raven Branwen herself finally made her appearance.\r\n\r\nShe descended from above like an angry goddess, her black hair whipping in the wind generated by her own Maiden powers. Lightning crackled around her form as she hovered twenty feet above the battlefield, red eyes blazing with supernatural fire. For a moment, she was genuinely imposing - a figure of terrible beauty wielding forces that could reshape the landscape.\r\n\r\n\"You dare attack my people?\" she snarled, her voice carrying across the clearing with unnatural amplification.\r\n\r\nTaking her down was almost disappointingly simple.\r\n\r\n\"Marrow, now!\" Weiss shouted.\r\n\r\nThe young Huntsman stepped forward, his enhanced Aura flaring as Jaune's amplification took effect, \"Stay!\" he shouted, snapping his fingers and pointing at Raven.\r\n\r\nRaven froze mid-gesture, her body locking in place as if she'd been transformed into a statue. The expression of shock on her face was almost comical - clearly, she hadn't expected to encounter a Semblance capable of affecting someone of her power level. Raven Branwen - the Spring Maiden, the Terror of Anima, the killer of thousands - fell like a stone and faceplanted into the blood-soaked dirt.\r\n\r\n\"I can only hold her for a few seconds!\" Marrow called out, strain evident in his voice despite the amplification.\r\n\r\nWeiss immediately summoned three Arma Gigas knights, their spectral forms materializing around Raven's paralyzed figure with car-sized swords raised. The massive blades descended in perfect synchronization, hammering into the bandit queen with enough force to crater the ground beneath her when she finally fell. Then they lifted up and slammed down again, and again, and again. Maidens had high Aura reserves. She could take it.\r\n\r\nAmber followed up with a fireball the size of a small building, the massive sphere of concentrated flame engulfing Raven's position entirely. The heat was so intense that Weiss felt her summoned knights beginning to waver. Only her doubled Aura reserves allowed her to maintain their cohesion against such overwhelming force.\r\n\r\nMeanwhile, Jaune continued mopping up the remaining bandits while keeping Marrow protected from potential counterattacks. His shield work was flawless, deflecting desperate strikes from the few enemies still capable of fighting while his sword found their weak points with mechanical precision.\r\n\r\nRaven didn't even get the chance to attempt her portal escape - as satisfying as seeing her trapped in one of their prepared cells might have been. By the time Marrow's Semblance wore off and she regained mobility, her Aura had been completely depleted by their concentrated assault. She lay on the ground in a crumpled heap, smoke rising from her singed clothing and various cuts bleeding freely from where the Arma Gigas had found their mark. Dotted across her body were burns of various degrees.\r\n\r\nWeiss approached the fallen woman with her rapier still drawn, noting the way Raven's chest rose and fell in irregular gasps. Alive, as required, but thoroughly defeated. The Spring Maiden's red eyes tracked Weiss's movement with unmistakable hatred, though she lacked the strength to do anything about it.\r\n\r\n\"Quite the fall from grace,\" Weiss observed, her voice carrying the same cool disdain she'd once reserved for particularly incompetent board members, \"From Huntress to bandit queen to prisoner. Really, the trajectory of your life has been thoroughly predictable.\"\r\n\r\nRaven tried to speak - probably some defiant threat or declaration about her tribe's resilience - but only managed a pained wheeze. The combination of physical trauma and Aura depletion had left her barely conscious.\r\n\r\n\"Sedatives,\" Weiss called to their medical specialist, one of the Valean Huntsmen who'd proven remarkably competent throughout the operation, \"Full dose. We can't risk her regaining enough strength to activate her Semblance.\"\r\n\r\nThe injection took effect within moments, Raven's already glazed eyes sliding shut as the powerful tranquilizers flooded her system. They would keep her unconscious during transport and the subsequent power transfer procedure. No sense in allowing her any opportunity to cause further complications.\r\n\r\nWeiss surveyed the aftermath of their operation with professional satisfaction. The bandit camp was thoroughly destroyed, its crude structures reduced to burning debris and scattered corpses. The few survivors - perhaps a dozen bandits who had surrendered rather than fight to the death - were secured with Atlesian restraints and would be transported back to face justice for their crimes. Which in Anima, likely meant harsh labor till their bodies broke.\r\n\r\nA \"tribe\" of murderers erased from existence, and the Spring Maiden captured for proper disposition of her stolen power. The operation had taken less than an hour from initial assault to final cleanup.\r\n\r\nNot a bad day's work, she reflected with grim satisfaction.\r\n\r\n\"Extraction point is secure,\" one of the Valean Huntsmen reported, his voice crackling through their communication system, \"Transport is inbound for prisoner transfer.\"\r\n\r\nWeiss nodded, watching as Amber knelt beside Raven's unconscious form with an expression of mixed satisfaction and disgust. The Fall Maiden had been remarkably professional throughout the operation, channeling her obvious distaste for power theft into tactical effectiveness rather than emotional outbursts, \"She's...different than I expected,\" Amber said quietly, studying the Raven with curious eyes, \"For someone who's caused so much suffering, she seems almost... ordinary.\"\r\n\r\n\"Monsters usually do,\" Jaune replied, approaching their group while wiping blood from his sword, \"The scary ones are always the ones who look normal until they don't.\"\r\n\r\nWeiss found herself nodding in agreement, remembering how Cinder had appeared to most of the world - a beautiful, charming young woman. Up until Ruby's Silver Eyes ensured that her looks matched her inner monstrosity.\r\n\r\nPerhaps that was why she felt such satisfaction at seeing Raven reduced to this pathetic state. Another monster brought low, another threat neutralized before it could cause further harm. The world was marginally safer with the Spring Maiden's power about to be properly redistributed, just as it had been marginally safer when Cinder Fall was burn to ash.\r\n\r\nJustice, she had learned, was rarely as dramatic as the stories suggested. Most of the time, it was simply a matter of applying the right pressure in the right place until something that needed to break finally did.\r\n\r\nToday, that something had been the Branwen tribe's reign of terror across Anima. Tomorrow, it would be something else.\r\n\r\n[line break]\r\n\r\nThe familiar confines of Ozpin's office felt smaller somehow with the weight of their recent success pressing down upon them. Weiss sat with practiced poise in one of the chairs arranged before the headmaster's desk, her hands folded precisely in her lap as she observed the assembled group. The ornate clockwork mechanisms above continued their eternal dance, marking time with mechanical precision that she found oddly comforting after the chaos of combat.\r\n\r\nQrow slouched against the far wall, his flask conspicuously absent for once though his sullen expression suggested he was seriously reconsidering that decision. The capture of his sister had affected him more deeply than he cared to admit. Weiss could see it in the rigid set of his shoulders, the way his eyes refused to meet anyone else's gaze directly. Guilt, she suspected, mixed with relief and no small amount of self-loathing. Familial loyalty was an illogical thing, she knew that from experience.\r\n\r\nGeneral Ironwood stood at attention beside Glynda, his mechanical hand resting against his hip in a gesture that spoke of barely contained nervous energy. The successful operation had validated their tactical approach, but Weiss knew the man well enough to recognize that he was already calculating the next dozen moves in this increasingly complex game.\r\n\r\n\"There is, of course, the matter of who should inherit the Spring Maiden's power,\" Ozpin said, his fingers steepled beneath his chin as he regarded them with those ancient, knowing eyes, \"I have compiled a preliminary list of possible candidates, including Ms. Nikos. Her strength of character is exemplary, and her combat skills would serve her well in such a role.\"\r\n\r\nThe temperature in the room seemed to drop several degrees as Weiss felt her expression harden into the mask of polite menace she'd perfected during board meetings with particularly obstinate shareholders, \"Professor Ozpin,\" she said, her voice carrying the crystalline edge that had once reduced grown businessmen to stammering apologies, \"If you so much as hint at the existence of the Maidens to Pyrrha, I will make you regret it in ways that your considerable experience has not yet prepared you for.\"\r\n\r\n\"What she said,\" Jaune added from his position beside her, his casual tone belying the steel in his blue eyes, \"Pyrrha deserves better than being turned into a magical weapon because you think she'd make a good martyr.\"\r\n\r\nOzpin raised an eyebrow, his expression shifting to one of mild interest rather than intimidation. After countless lifetimes of facing down gods, monsters, and immortal sorceresses, a pair of time-traveling students - however formidable - apparently weren't enough to rattle him. Still, he hummed thoughtfully and inclined his head in apparent acquiescence.\r\n\r\n\"Very well. Then whom would you suggest for this responsibility?\" His tone was skeptical yet curious.\r\n\r\nWeiss straightened slightly, feeling the familiar surge of confidence that came with presenting a well-reasoned argument, \"I'm the optimal choice,\" she said matter-of-factly, her tone carrying the same certainty she'd once used to announce quarterly profit projections to the SDC board.\r\n\r\nThe logic was unassailable, really. She possessed the combat training, the strategic acumen, and most importantly, the knowledge of what was truly at stake in the battles to come. More than that, she'd already been positioned for exactly this role ever since she woke up in her old childhood bedroom two years ago.\r\n\r\n\"I'll be by Ruby's side when she finally faces Salem in this timeline,\" Weiss said, her voice taking on the measured cadence of a prepared presentation, \"Winter trained me extensively to inherit the Winter Maiden's power should she ever perish in our original timeline.\" Something that thankfully never came to pass. Winter was still alive when she'd turned 30, \"The principles remain the same regardless of which specific Maiden abilities are involved.\"\r\n\r\nShe could see Jaune preparing to interject - probably some snarky comment about her (justified) self-confidence - and felt her jaw clench in anticipation of another pointless argument.\r\n\r\n\"Of course you'd nominate yourself,\" he said, right on schedule. Weiss was already drawing breath for a cutting retort when he continued, completely derailing her planned response, \"But you're right. You're the best choice we have.\"\r\n\r\nThe admission caught her so completely off-guard that she actually blinked, her carefully constructed arguments dissolving into surprised silence. Jaune agreeing with her? Publicly supporting her candidacy without being coerced or manipulated into it? The world truly had been turned upside down by their temporal displacement.\r\n\r\nThe surprise must have shown on her face because Jaune's expression softened slightly, taking on that earnest quality that had once made her heart skip a beat before their relationship had soured into constant conflict, \"Who else do we realistically have?\" he said, gesturing toward the assembled group with one hand, \"Glynda would be perfect - her telekinesis is probably stronger than Maiden magic, let's be real - but Ozpin made that weird rule about needing to be younger than thirty to inherit the powers.\"\r\n\r\n\"I was experiencing a prolonged period of depression and poor decision-making,\" Ozpin cut in with what might have been mild embarrassment, \"You try maintaining rational thought processes while fighting an immortal ex-lover who wishes to destroy the world.\"\r\n\r\n\"You know what? Fair.\" Jaune nodded, \"But the rule stands, right? So that means most of the experienced Huntresses are out.\"\r\n\r\nIronwood stepped forward, his expression resolute, \"I would like to nominate Specialist Schnee,\" he said formally, \"Winter has proven herself repeatedly in both combat and leadership roles. Her tactical expertise and moral character make her an excellent candidate.\"\r\n\r\nWeiss felt a flicker of warmth at the General's confidence in her sister, but she shook her head firmly, \"You've already positioned Winter as Fria's successor for the Winter Maiden powers,\" she said, \"Besides, as much as I adore my sister, the person who wields this particular magic should be someone who knows the exact stakes we're facing. Someone who understands precisely what Salem is capable of and what methods will be required to stop her.\"\r\n\r\nThe unspoken implication hung in the air: that only she and Jaune possessed the comprehensive knowledge necessary to make the hard choices that lay ahead. Winter was many things: brilliant, capable, and utterly dedicated to doing what was right. But she hadn't lived through the apocalypse they were trying to prevent. She hadn't seen Atlas fall, hadn't watched millions die, hadn't been forced to make the soul-crushing decisions that would undoubtedly be required again before this was over.\r\n\r\n\"Ruby cannot be considered for this role,\" Weiss continued, addressing what she suspected was Ozpin's unspoken preference, \"She needs to focus entirely on developing her Silver Eyes' abilities. Asking her to divide her attention between that and Maiden powers would be a recipe for disaster; she'd be spread too thin to excel at either. My role in this timeline is to support her, to ensure she has the space and protection necessary to become the weapon Salem fears most.\"\r\n\r\nThere was something deeply satisfying about having her purpose so clearly defined. In her original past/future, she'd often felt like she was flailing, trying to be useful in a conflict that seemed to revolve around powers and destinies beyond her understanding while utterly failing at it. This time, she knew exactly where she fit in the grand design.\r\n\r\nRuby would be the Silver-Eyed Warrior who could finally end Salem's reign of terror. Weiss would be the Maiden who ensured Ruby survived long enough to fulfill that destiny. It was elegant in its simplicity, and it played to both of their strengths.\r\n\r\nThe office fell silent except for the rhythmic ticking of Ozpin's elaborate timepieces. Glynda adjusted her glasses thoughtfully. Ironwood's mechanical hand tapped against his leg in a rapid staccato that suggested intensive calculation. Qrow continued to study the floor as if it held the secrets of the universe.\r\n\r\nFinally, Ozpin sighed - a sound that carried the weight of centuries and countless difficult decisions.\r\n\r\n\"Perhaps you're both correct,\" he conceded, his voice heavy with resignation and what might have been relief at having the choice made for him, \"Very well. Ms. Branwen will be prepared for the Aura transfer machine immediately. Let us proceed quickly, before she has any opportunity to escape or complicate matters further.\"\r\n\r\nWeiss felt a surge of satisfaction that she was careful not to let show on her face. The Spring Maiden's power would soon be hers to wield, another tool in their arsenal against Salem's forces. More than that, it represented a form of justice - power stolen through murder and used for decades of terrorizing innocent people would finally be turned toward its proper purpose.\r\n\r\n\"Excellent,\" she said, \"I assume the transfer procedure will be similar to what we used with Cinder and Amber?\"\r\n\r\n\"Identical,\" Ozpin replied, \"Ms. Branwen will be placed in the Aura transfer machine. Let us proceed quickly, before she has any chance to regain consciousness and attempt an escape.\"\r\n\r\nAs they began to file out of the office toward the vault levels, Weiss caught Jaune's eye. For a moment, something passed between them - not the bitter animosity that had characterized most of their recent interactions, but a flicker of the partnership that had once made them so effective together. They were going to save the world this time. All of it. And if that meant she had to become something more than human to do it, then so be it.\r\n\r\nAfter all, Weiss had never been one to shy away from accepting the responsibilities that others feared to bear.\r\n\r\n[line break]\r\n\r\nDays later, things had settled into something resembling normalcy. Or at least, as normal as life could be when one was a time-traveling student who happened to also be a Maiden with the memories of fighting an immortal witch. Salem was still out there, naturally, but with her primary pawns neutralized, Ozpin predicted she would retreat to reassess and rebuild her forces. It was one of her fundamental weaknesses, he'd explained. Open warfare would unite humanity against her, which was precisely why she preferred to work through proxies from the shadows.\r\n\r\nThey might have years before she made her next move. Which meant, somewhat surreally, going back to being students.\r\n\r\nThe transition felt bizarre. Yes, they were still making plans - Maria Calavera was already being sought out for Ruby's Silver Eyes training, and various other preparations continued in the background - but for the first time since their return to the past, they actually had breathing room. Time to attend classes, complete assignments, and pretend to be normal teenagers instead of battle-hardened veterans of an apocalyptic war.\r\n\r\nRaven Branwen remained imprisoned in the vault beneath Beacon, stripped of her stolen power and awaiting whatever justice Ozpin's council would ultimately decide upon. Yang had visited her along with Taiyang and Qrow, a conversation that Weiss knew better than to ask about. When Yang had emerged from that meeting, she'd been both furious and relieved in equal measure, thanking Weiss and Jaune in a way that was both strained and sincere before making it clear the subject was closed.\r\n\r\nWeiss respected that boundary. Some family conversations were too painful to share, even with friends.\r\n\r\nOh, and she was the Spring Maiden now. Such an odd thing to think about, even weeks after the power transfer. She could feel the magic humming beneath her skin like a second heartbeat, responding to her emotions and occasionally manifesting in small ways - frost patterns on her water glass when she was annoyed, or wind flowing gently in time with her footsteps when she was particularly pleased about something.\r\n\r\nThere were some side-effects, of course. Unlike with Amber and Cinder, she wasn't reclaiming a power that had been stolen from her. At times she saw flashes of Raven's memories. Not enough to be crippling or mistaken for her own, however. It was like...watching a movie, seeing her raids and monstrous actions but without the emotions behind them. An inconvenience at worst. She was already learning to bock them out.\r\n\r\nAmber, who had been officially appointed as Professor Goodwitch's teaching assistant (a convenient cover for her continued presence at Beacon), had taken over Weiss' Maiden training. While she wasn't a fully realized Maiden like Fria had been, she still possessed considerably more experience with the powers than Weiss did. The sessions were productive, if occasionally frustrating when Weiss' perfectionist tendencies clashed with the inherently intuitive nature of Maiden magic. Maiden powers primarily came from emotion and instinct.\r\n\r\nShe genuinely liked Amber. For someone who woke up from a traumatic coma not too long ago, the Fall Maiden was surprisingly cheerful and friendly, approaching both her teaching duties and her recovery with admirable resilience. Her optimistic outlook was refreshing after months of dealing with apocalyptic scenarios and morally gray decisions.\r\n\r\nThe only thing Weiss didn't like was that Amber was still flirting with Jaune.\r\n\r\nAgain, it wasn't out of jealousy. Weiss Schnee did not engage in such petty emotions over her ex-husband. It was simply a matter of professional concern. Jaune was clearly exploiting Amber's gratitude for saving her life, taking advantage of her emotional vulnerability in a way that was both manipulative and potentially damaging to their operational security.\r\n\r\nThe man had a pattern, after all. He'd pursued Weiss relentlessly during their Beacon days despite her repeated rejections, then moved on to Pyrrha's obvious affections, and now apparently saw Amber as his next conquest. It was frankly disgusting how quickly he'd moved on from their divorce.\r\n\r\nShe ignored the voice at the back of her head telling her that it'd been over two years since they were sent back in time.\r\n\r\nHer patience finally reached its breaking point during one of her training sessions with Amber in the designated private room. Weiss had been practicing weather manipulation - trying to create localized snow flurries without accidentally freezing the entire area - when Jaune had come over to observe. This had become an annoying habit of his recently, claiming he wanted to \"understand how Maiden powers worked\" but clearly just using it as an excuse to spend time near Amber.\r\n\r\n\"You're getting much better at the fine control,\" Amber said encouragingly, watching as Weiss managed to create a small blizzard contained within a ten-foot radius, \"The key is not to fight the magic, but to guide it. Think of it like conducting an orchestra instead of wrestling a Beowolf.\"\r\n\r\n\"An apt metaphor,\" Weiss replied, allowing the snow to dissipate with a gesture, \"Though I suspect my father would appreciate the wrestling comparison more. He always did prefer direct confrontation to subtle manipulation.\" Jacques Schnee was an admittedly brilliant schemer in his younger years, but with power came complacency. He'd gotten used to being the biggest fish in the pond and preferred to use the Schnee name as a bludgeon once he attained his position; something even his own family could attest to quite well. He thought himself above consequences.\r\n\r\nIt was what made outmaneuvering him doubly satisfying.\r\n\r\nAmber laughed, a genuine, bright sound that Weiss might have found endearing if it hadn't been followed by the woman's gaze drifting toward Jaune with obvious interest, \"Speaking of... um...\" Amber began, a bashful expression crossing her features as she fidgeted with the hem of her blouse, \"The Beacon dance is coming up soon, isn't it? The formal one?\"Weiss felt her stomach drop like a stone. She knew exactly where this conversation was heading, and every fiber of her being rebelled against allowing it to continue, \"Jaune, I was wondering if-\"\r\n\r\n\"Jaune and I are going together,\" Weiss cut in smoothly, her voice carrying the absolute certainty she'd once used to shut down unwanted suitors at Atlas social functions. And she had a LOT of would-be prince charmings to practice on.\r\n\r\nJaune's head snapped toward her, blue eyes wide with confusion, \"We are?\"\r\n\r\nWeiss turned to face him with a smile that was all teeth and no warmth, \"Of course we are, darling,\" she said, putting just enough emphasis on the endearment to make it sound both intimate and slightly threatening. Her expression was sharp enough to cut glass.\r\n\r\nAmber blinked, her expression shifting from hopeful to disappointed to resignedly understanding in the span of a few seconds, \"Oh! I didn't know you two were... I mean, you always seemed so...\" She gestured vaguely, clearly struggling to reconcile their constant bickering with romantic involvement.\r\n\r\n\"Passionate,\" Weiss said, still smiling, \"We're very passionate people.\"\r\n\r\n\"Right,\" Amber said slowly, though she was already recovering with impressive grace, \"Well, that's wonderful! I hope you both have a lovely time.\" She gathered her training materials with practiced efficiency, offering them both a genuinely warm smile that made Weiss feel like an absolute monster for her deception, \"I should go prepare for my afternoon classes. Weiss, remember to practice the storm summoning we discussed. Start small - just a light rain - and work your way up.\"\r\n\r\nAs soon as Amber was out of earshot, Jaune rounded on Weiss with an expression of complete bewilderment, \"What the hell was that about?\" he demanded, crossing his arms over his chest, \"Since when are we going to the dance together?\"\r\n\r\nWeiss pursed her lips, feeling defensive under his scrutiny, \"Don't say anything,\" she said curtly, \"I'm simply preventing you from getting your greedy claws into her. I know what you're like.\"\r\n\r\n\"What I'm like?\" Jaune's voice rose in indignation, \"What's that supposed to mean?\"\r\n\r\n\"You know exactly what it means,\" Weiss retorted, though she was already beginning to feel slightly foolish about her impulsive declaration. Just slightly, though, \"You have a pattern, Jaune Arc. First me, then Pyrrha would have been next if she hadn't...\" She shook her head, almost tempted to bring up Ruby again before refusing to do so for reasons she couldn't explain, \"And now Amber. You can't just keep collecting women like they're trading cards.\"\r\n\r\nJaune stared at her for a long moment, his expression cycling through confusion, hurt, and finally settling on something that looked suspiciously like amusement, \"Are you... are you jealous?\" he asked, and Weiss could hear the barely suppressed laughter in his voice.\r\n\r\n\"I am not jealous,\" she snapped, her cheeks flushing with what was certainly indignation and absolutely nothing else, \"I am being practical. Someone needs to protect poor Amber from your...\" She gestured vaguely at him, \"Your whole... situation.\"\r\n\r\n\"My situation?\"\r\n\r\n\"Your chronic inability to maintain appropriate professional boundaries!\" Before Jaune could formulate what was undoubtedly going to be an insufferably smug response, Weiss spun on her heel and began marching toward the academy's exit, \"Come on,\" she called over her shoulder, \"We're going to town.\"\r\n\r\n\"Why?\" Jaune asked, though he was already following her with the resigned air of someone who had learned not to question her when she was in full organizational mode.\r\n\r\n\"Because,\" she said with exaggerated patience, \"Even if this date is completely fabricated, I am not going to be seen at a formal event with someone wearing the standard Beacon black suit. It's a matter of personal dignity.\" And definitely not someone wearing an ill-fitting dress. He couldn't even make it look good, despite Pyrrha's claims otherwise.\r\n\r\n\"It's a school dance, not a state dinner,\" Jaune complained, but he was still following her.\r\n\r\n\"The difference being what, exactly?\" Weiss asked, perfectly manicured brow raised, \"Public appearance is public appearance, Jaune. Standards exist for a reason.\"\r\n\r\nAs they made their way toward the airship platform, Jaune muttering under his breath about \"impossible women\" and \"fake dates,\" Weiss allowed herself a small smile of satisfaction. Amber was safe from Jaune's questionable romantic judgment, the dance situation was handled, and she would have the opportunity to ensure her ex-husband didn't embarrass himself - and by extension, her - at a public event.\r\n\r\nReally, it was a perfectly reasonable solution to a potentially problematic situation. The fact that she felt oddly pleased about having an excuse to spend an evening with Jaune was entirely irrelevant and certainly not worth examining too closely.\r\n\r\n[line break]\r\n\r\nDrama over. Next chapter should be pure slice of life now that the leads have some serious breathing. Jaune and Weiss' \"not a date\" plus maybe adding in Amber."
    },
    {
      "title": "Chapter 5",
      "text": "Missing"
    } 
]
}